{
    "\nA special provision that releases warranty can be made, but in that situation, when there are rights that the seller establishes on his/her own for a third party, the seller is not released of warranty.\n": "19",
    "\nThere is a limitation period on pursuance of warranty if there is restriction due to superficies on the subject matter, but there is no restriction on pursuance of warranty if the seller's rights were revoked due to execution of the mortgage.\n": "8 19",
    "\nA compulsory auction is also a sale, so warranty is imposed the same as for an ordinary sale.\n": "19",
    "\nIn cases where a person plans to prevent crime in their own house by fixing the fence of a neighboring house, that person is found as having intent towards the other person.\n": "1 3 22",
    "\nIn cases where an individual rescues another person from getting hit by a car by pushing that person out of the way, causing the person's luxury kimono to get dirty, the rescuer does not have to compensate damages for the kimono.\n": "4 20 14",
    "\nA manager must engage in management exercising care identical to that he/she exercises for his/her own property.\n": "20",
    "\nIn cases where a person repairs the fence of a neighboring house after it collapsed due to a typhoon, but the neighbor had intended to replace the fence with a concrete-block wall in the near future, if a separate typhoon causes the repaired sections to collapse the following week, reimbursement of repair fees can no longer be demanded.\n": "10",
    "\nEven in cases when a parent, based on the authority of parents determined under the law, performs the business of the child as a statutory agent, Management of Business is established.\n": "1 2",
    "\nThe employer is released from his/her liability in cases when proof is provided that the employer made proper care regarding the appointment and supervision of the employee.\n": "22",
    "\nEven in cases when the victim has proven that authority of supervision has been granted to the agent supervisor from the employerprior to the act of injury of the employee, if proof is provided that the agent supervisor exercised reasonable care to the appointment and supervisionof the employee, the agent supervisor is released from liability.\n": "22",
    " Usufructuary rights are only established for real estate. ": "10 11 12",
    "\nStatutory real rights granted by way of security exist, but statutory usufructuary rights do not exist.\n": "20 4 14",
    "\nIn cases where real rights do not require requirements of perfection, the real rights that formed earlier in time take priority.\n": "8 19",
    "\nEven if procedures for auctions petitioned by a lower rank security interest holder have begun, since the  first rank -revolving mortgagee has priority over the lower rank security interest holder regarding selection of the timing of the auction, the first rank revolving mortgagee can stop the auction procedures without fixing the principal.\n": "17",
    "\nIf the principal is fixed, the revolving mortgage will be treated the same as an ordinary mortgage, and thus, interests or damages of secured claims secured by the revolving mortgage shall be limited to the amount of the last two years.\n": "17",
    "\nSince the  limit of performance received in priority by the revolving mortgage is determined by the  maximum amount, and  lower rank  security holders and  ordinary obligees do not possess interest in what kind of obligation will be secured,  the purpose  of the limit of the scope of the secured claim is to protect all mortgagors.\n": "17",
    "\nEven before the principal of the revolving mortgage is fixed, the  third party that performed secured claims after the arrival of the due date can execute the revolving mortgage in subrogation of the revolving mortgager, in order to make the right to obtain reimbursement from the obligor secure.\n": "17",
    "\nSince a  revolving mortgage before the fixing of principal  can be described as a right which dominates the value of the maximum amount  detached from the secured claim, it can be transferred in whole or in part, but since the obligor and the secured claim may change, approval must be obtained from the revolving mortgagor.\n": "17",
    "\nIn cases where an adult ward receives the gift of a building, the adult ward cannot rescindthe relevant gift contract.\n": "1 2",
    "\nIn cases when the adult ward performs juristic acts other than acts related to everyday life, even if the adult ward obtains approval from the guardian of the adult in advance for the relevant juristic act, the adult ward can rescindthe juristic act.\n": "2",
    "\nThe minor that has been appointed a guardian of a minor cannot request a ruling for commencement of guardianship and be appointed a guardian of an adult.\n": "2",
    "\nWhen jointly and severally liable guarantor person C acknowledges a claim from person A to person B before the prescription period has elapsed, the effect of interruption of prescription also affects main obligor person B.\n": "20 7",
    "\nRegarding delay in performance of a claim that occurred due to a commercial transaction, when a civil conciliation which states that the obligor will perform in installments is formed, the period of prescription for the relevant claim shall be 10 years.\n": "18",
    "\nIn cases where person A sold a jewel to person B, person B entered into a contract where person B was assigned to pay the purchase money to person C, and person C expressed his/her intention to enjoy the benefit of the contract, if person A delivered the jewel to person B, and person B has not paid the purchase money to person C yet, while person C can demand that person B should pay  the purchase money, person A can also demand that person B should pay the purchase money to person C.\n": "22",
    "\nIn cases where person A sold a jewel to person B, and person B entered into a contract to pay the purchase money to person C as a performance of a loan obligation which A and D jointly and severally carry towards person C, if person D had already performed the obligation to person C, even after person C has expressed his/her intention to enjoy the benefit of the contract, person A can cancel  the contract upon agreement with person B.\n": "22",
    "\na person who has manifested to a third party that he/she has granted certain authority of agency to other person(s) shall be relieved of his/her liability of apparent authority, if there is any proof  that the third party knew or was negligent  that the other person had not been granted authority of agency.\n": "1 2 3",
    "\nIn cases where person A and person B co-own building X at a ratio of 1:1, if person A dies and had no heirs or persons with special connection, ownership of building X belongs to person B.\n": "10",
    "\nIn cases where person A pays in advance management fees for a building co-owned by person A and person B, and person C receives  the share from person B, person A can demand that person C should  pay for person A's payments.\n": "10 11 13",
    "\nIn cases where the obligee changes residence to a faraway location prior to the due date for  performance, the obligor should bear the delivery costs of the object\n": "18",
    "\nNo contract of joint and several guarantee shall be effective unless it is made in writing, but a contract of guarantee shall be effective even if it is not made in writing.\n": "18",
    "\nIn cases where a contract of revolving guarantee the principal obligation of which is payment of purchase money upon a contract of continuous sales is made, if the maximum amount for the amount of the principal, any penalty and damages in connection with such principal obligation, and all other charges incidental to such obligation is not stipulated, the contract of revolving guarantee shall not be effective.\n": "18",
    "\nIn cases where the obligee has filed a petition for compulsory execution with respect to a claim the subject matter of which is payment of money on any property of the principal obligor, and the court ordered the commencement of such compulsory execution procedure, the principal for the principal obligation under  the contract for revolving guarantee on loans shall be  determined at the time of the filing.\n": "18",
    "\nFor the principal obligation of a contract for revolving guarantee where the guarantor is an individual, in cases where the fixing date of the principal is specified as the day four years after the day that the contract was formed,  the fixing date of the principal is deemed to be the day three years after.\n": "18",
    "\nIn a demand for compensation based on delayed performance of loan claim, if person Y gives proof that the delayed performance is not based on the reasons attributable to him or herself, person Y shall be relieved of the liability.\n": "19",
    "\nIn cases where person X demands compensation of damages of 5% per annum from the day after the due date based on delay of performance of payment of sale purchase money, person X is not required to give proof of either occurrence of the damage  or the amount of it\n": "20 21 14",
    "\nA seller that cancelled a movable sale contract on the basis of duress can demand return of the movable based on its ownership from the person who bought the movable from the buyer prior to the cancellation without knowledge or any negligence.\n": "19",
    "\nA person who made a manifestation of intention which was induced by duress emanated from a third party may rescind such manifestation of intention on the basis of duress, only if the other party knew or was negligent of such fact.\n": "5",
    "\nIn a sales contract subject to  a condition precedent, the buyer that intentionally damaged the object while it is uncertain whether or not the condition has been fulfilled shall bear liability for damages to the seller whose expectation right is infringed.\n": "19",
    "\nEven if the  possessor started the possession without knowledge and was not negligent of another's ownership of the property in cases where he/she subsequently knew another person's ownership during  possession, the period of prescription shall be calculated as a possessor in bad faith.\n": "9 7",
    "\nExtinctive prescription for claims with a specified due date commences to run on the time of arrival of such time limit.\n": "20 14",
    "\nExtinctive prescription for claims with unspecified due date commences to run on the time of arrival of such obligortime limit.\n": "20 14",
    "\nEven while the holder of a right to retention continues the possession of the retained property, extinctive prescription runs for its secured claim.\n": "14 7",
    " Extended parts of the building shall be regarded as appurtenance. ": "10 11 12",
    "\nX, who purchased a real estate P from decedent A before the commencement of inheritance, may assert his ownership of P against Y without registration, if Y, who is the obligee of A's sole heir B, seized P in subrogation to B after B's inheritance registration of P.\n": "10 11 12 13",
    "\nSince rights of retention are real rights that include the right to possess properties, holders of rights of retention cannot demand the return of the property retained by way of an action on title based on rights of retention.\n": "14 7",
    "\nA landowner that leased his/her land and delivered it to a lessee not only may demand the return of such land by way of possessory actions, but also may demand the return of the land by way of actions on title based on landownership, in cases where the land was usurped by a third party.\n": "10 11 12 13",
    "\nIn a case where A bought a registered building owned by B, and subsequently that building's ownership preservation registration was made in B's name, if B sold the building to C and registered the transfer,  A may not asset his/her acquisition of ownership of that building.\n": "10",
    "\nIn a case where A, B, and C co-own a land, D, who has inherited A's share from A, may assert his/her acquisition of A's share against  B and C without completing the registration.\n": "11 12 13",
    "\nA right of retention, a pledge, and a mortgage may also be exercised against Things including monies that the obligor is to receive as a result of the sale, lease or loss of, or damage to, the subject matter of such collateral rights.\n": "20 21 14",
    "\nThe order of priority of a real estate statutory lien, a real estate pledge, and a mortgage is determined by that of the registration.\n": "15",
    "\nIn cases where  a contract that creates a pledge upon a claim that cannot be assigned due to its nature has been made, such contract is void, regardless of whether the pledgee acted in good or bad faith regarding said non-assignability.\n": "16",
    "\nA holder of  a statutory lien on movables may exercise his/her right, even in cases where the movable subject to the statutory lien has been sold and delivered to a third party, if the third party knew of the existence of such statutory lien.movablemovablemovable\n": "15",
    "\nA holder of a right of retention may retain that thing until his/her claim is satisfied in its entirety.\n": "20 14",
    "\nStatutory liens for employer-employee relationships secure salaries paid regularly, but do not secure retirement payments that should be paid when the employee retires.\n": "15",
    "\nIn addition to the principal of the secured claim, pledges of real estates shall secure periodic payments including interest only for those that have fallen due in the most recent two years.\n": "16",
    "\nIn addition to the principal of the secured claim, mortgages that are not revolving mortgages shall secure periodic payments including interest only for those that have fallen due in the most recent two years.\n": "17",
    "\nIn addition to the fixed principal, revolving mortgages with a fixed principal shall secure up to the maximum amount with respect to the periodic payments including interest for those that have fallen due in the most recent two years.\n": "17",
    "\nIf the obligor sold the subject matter of a statutory lien to a third party, the holder of the statutory lien for sales of movables may exercise such right against the purchase money claim accrued from the sales .\n": "15",
    "\nIn cases where the registration for the creation of a mortgage has been made for monetary loan claims, but the principal was not delivered in the end, the mortgagor may demand cancellation of such  registration due to the non-existence of  secured claim.\n": "17",
    "\nA person who uses a mortgaged building based on a lease that may not be asserted against the mortgagee may suspend the vacation of that building to the purchaser for up to 6 months from the time that the purchaser purchased the building in cases where the building was auctioned, if he/she has been using it prior to the commencement of auction proceedings.\n": "17",
    "\nA registered lease may be asserted against  the mortgagee who gave  consent to the lease, if the entire mortgagee who had registered their respective mortgage before the lease's registration gave consent to the lease.\n": "17",
    "\nIf a building existed on a mortgaged land at the time it was mortgaged, even if the owner of that building did not have the right to possess the land which may be asserted against the mortgagee, the mortgagee may not auction the building together with the land.\n": "17",
    "\nHolders of superficies created upon mortgaged real estates may not make a claim for the extinction of the mortgage.\n": "17",
    "\nEven if the owner of a mortgaged property acquires fruits derived after the default of the secured claim, it shall not be a case of unjust enrichment.\n": "17",
    "\nThere are cases when compensation of damages may be demanded besides demand for the enforcement of performance.\n": "18",
    "\nThere are cases where only compensation of damages may be demanded, while enforcement of performance may not be demanded.\n": "18",
    "\nA third party acquirer of a mortgaged real estate obligormay not subrogate to the secured claim of the obligee against the guarantor.\n": "17",
    "\nThe mandate shall terminate when the mandatary is subject to a ruling for the commencement of bankruptcy procedures, but shall not terminate when the mandator is subject to such ruling.\n": "19",
    "\nThe mandate shall terminate when the mandatary is subject to an order  for the commencement of guardianship.\n": "19",
    "\nRegardless of the other party's knowledge, the grounds of termination of mandate may not be asserted against the other party unless the other party was notified of the same.\n": "19",
    "\nEven if contrary to the intentions of the principal, management of business may be established, and in that case, the manager may request reimbursement for expenses incurred for the principal  solely to the extent such principal actually enriched.\n": "20 14",
    "\nUnless a Manager engages in the Management of Business in order to allow a principal to escape imminent danger to the principal's person, reputation or property, the manager must manage the business with due care of a prudent manager.\n": "20 14",
    "\nA manager must report the progress and results to the principal without delay upon completion of the management of business.\n": "20 4 14",
    " A minor may not be an agent. ": "2",
    "\nAssuming a person is a minor, then in regards a permitted, specific business, he/she has the legal capacity to act.\n": "2",
    "\nAn  act of paying electricity charges by adult ward without obtaining the consent of his/her guardian is not voidable.\n": "2",
    "\nA person under curatorship's act of accepting payment for a loan without obtaining the consent of his/her curator's  is voidable.\n": "1 3",
    "\nIf a person under curatorship commits a voidable act, the counterparty of that act may issue a notice to any person under curatorship which demands that he/she should obtain the ratification of his/her curator, but may not directly issue the notice to the curator which demands a response of whether or not the curator has ratified.\n": "1 2",
    "\nA self-contract and representation of both parties shall not produce an effect as a general rule, excluding acts of performance of any obligation and acts authorized by principle in advance, but since it is a system made to protect the principle, he/she may make it valid if he/she ratifies it as an act of unauthorized agency.\n": "18 19",
    "\nA subagent's acts are equivalent to an agent's acts because he/she does not act in agency for the agent, but in agency for the priciple, so it is sufficient if he/she indicates that his/her acts are made on behalf of the principle.\n": "5",
    "\nEven while a holder of a right of retention continually possesses the retained object, extinctive prescription progresses for that secured claim, but if the pledgee continually possesses the Thing pledged, then the extinctive prescription for that secured claim may be interrupted.\n": "4 6",
    "\nSince a pledge differs from a right of retention as a right to contracted collateral, if there is a contract, then a pledge may be established by a person acting as an agent allowing the pledgor to possess the collateral.\n": "16",
    "\nA right of retention and a pledge do not expire by just satisfying his/her a portion of the secured claim due to their indivisibility, but for a right of retention, the obligor may demand the expiration of the right by offering appropriate collateral.\n": "4 20 14",
    "\nIf a holder of a right of retention has consent of the obligor, or if a pledgee has consent of the pledgor, then they each may lease any collateral.\n": "4 6",
    "\nA pledgee must possess a pledged Thing with the  care of a good manager.\n": "16",
    "\nA gratuitous depositary shall assume the duty to retain the Thing deposited  with the care of a good manager.\n": "11 21 6",
    "\nNo contract of guarantee shall be effective unless it is made in writing, but when it is concluded with an electromagnetic record,  it is deemed to be made in writing.\n": "18",
    "\nIf a guarantor contracted a penalty for guaranteed debt with an obligee, the guarantor's burden may become heavier due to the burden of the principal obligor.\n": "18",
    "\nWhen the principal obligation has fallen due, a person that made a guarantee after receiving consignment of the principal obligor may exercise the right to obtain reimbursement vis-a-vis the principal obligor even before making his/her own payment.\n": "18",
    "\nWhen a maximum amount is not stipulated in a contract of revolving guarantee between juridicial persons that will take on obligation of a monetary loan as their primary obligation, that contract of revolving guarantee shall not become effective.\n": "18",
    "\nPerformance deposit may be done when the obligee refuses the receipt of performance when the obligee is unable to accept the performance, or when the obligor is unable to ascertain the obligee without any negligence on the part of the performer.\n": "18",
    "\nObligation for which performance deposit is made shall expire when the obligee receives the thing deposited.\n": "18",
    "\nThe obligor may not recover the deposited property without consent of the obligee after performing performance deposit.\n": "18",
    "\nTo use money or documents of title for performance deposit, they shall be put in the official depository of the place of performance of the obligation.\n": "18",
    " A person other than the obligor may not do performance deposit. ": "18",
    "\nThe plaintiff must assert that he/she entered into a sales contract with the defendant as the cause for action, but does not need to assert that he/she owned the subject matter of the sales contract when he/she entered into it.\n": "19",
    "\nA quasi-loan contract shall not become effective when old obligation as its subject matter does not exist.\n": "19",
    "\nWhen a lessee of a building repaired a leak in the roof at his/her own expense that the lessor should repair, he/she may immediately demand reimbursement of the entire amount of the repair expenses from the lessor.\n": "19",
    "\nAn employment contract is a contract for value, and the timing of payment of remuneration shall be deferred payment in principle, but a special provision for advance payment may be entered.\n": "19 5",
    "\nA contract for work is a contract for value, and when there is a need to transfer the subject matter, the renumeration must be paid simultaneously with delivery, and when there is no need to deliver a thing, it must be paid simultaneously with the completion of work.\n": "19",
    "\nA mandate contract is gratuitous contract in principle, but if there is a special provision,  the mandatary may demand renumeration from the mandator.\n": "19",
    "\nA worker has a statutory lien for the general assets of an employer as collateral for the claim to renumeration that he/she has.\n": "15",
    "\nIf the execution of business for a partnership is mandated, the operating officers shall be selected from among the partners.\n": "19",
    "\nA partner may receive a refund of his/her share assuming he/she was expelled.\n": "19",
    "\nPartners bear the the responsibility for the performance of obligation jointly and mutually vis-a-vis the partnership's obligees.\n": "19",
    " If a partner dies, his/her heir shall assume his/her position. ": "19",
    "\nA partner may not demand the division of partnership property before liquidation, and even if a partner disposes his/her share with respect to the partnership, the disposal may not be asserted against  the partnership in his/her appropriation.\n": "19",
    "\nIf a plaintiff files against a person with the legal obligation to supervise a person without capacity to assume liability as a defendant, and demands compensation of damages based on the liability of the person with the obligation to supervise a person without capacity to assume liability in Civil Code Article 714, Paragraph 1, the defendant may assert that he/she did not neglect his/her obligation to supervise as an affirmative defense.\n": "22",
    "\nIf a plaintiff files against a person with the legal obligation to supervise a person without capacity to assume liability as a defendant, and demands compensation of damages based on the liability of the person with the obligation to supervise a person without capacity to assume liability in Civil Code Article 714, Paragraph 1, the defendant may assert that an agent supervisor was there in addition to the person with the obligation to supervise as an affirmative defense.\n": "9 22",
    "\nIf a plaintiff files against the employer of person A as the defendant on grounds that pressupose the establishment of liability by person A's tortious act, and demands compensation of damages based on the liability of the employer in Civil Code Article 715, Paragraph 1, the defendant may assert that he/she exhausted his/her duty of care as deemed appropriate for the assigned supervision of person A as an affirmative defense.\n": "22",
    "\nIf a plaintiff files against an agent supervisor of person A as a defendant on grounds that presuppose the establishment of liability by person A's tortious acts, and demands compensation of damages based on the liability of the agent supervisor in Civil Code Article 715, Paragraph 2, the defendant may assert that even by exercising his/her duty of reasonable care for the assigned supervision of person A, he/she could not have been avoided person A's creation of an injurious act as an affirmative defense.\n": "22",
    "\nIf a plaintiff files against a land owner as a defendant, and demands compensation of damages based on the liability of owner of structure on land proviso in Civil Code Article 717, Paragraph 1, the defendant may not assert that he/she exercised his/her required duty of care in order to prevent the occurrence of the results as an affirmative defense, but he/she may assert his/her own doli incapax as an affirmative defense.\n": "10 11 12 13",
    "\nIn the case of concealment of true intention, assuming the other party was unaware of the true intention of the party making the manifestation, and there was no gross negligence regarding that lack of knowledge, that manifestation of intention shall be valid.\n": "5",
    "\nAny performance made vis-a-vis a quasi-possessor of a claim is effective when the performer acts without knowledge, and is free from any negligence.\n": "18",
    "\nAcceptance made by a minor that received an offer of gifts without burden without getting consent from his/her statutory agent may not be rescinded.\n": "2",
    "\nIf a minor, after getting permission for carrying a business from his/her statutory agent, performs an act unrelated to the business without getting consent of the statutory agent, that act may not be rescinded.\n": "2",
    "\nThe purchase of daily household items may not be rescinded, even if an adult ward performed the act.\n": "1 3",
    "\nIf a person under curatorship performs, without getting the consent, an act that requires  getting consent from his/her curator, the curator may ratify that act, but may not rescind that act.\n": "1 2 3",
    "\nThe person in question may not request a  commencement of guardianship, but he/she may request a  commencement of curatorship.\n": "2",
    "\nA possessor in good faith shall acquire fruits derived from  Thing in his/her possession , but a person in possession Thing through duress shall be obliged to return fruits, and if the fruits have already been consumed, he/she shall be obliged  to reimburse the cost of the fruits.\n": "9 7",
    "\nA seller may collect fruits until a delivery, even if the delivery of the subject matter is delayed.\n": "19",
    "\nA  pledgee of immovable peroperty may use and receive the profits from the immovable property that is the subject matter of a pledge, in accordance with the method of its use, but may not collect fruits derived by the real property.\n": "16",
    "\nIf person A donates a house that he/she is renting to person C with a provision for the payment of rent at the end of every month to person B midway through the month, if there is a special agreement between person A and person B, the rent for the month will be distributed between person A and person B in proportion to the number of the days.\n": "1 3",
    "\nIn a cases where a person who is not an obligor has performed an obligation by mistake, if the obligee  waived the security in good faith, the person that performed the obligation may not  demand return of the performance even without having been grossly negligent.\n": "18",
    "\nAssuming a contract is void due to a mistake, after the person making the manifestation ratifies it  knowing that such act is void, the contract shall become effective retroactively to the time of the act.\n": "19",
    "\nIf person B hinders the exercise of ownership for a thing owned by person A using methods other than possession of the thing, person A's ability to demand the removal or discontinuance of the disturbance from B based on ownership is limited to when person A incurs serious and considerable irreparable damage due to person B's disturbance.\n": "11 12 13",
    "\nAn agent may even acquire a possessory right, but since the effect of possession by the agent belongs to the principle, the agent him/herself may not acquire an individual possessory right for the thing possessed.\n": "9",
    "\nAn action for recovery of possession mustl be brought within one year from the time when possession was unlawfully usurped.\n": "9 7",
    "\nAfter person A, who is the owner and depositor of a moveable, orders person B, who is the depositary, to thenceforward possess the moveable on behalf of third party person C, and person C consented thereto, person C shall acquire the possessory right for the moveable.\n": "9",
    "\nIf person A, who is the owner and lessor of a moveable, enters into a sales contract with person B, who received the transfer as a lessee, then person A loses the possessory right for the moveable due to the manifestation of intention of person A and person B to the effect that the possessory right is transferred.\n": "9 22",
    "\nIf person B, who is the depositary and gets approval from person A, who is the owner and depositor of a moveable, entered into a deposit contract with third party, person C for the moveable and transferred it, then person B loses the possessory right for the moveable.\n": "9 22",
    "\nIf person A, who is the owner of a moveable and possesses it him/herself, enters into a sale contract with person B, and simultaneously enters into a loan  contract for use with person B as the use lender and person A as the lease borrower, then person B acquires the possessory right for the moveable due to the manifestation of intention of person A to the effect that he/she will thenceforward possess the thing on behalf of person B.\n": "9",
    "\nAn owner of one part of neighboring land may demand the cooperation of another owner of the land in installing boundary markers at shared cost, and the boundary markers installed as a result of that cooperation shall be presumed to be co-owned by the neighbors.\n": "10",
    "\nAssuming there is a need to maintain a distance of 50 centimeters or more from the boundary line when building a building, after a year lapses from the time when such construction started, or if that building has been completed, the owner of the adjacent land may not demand changes to the building and may only claim damages.\n": "10",
    "\nIf an owner of one part of neighboring land repairs a building on the owned land, then he/she may request the use of the neighboring land to the extent necessary for repairing the building from his/her neighbor, however he/she may not enter the dwelling house of the neighbor without the approval the same.\n": "10",
    "\nIn cases where person A, who owns land L, subdivides the land into land M, which is surrounded by other  land and has no access to public roads, and land N, which is not so, then sells land M to person B, person B has the right-of-way to reach public roads only regarding land N.\n": "10 11",
    "\nA right of retention is not established if the obligee with a secured claim does not possess the subject matter, and even if he/she temporarily has possession, the right shall not be established in cases where the possession commenced by means of a tortious act.\n": "9 14 7",
    "\nA right of retention is not established when a secured claim has not yet fallen due.\n": "14",
    "\nA holder of a right of retention may not accept priority performance from the subject matter, but may accept priority performance from fruits that derived from the subject matter.\n": "4 20 14",
    "\nThe statutory lien of a lessor of a building shall  exist with movables furnished to that building by the lessee.\n": "15",
    "\nAn obligee that has a general statutory lien may exercise the statutory lien concerning money that the obligor has received in payment as compensation for that Thing owned.\n": "15",
    "\nPledges cannot be created over a Thing that cannot be assigned to others.\n": "16",
    "\nA pledge creation contract that has immovable properties or movables as its objective shall take effect by delivering the subject matter, but this transfer may be either a summary transfer or a transfer of possession by instruction.\n": "16",
    "\nA pledgee and a pledgor may not agree to the pledgee's acquisition of the Thing pledged as performance for obligations, even after the due dates for performance of his/her obligations secured by the pledge.\n": "16",
    "\nIn cases where a building owned by person A is built on land owned by person A, and then after a mortgage is created as a joint mortgage for person B with respect to  the building and the land, the result of the execution of the mortgage with respect to the land only is that person C became the land owner, then statutory superficies with respect to the building on the land will be established.\n": "17",
    "\nAssuming that a recovery obligation due to cancellation is understood as a different l obligation that is not identical to the original obligation, whenever it is considered whether or not the recovery obligation due to contract cancellation being included in the scope of the guarantee obligation is a problem in the interpretation of intention of the party in the guarantee contract, the guarantor for the seller in a sales contract for specified Thing may be understood to bear responsibility for the guarantee even for the recovery obligation in cases where the contract is cancelled due to default by the seller.\n": "19",
    "\nIn order for a guarantor to exercise the right of defense of obligor's solvency, he/she must prove that the principal obligor has the financial resources to pay his/her obligation and that the execution would be easily performed.\n": "18",
    "\nRegarding the provision in the Civil Code that states, \"a guarantor may raise a defense vis-a-vis the obligee by setting off any claim which the principal obligor may have vis-a-vis the obligee\", when considering that the guarantor is given the authority to set off any claim that the principal obligor has, the guarantor will be understood to have the right of affirmative defense that refuses the performance of the guarantee obligation for the corresponding amount.\n": "18",
    "\nIn cases where a guarantor has given a guarantee as entrusted by the principal obligor, if he/she had a judgment ordering him/her to perform the obligation to the obligee, or has performed the obligation on behalf of  the principal obligor, or has otherwise in exchange for his/her own property performed any other act intended to cause the obligation to be extinguished, as long as the guarantor has not been negligent at any time whatsoever, that guarantor has a right to indemnification against the principal debtor.\n": "18",
    "\nIf an obligor acknowledges assignment of a claim  vis-a-vis either the assigner or the assignee, the assignee may raise the assignment as a defense against the obligor.\n": "18",
    "\nIf an obligor has given an acknowledgement without objection  to the assignor of a claim, even if the claim was satisfied, he/she may not refuse the performance of the obligation vis-a-vis the assignee, but may demand the return of the payment money vis-a-vis the assignor.\n": "18",
    "\nAny performance vis-a-vis a person that has no authority to receive the payment has no effect vis-a-vis the creditor, except in cases where it has an effect as a payment vis-a-vis a holder of quasi-possession  of the claim.\n": "18",
    "\nIn cases where there is any instrument which evidences the claim for wages, the borrower may assert the fact that he/she will make a payment by returning and exchanging the instrument when attempting to make the performance has completed his/her entire performance.\n": "19",
    "\nIf a third party obligor who has been enjoined from making payment has paid his/her obligation to his/her own obligee, the relevant obligee shall not entitled to request such third party obligor to make payment, even to the extent he/she suffered the damages.\n": "18",
    "\nUnless  any other intention is manifested with respect to the expense of performance, such expenses shall be borne by the obligee, but in cases the relevant obligor caused the expense of performance to increase by relocating his/her domicile or taking any other acrtions, such incremental amount shall be borne by the  obligor.\n": "18",
    "\nIn cases where an active claim extinguished due to prescription, set-off may not be performed, but the adverse party may abandon the benefits of prescription and effect the set-off.\n": "18",
    "\nEither the donor or the donee may revoke gifts not in writing. However, that this shall not apply for any portion of the gift for which performance has been completed.\n": "19",
    "\nSince a mandate contract is a consensual contract, it shall be effective if there is an oral agreement. However, in order to assert the effect of a mandate contract to a third party, it must be documented in writing.\n": "19",
    "\nIf a mortgage creation contract has the agreement of the mortgagee and of the mortgagor that has ownership of the subject matter of the mortgage, it will be effective even if it is not in writing and there is no registration of its creation.\n": "17",
    "\nA guarantor may revoke a contract of guarantee that is not in writing. However, this shall not apply for the portion that has been performed.\n": "18",
    "\nA person who commences the management of a business for another person without being obliged to do so may not demand compensation from the principal, even if he/she expends useful expenses for the principal, when that management is against the intention of the principal.\n": "20 7",
    "\nA third party who has no interest in an obligation may not perform the obligation against the will of the obligor.\n": "18",
    "\nA third party who has no interest in an obligation may not guarantee an obligation against the will of the obligor.\n": "18",
    "\nIf a building that is the subject matter of a job in a building contract has any defect, and  the purpose of the contract cannot be achieved because of the defect, the party ordering the work may cancel the contract for that reason.\n": "19",
    "\nThe cancellation of a partnership contract  shall solely become effective toward the future.\n": "19",
    "\nIf after a sales contract for moveables is entered and a portion of the purchase price is paid, the sales contract is cancelled due to default of the seller, then he/she bears an obligation to compensate the buyer for damages, but in returning the portion of the purchase price that was received, there is no need to add interest from the time of that receipt of those moneys.\n": "19",
    "\nIn cases where person C was unaware that the ownership of real property L belonged to person A at the time of the execution of the sales contract between person B and person C, since person C is mistaken regarding an essential element of the sales contract, and the contract is not effective, person B bears no obligation to acquire ownership from person A and transfer it to person C.\n": "10 11 12 13",
    "\nProvisions for statutory liens for real property construction are established in the Civil Code.\n": "15",
    "\nA minor can freely dispose of assets the statutory agent permits the disposition without specifying the purpose.\n": "2",
    "\nIf the other party of a manifestation of intention was a minor when the manifestation of intention was received, that manifestation of intention does not take effect.\n": "5",
    "\nIn cases where a person who has consented to the sale of real property due to duress of a third party, and the other party does not know of the duress, the person cannot rescind the consent.\n": "4 6",
    "\nEven when a person, who carries a purchase-money obligation due to the sale of real property, while a minor pays the purchase money after becoming an adult, the person can rescind the sale with the reason of being a minor at the time of the sale.\n": "19",
    "\nFor a contract executed by a person under curatorship, although the other party issue a notice to the person under curatorship which demands, by establishing a certain period which is one month or more, that he/she should obtain the ratification of his/her curator , the person under curatorship fails to issue, within the applicable period, from that point on, that other party cannot rescind the contract for the reason that the contract was executed by the person under curatorship.\n": "19",
    "\nIf no period is provided in relation to the manifestation of intention for a completion in a pre-contract to sell or purchase, regardless of whether or not the party to the pre contract issued a notice of demand to the other party, specifying a reasonable period, for the other party is to give a definite answer as to whether or not he or she would complete the sale, if no definite answer has been given, the party to the pre contract cannot demand execution of the contract of sale to the other party.\n": "19",
    "\nFor a contract completed by an unauthorized agent, regardless of the fact that the counterparty requires the principal, by fixing a reasonable period of time, to make a definite answer on whether or not he/she will ratify within such period of time , if no definite answer has been given, the other party can demand execution of the contract to the principal.\n": "18 19",
    "\nA time limit can be added to the manifestation of intention of offset, but conditions cannot be added.\n": "18",
    "\nIn cases where the obligor of monetary debt has the obligation to provide security, if the security is not provided, the obligor cannot assert the benefit of the time.\n": "18",
    "\nA juristic act which is subject to a condition precedent is void if the condition is dependent on  the willof the obligor.\n": "5",
    "\nWhen a tree or bamboo branch from neighboring land cross a boundary line, the person can remove the branch him or herself, but cannot have the owner of that tree or bamboosever the branch.\n": "10",
    "\nIf two or more movables with different owners are so joined to each other that they can no longer be separated without damaging the same, ownership of the composite Thing shall vest in the owner of the principal movables.\n": "10",
    "\nIf the distinction of principal and accessory cannot be made between the joined movables, based on a demand by one or several owners of each of the movables, the owners shall be determined by court.\n": "10",
    "\nEven if there is an interruption of prescription in favor of one co-owner of dominant land, due to factors of the other co-owners, such extinctive prescription proceeds.\n": "12 13",
    "\nA pledgee can sub-pledge a Thing pledged without the approval of the owner of the Thing pledged.\n": "16",
    "\nPledges on movable property do not take effect if there is no delivery, and thus, for that movable, multiple pledges cannot be created.\n": "16",
    "\nIf the possession of the pledgee of a pledge on movable property is stolen by a third party, the pledgee can demand the return based on the pledge.\n": "16",
    "\nThe obligor of a claim whose subject is the delivery of  any specified things carries the duty to preserve that thing until the delivery is performed with the same  care  he/she would exercise over his/her own property.\n": "18",
    "\nEven if the amount of the claim was specified in the currency of a foreign state, the obligor can make the payment in the legal currency of Japan instead of currency of the foreign state.\n": "18",
    "\nIf the subject of the claim is to be identified by way of choice among more than one performance, the right to make the choice shall vest in the obligor as long as there is no special provision.\n": "18",
    "\nIf the subject of the claim is to be identified by way of choice among two performances, if one of the performances becomes impossible in the future not due to fault of persons involved that do not possess the right to choose, then the subject of the claim is identified  as the other performance.\n": "18",
    "\nIn cases where an obligor does not perform an obligation, the agreement of the parties involved that the obligee\n": "18",
    "\nAn obligor of a partnership cannot set off his/her obligation against his/her claim against the partners.\n": "19 5",
    "\nIf the mandatary suffer any loss due to the administration of the mandated business s without negligence in the mandatary, he/she can claimcompensation for the loss from the mandator.\n": "19",
    "\nIn a revolving guarantee contract on loans, even if the principal determination date is determined, if the maximum amount is not stipulated, it shall not be effective.\n": "19",
    "\nA lessor who cancels a lease contract for reasons of unauthorized subleasing, and demands the lessee to return the subject matter is not required to demonstrate proof that he/she did not consent to the sublease.\n": "19",
    "\nIf the assignee of a claim demands the obligor to execute the assignment of the claim, in order for the obligor to refuse this, he/she is not required to demonstrate proof that there was no notification or consent regarding the claim assignment.\n": "18",
    "\nEven if the obligor of a monetary debt brings cash to the address of the obligee and demands acceptance, in cases where the obligee refuses to accept, even if the cash is not presented in front of the obligee, the provision is deemed as actual.\n": "18",
    "\nIn cases where the obligor of a monetary debt provides actual performance on the time of performance, but the obligee refuses to accept the performance, the obligor does not carry the duty to pay delinquent charges after the provision.\n": "18",
    "\nIn cases where a gift of the specified thing is made without the donee bearing the responsibility, if the donor made the gift without knowing that the subject matter has a defect, the donor shall not assume a warranty for the defect.\n": "19",
    "\nIn cases where a lessee has defrayed necessary expenses with respect to the leased Thing in order to preserve the condition appropriate for profit from ordinary use of the subject, the lessee can wait for the end of the lease and demand the reimbursement of the same from the lessor.\n": "18 19",
    "\nA lease without a specified term can be requested to be terminated at any time, and doing this will terminate the lease immediately.\n": "19",
    "\nIn cases where the lessee of a movable has obtained the consent from the lessor who is the owner to sublease the movable to a sub-lesseef, when the term of the lease between the lessee and the lessor finishes, and the lease is not renewed, the lessor can demand the sub-lessee to return the subject based on ownership.\n": "10",
    "\nIn cases where the contractor demands the party ordering work to provide remuneration, if there is any defect in the subject matter of work performed, and the party ordering work demands that the contractor repair the defect, the party ordering work can refuse to pay remuneration.\n": "19",
    "\nEven in cases where consent has been reached between a mandator and a mandatary for the payment of remuneration, if the mandatary cancels the contract of mandate in the middle of performance of the mandated business, the mandatary cannot demand payment of remuneration.\n": "19",
    "\nIf the mandatary has incurred costs found to be necessary for the administration of the mandated business, the mandatary can claim the  reimbursement of those costs from the mandator and any interest on the same from the day the costs were incurred.\n": "19",
    "\nIf the  mandatary,  received monies and other Things during the course of administrating the mandated bushiness, the mandatary must immediately deliver them to the mandator.\n": "8 19",
    "\nEven in cases where costs, incurred by a mandatary in order to administrate the  mandated business with the care of a good manager, are later deemed as a result not to be necessary, the mandatary can demand reimbursement of those fees to the mandator.\n": "19",
    "\nIn a lawsuit demanding the payment of purchase money based on a contract of sale of real property, proof must be demonstrated with objects of the claim of the conclusion of the contract of the sale and the determination of the time of performance of the monetary claim.\n": "19",
    "\nIn a lawsuit demanding the delivery of a subject matter based on a contract of sale of real property, proof must be demonstrated with objects of the claim that the contract of sale was concluded and the ownership of the subject matter was attributed to the seller at the time of the conclusion of the contract.\n": "19",
    "\nIn a lawsuit demanding the return of a subject matter based on the completion of a lease contract of movables, proof must be demonstrated with objects of the claim of the conclusion of the lease contract, the delivery of the subject matter based on the contract, and the facts that prove the completion of the lease contract.\n": "19",
    "\nIn a lawsuit demanding the advance payment of costs by a mandatary based on the contract of mandate, proof must be demonstrated with objects of the claim of the conclusion of the contract of mandate and the determination of remuneration.\n": "19",
    "\nIn a lawsuit demanding the payment of remuneration based on a contract for work, proof must be demonstrated with objects of the claim that the contract for work has been concluded and, if the delivery of the subject matter of work is required, that this has been delivered.\n": "19",
    "\nThe beneficiary in bad faith of unjust enrichment must return the benefit received together with interest, and if any damages still remain, the beneficiary shall be liable to compensate for the same.\n": "4 21 6",
    "\nEven if an obligation does not exist, a person who knows that fact, or does not know by negligence and has tendered anything as performance of an obligation, that person cannot demand the return of the thing tendered.\n": "21 6",
    "\nIn cases where an obligor mistakenly believes that a time of performance has arrived due to a mistake and has tended anything as  performance of his/her own obligation that has not yet fallen due , the obligor cannot demand the return of the thing tendered.\n": "18",
    "\nPerformance by a third party is also effective, and thus even if the an obligation of another person has been performed by mistake, the person who made the performance cannot demand the return of the performance to the obligee.\n": "18",
    "\nIn cases where duress was induced by a third party, if the counterparty of the manifestation of intention does not know of that fact, the person who makes the manifestation cannot rescind the manifestation of intention.\n": "5",
    "\nIn cases where the person who makes the manifestation believes a fictitious explanation of the counterparty and makes a manifestation of intention, if there was no intention of fraud for the counterparty, the person who makes the manifestation will not be rescued under Civil Code.\n": "5",
    "\nIn cases where the person who makes the manifestation forms a contract based on the fraud of the other person, even if the obligation of the other person is not yet executed based on the contract, the person who makes the manifestation cannot refused execution of his or her obligation for reason of fraud as long as the manifestation of intention is not rescinded.\n": "5",
    "\nIn cases where a buyer who deceives a seller receives the transfer of ownership of land, before the seller rescinds his or her manifestation of intention due to fraud, even if someone has accepted the establishment of a mortgage of the land without knowing of the fraud, the seller can revoke the manifestation of intention.\n": "19",
    "\nThe effect of manifestation of intention occurs when it arrives at the counterparty, and thus, a contract with a person at a distance forms when the manifestation of intention of acceptance arrives at the counterparty.\n": "5",
    "\nIn cases where, against a demand of whether or not to ratify an act of a person with limited capacity, a statutory agent issues notification of refusal to ratify within the specified period, and it arrives after the lapse of the period, it is deemed as having been ratified.\n": "5",
    "\nAfter the manifestation of intention of acceptance is issued for the petition for a contract, in cases where the offeree dies before the arrival, if the counterparty knows of the fact of the death of the offeree, the contract  does not become effective.\n": "19",
    "\nEven if it is a contract offer with a determined consent period, if the period is before or at the same time as the arrival of the offer, it can be revoked.\n": "19",
    "\nEven in cases where the principal ratifies an act of unauthorized agency toward an unauthorized agent, if the counterparty does not know of this fact, he or she can exercise the right to rescind.\n": "5",
    "\nThe counterparty of an act of unauthorized agency can determine a reasonable period of time for the principal and demand to ratify or not to ratify during that period, and if the principal does not provide a definite answer within the time period, the principal is deemed to have ratified.\n": "5",
    "\nIn cases where a  privately appointed agent  appoints a subagent due to unavoidable reasons, the sub-agent only possesses a legal relationship with the agent, so acts of the subagent are not acts of agency for the principal.\n": "5",
    "\nA privately appointed agent can be a minor, but acts of agency by a minor can be rescinded by the statutory agent.\n": "5",
    "\nIn cases where a minor rescinds a juridical act performed without the consent of his or her statutory agent, if the counterparty of the act has been identified, the rescission is made by the manifestation of intention to the counterparty.\n": "5",
    "\nIf a person promises in a contract that he or she will tender a certain performance to a third party other than the counterparty, in cases where this is rescinded due to fraud of the counterparty, if manifestation of intention of profit is already made by the third party, the rescission is  made by the manifestation of intention to the third party.\n": "18",
    "\nThe rescission of  a fraudulent act is performed by the court based on the demand of the obligee.\n": "18",
    "\nProvisions for immediate acquisition do not apply in cases where the property of an inheritee that possessed another person's movables is succeeded by inheritance.\n": "8 4",
    "\nIf person accepts the transfer of movables owned by the counterparty, who is incapable of intention, and the person is in good faith and without fault regarding the incapability of intention of the counterparty, he or she acquires the ownership of the movable due to immediate acquisition.\n": "10 11 12",
    "\nBy possessing a movable without an owner with the intention to own, the possessor acquires ownership of the movable.\n": "9 7",
    "\nIf the possession of an item is forcibly dispossessed by the possessor, even in cases where the possession before the dispossession was performed with the intention to own, and in cases without intention to own, the possessor can demand the return of the item based on action for the recovery of possession.\n": "9",
    "\nA possessor is presumed to possess in good faith, peacefully, and in public, but is not presumed to have intention to own.\n": "9",
    "\nIn cases where it is assumed, due to the nature of the title, that a possessor does not have the intention to own, if the possessor commences possession under a new title with an intention to own from that time, the nature of the possessor's possession changes with the intention to own.\n": "8 9 14",
    "\nWhen the possessor acquires fruits from a thing under his or her possession, ordinary necessary expenses shall be borne by the possessor.\n": "9 7",
    "\nIf a holder of a right of retention incurs necessary expenses with respect to the Thing related, he or she can have the owner reimburse the same.C. A mandatary can demand the mandator the day after the completion of the mandate for reimbursement of fees paid that were recognized as necessary expenses for the administration of the mandated business.\n": "10 11 12 13",
    "\nIf borne obligations are deemed to be necessary for the retention of a deposited thing, the depositary can demand that the depositor perform the obligation on the depositary's behalf. In such cases, if the obligation has not yet fallen due, the depositary can require the depositor to tender reasonable security.\n": "18",
    "\nEven in cases where the manager in management of business has engaged in the management of business against the intention of the principal, if the manager has incurred useful expenses  for the principal, the manager may claim reimbursement of all costs from the principal.\n": "20 14",
    "\nThe contents of performance that can be refused based on rights of retention are the delivery of the thing, but the contents of performance that can be refused based on rights of defense of simultaneous performance are not limited to the delivery of the thing.\n": "18",
    "\nA person who is being exercised rights of retention can demand that the right be extinguished by tendering reasonable security, but a person who is being exercised rights of defense for simultaneous performance cannot demand that the right be extinguished by tendering reasonable security.\n": "14 7",
    "\nIn cases of pledges over nominative claims, if there is an instrument for the claim, the pledge establishment does not take effect unless the instrument is delivered.\n": "16",
    "\nThe pledgee of claim X that is a nominative claim can directly collect claim X if the time of performance of the secured claim arrives along with the time of performance for the claim X that is the subject matter of the pledge.\n": "16",
    "\nIn cases where a nominative claim where the obligee is an individual is the subject matter of a pledge, to assert the establishment of the pledge against a third party other than the obligator of the claim that is a subject matter of the pledge, the notification or acknowledgement using an instrument bearing a fixed  date is required.\n": "16",
    "\nIf the obligor of a monetary debt cannot pay on the time of performance due to force majeure, the obligor of the monetary debt does not bear responsibility of delay in performance.\n": "18",
    "\nUntil the principal obligor offsets with a possessed claim, the guarantor cannot raise a defense vis-a-vis the obligee by setting off any claim.\n": "18",
    "\nIn cases where, after jointly borrowing 1,000,000 yen from two money lenders one of the jointly and several obligors rescinds the contract for reasons that he or she is an adult ward, the other jointly and several obligors is revoked of the portion of the obligation of the adult ward.\n": "19",
    "\nA bearer of a receipt, regardless of the subjective conditions of the performer regarding that person's authority, is deemed to have the authority to accept performance.\n": "18",
    "\nIn cases where the claim whose period of extinctive prescription has passed is in a state of offset with and the opposing claim possessed by the obligor before the period has passed, the obligor that possess the claim whose period of extinctive prescription has passed can perform the offset regardless of whether the invocation of prescription is made before the period of extinctive prescription has passed or after.\n": "20 7",
    "\nIn cases where the subject of a sale has a latent defect, if the buyer cannot achieve the purpose of the contrac due to the existence of the defect, the buyer can cancel the contract.\n": "19",
    "\nIn cases where the subject of a sale has a latent defect and the buyer can cancel the contract due to that reason, along with the cancellation of the contract, the buyer can demand the seller to compensate damages.\n": "19",
    "\nIn cases where the buyer demands the seller to cancel the contract and compensation for damages based on warranty against defects, the buyer must do this within one year of the formation of the contract of sale.\n": "19",
    "\nIn cases where a compulsory auction was conducted for a used building, the purchaser of the building can demand the original building owner to compensate damages due to the reason that the building has a latent defect.\n": "10",
    "\nIn cases where a portion of purchased land is owned by a person other than the seller, and the buyer knows this at the time when the contract is concluded, if the seller cannot transfer this to the buyer, the buyer cannot demand the seller\n": "19",
    "\nIn cases where person A is responsible for an obligation toward person B, and performs the entire obligation while knowing that it is before the time of performance, if person B acquires benefit by operating it until the time of performance, the benefit is deemed unjust enrichment in regards to the relationship with person A.\n": "1 2",
    "\nAny person who has insufficient capacity to appreciate right or wrong due to any mental disability may not request a ruling of commencement of assistance in person.\n": "1 2 3",
    "\nWith respect to any act which requires the consent of the curator, if the curator does not give consent in cases where the interest of the person under curatorship is unlikely to be prejudiced, the person under curatorship may make a claim to the family court for a permission in lieu of the consent of the curator.\n": "2",
    "\nIn cases any ruling for commencement of guardianship to a person under assistance is to be made, the family court need not to rescind the ruling of commencement of assistance pertaining to such person.\n": "2",
    "\nWith respect to contracts concluded by the person with limited capacity, if the person with limited capacity and the statutory agent have the right to rescind, the counterparty also has.\n": "2 3",
    "\nIn cases where the adult concluded a contract, and later, he/she became subject to the ruling of commencement of guardianship,the gurdian of adult may rescind the contract by proving that there is a ground for commencement of guardinaship.\n": "1 2",
    "\nIn cases where a person with limited capacity manipulates any fraudulent means to induce others to believe that he/she is a person with capacity, his/her jusistic act has effect even if there is a mistake in any element of the juristic act in question.\n": "2",
    "\nA manifestation of intention made by a third party to an agent representing that tha same is made on behalf of the principal binds the principal, even if an agent recieves the same with no indication that it is made on behalf of the principal.\n": "5",
    "\nThe authority of agency shall be terminated when the agent is subject to an order for the commencement of guardianship.\n": "5",
    "\nIn cases the validity of a manifestation of intention should be affected by knowing any paricular circumstance, whether or not such fact existed shall, at the election of the principal, be determined with eigther the principal or the agent.\n": "5",
    "\nIn cases where the principal ratifies the contract concluded by a person without authority of agency, the contract shall be effective toward the future from the time of the rarification, unless other intention is manifested.\n": "18 19",
    "\nA privately appointed agent shall not be responsible vis-a-vis the principal for the appointment and supervision of such sub-agent if it appointed the sub-agent in accordance with the nomination by the principal: provided, however, that, this shall not apply to the cases where the agent knows that the sub-agent is untrustworthy, and fails to notify the principal thereof or to dismiss the sub-agent.\n": "5",
    "\n(A) broke into a stranger (B)'s house to steal B's seal and documents relating to registration, and forged the proxy which is manifested that B granted certain authority of agency to A in order to sell B's real property.\nIn such case, B shall not be liable for the contract concluded by A as a agent of B that B sells his/her real property to (C), even if C knew, or were negligent in not knowing, that A was not granted the authority of agency.\n": "1 3 22",
    "\nA contract concluded by a person without any authority of agency may not be rescined by the counterparty who knew that the agent had no authority of agency at the time of the conclusion of the contract, even before the principal ratifies it.\n": "5",
    "\nIf an unauthorized argent is unable to obtain the ratification of the principal, the counterparty who did not konw and without negligence in not knowing that the agent had no authorigy of agency claim damages against him/her.\n": "1 3 22",
    "\nIn cases where it is already established conclusively at the time of the performance of the applicable juristic act that a certain condition will not be fulfilled, if such condition is a condition subsequent, such juristic act shall be unconditional; on the other hand, if such condition is a condition precedent, such juristic act shall be void.\n": "5",
    "\nJuristic act which is subject to an unlawful condition shall be void, however jusistic act which is subject to the condition that an unlawful act not be performed shall not be void.\n": "5",
    "\nConditional rights may not be inherited while it is uncertain whether or not such condition has been fulfilled.\n": "18",
    "\nIn cases where the obligor who has the debt by oneself was dead and there are more than one heirs, the extinctive prescription of the debt shall be nullified until the time when the applicable heir is identified.\n": "18",
    "\nIn cases where (A) and (B) have a joint and several obligation which A bears the portion of all, the extinctive prescription of A's obligation shall not be nullified even if B acknowledge B's obligation to the obligee; therefore, B also shall be relieved of the obligation if the extinctive prescription is completed.\n": "7",
    "\nIn cases where (A) and (B) is a married couple, if A engages in juristic act with (C) in the single name of oneself regarding everyday household matters, the extinctive prescription of C's credit against B shall be nullified upon the judical claim of C's credit against B.\n": "7",
    "\nIf a possessor in good faith is defeated in an action on the title, he/she shall be deemed to be a possessor in bad faith as from the time when such action was brought.\n89-2\n": "9",
    "\nAn obligee (B) against (A) may demand the court against (D) who succeeds to benefits as defendant to rescind the gift from A to (C) by the reason of fraudulent act, if D knew, at the time of the gift, the fact that B is to be prejudiced.\n": "19",
    "\nA claim may be extinguished by extinctive prescription; however, a real right may not.\n": "20 14",
    "\nA claim may be the subject of another claim; howver, a claim may not be subject of a real right.\n": "18",
    "\n(A) bought the movable \"a\" from (B) and A aquired possessory right by constructive transfer, however B is forcibly dispossessed the movable \"a\" by (C).\nIn this case, A may claim for the restoration of the movable \"a\" against C not only based on the ownership but also by bringing an action for recovery of possession.\n": "9",
    "\n(A) bought the movable \"a\" from (B) and A aquired possessory right by constructive transfer, however B also sold the movalbe \"a\" to (C) and delivered in actual.\nIn this case, C may assert against A to aquire the ownership the movable \"a\" without unknowlegde and negligence regarding to the trade of the movable \"a\" between A and B.\n": "9 14",
    "\n(A) bought the movable \"a\" which he/she had borrowed and possessed from (B).\nIn such case, A may not asserted against B to aquire the ownership of the movable \"a\", unless A returns it to B and B delivers again it to A in actual.\n": "13",
    "\n(A) got the creation of the pledge regarding to the B'movable \"a\" in order to secure the A's credit against B.\nIn such case, the creation of the pledge shall not take effect by only delivering the movable \"a\" in way of transfers of possession by instructions.\n": "16",
    "\nIn cases where (A) bought the movable \"a\" which (B) had owned and deposited to the depositary, if A orders the depositary to thenceforward possess it on behalf of A, and such depositary consents thereto, A shall acquire the possessory right.\n": "9 14",
    "\nAny claim of a real right based on an ownership is the right derived from the ownership; therefore, only a claim of real right separated from  an ownership may not be assigned, but may be extinguished by an extinctive prescription.\n": "11 12 13",
    "\nAlthough (A), (B) and (C) co-own the land used as a farm in one third of proportion, a third party with the consent of A is going to develop the land to a residential land.\nIn such case, C, by oneself, may demand the third party not to develop all of the land as exercing the claim of the real right based on co-ownership.\n": "11 12",
    "\nIn cases where (A) have created the (B)'s supercify over A's land and registered such fact,\nthe supercify shall be extinguished if B acquires the ownership of A's land, even if the supecify was the object of the mortgage of a third party.\n": "17",
    "\nIn cases where (A) have created the superficy for (B) and (C) over A's land and registered such fact,\neven if the superficy is in quasi co-ownership by B and C, the supecify shall be extinguished if B acquires the ownership of A's land.\n": "11 12 13",
    "\nIn cases where (B) has the superficy over (A)'s land, which had already been the subject of the mortgage, and registered such fact,\nthe supecify shall be extinguished if B acquires the ownership of A's land.\n": "17",
    "\nIn cases where (B) has the superficy over (A)'s land and registered such fact, and erected a building on A's land to lease to (C),\nthe supecify shall not be extinguished even if B acquires the ownership of A's land.\n": "10 11 12 13",
    "\nRights of Retention is the right hold by a possessor of a Thing belonging to another porson; therefore, in cases a holder a right of retention leases the Thing retained to a third party, a right of retention shall be extinguished even if he/she obtains the consent of an owner.\n": "14 7",
    "\nA mortgage may also be exercised against the claim for damage that the obligor is to receive as a result of the loss of the subject matter of the mortgage; on the other hand, a right of retention may not.\n": "17",
    "\nIf there is a default with respect to a claim secured by a mortgage, the mortgage shall extend to the fruits of the Mortgaged Immovable Properties derived after the default.\n": "17",
    "\nA primary obligor may not make a claim for the extinction of a mortgage; however, a jointly and severally liable guarantor with respect to the obligation may make that claim.\n": "17",
    "\nIn cases where a mortgage with respect to a building is exercised, if there is a person who has been using the building since prior to the commnecement of auction procedures and posterior to the registration of the mortgage, he/she shall not be required to deliver that building to the purchaser thereof until six months have elapsed from the time when the purchaser purchased that building at auction without paying consideration with respect to the use of the building.\n": "17",
    "\nIf a building is constructed on motgaged land by a third party afer creation of a mortgage, the mortgagee may auction the building together with the land.\n": "17",
    "\nEven if claims on negotigable instruments or checks are specified as claims that are to be secured by Revolving Mortgage,  any claim on negotigable instruments or checks which issued by a third pary and endorsed by the obligor may not be treated as claims that are to be secured by Revolving Mortgage.\n": "17",
    "\nA person who acquires a claim from a revolving mortgagee before the principal is fixed may not exercise the Revolving Mortgage with respect to such claim.\n": "17",
    "\nIn order to effect the alterations with respect to the scope and the obligor of the claims to be secured by a Revolving Mortgage, it is not required that the approval of third parties including subordinated obligees be obtained.\n": "17",
    "\nIf an inheritance of a revolving mortgagee commences before the principal is fixed, the principal secured by a Revolvoing Mortgage shall be fixed at the time of the commencement of the inheritance, unless there is the agreement between the heirs and the revolving mortgagor to success the Revolving Mortgage.\n": "17",
    "\nA revolving mortgagee after the principal is fixed may exercise his/her Revolving Mortgage up to the maximum amount with respect to all fixed payments of principal, as well as perioical payments including interest and compensation for damages resulting from failure to perform obligations that have fallen due in the most recent two years.\n": "17",
    "\nIn cases where there is the special provision, between the seller and the buyer, that a statutoriy lien may be exercised with respect to the movables that are the subject matter of the same after the obligors have delivered those movables to third-party acquirers, the statutory lien may not be exercised with respect to the movables that are the subject matter of the same after the buyer have delivered those movables to the re-buyer even if the re-buyer has knowledge that special provision.\n": "15",
    "\nEven if there is a special provision, between pledgee and pledgor, that the pledge does not secure the interest, the pledge of movables shall secure such interest.\n": "16",
    "\nPledgees of immovable proparty may use and receive the profits form the immovable property that is the subject matter of a pledge, and a specail provision between pledgee and pledgor may not exclude the right of that.\n": "16",
    "\nThe mortgage shall extand to the building on the mortgaged land, in cases where there is a special provision that the mortgage extends to the building on the mortgage land.\n": "17",
    "\nIn cases where the obligee (C) exercises the credit of sale value vested in the obligor (A) against (B), and filing the action regarding to the credit, if the upholding judgement of the action is established, the credit is deemed to extinguish by the performance\n": "18",
    "\nNo contract for revolving guarantee on loans shall be effective unless it is made in writing.\n": "19",
    "\nIf three years have elapsed from the day of the conclusion of the relevant contract for a revolving guarantee on loans, the guarantor may request the fixing of the principal of the relevant principal obligation.\n": "18",
    "\nNo contract for revolving guarantee on loans shall be effective unless the maximum amount is stipulated.\n": "19",
    "\nThe principal for the principal obligation under a contract for revolving guarantee on loans shall be determined if an obligee has filed a petition for compulsory exection with respect to a claim the subject- matter of which is payment of money on any property of the guarantor, in cases where the proceedings for the compulsory exection have been commenced.\n": "18",
    "\nThe principal for the principal obligation under a contract for revolving guarantee on loans shall not be determined even if the relevant principal obligor has died.\n": "18",
    "\nIf the lessor refuses to accept the rent by causing the dispute about the completion of the lease of building, the lessee may make the deposit with the official depository having jurisdiction over the domicile of the lessee or the lessor.\n": "19",
    "\nIn cases where a mortgage is created with respect to (B)'s land to secure (A)'s claim against B, after that, other mortgage is created with repect to the same to secure (C)' claim against B, if A inherits from B by oneself, the mortgage to secure A's claim shall be extinguished.\n": "17",
    "\nIn cases where the obligor should pay the principal as well as the applicable interest and expenses with respect to one or more obligation(s), if the person who must perform tenders any performance which is not sufficient to extinguish such obligation in its entirety, such performance shall be allocated first to the expense, and then to the interest and principal, in this order.\n": "18",
    "\nIf an obligee manifests his/her intention to release an obligation to the obligor, such obligation shall not be extinguished unless the obligor consents.\n": "18",
    "\nIn cases where a guarantor has given a guarantee as entrusted by the principal obligor, if he/she has, without negligence, had a judgment ordering him/her to perform the obligation to the obligee, such guarantor shall have a right to obtain reimbursement from the principal obligor.\n": "18",
    "\nWhen one joint and several obligor (C) performs his/her obligation without giving to the other joint and several obligor (A) a notice, if A may has a claim vis-a-vis the obligee (B) and may set it off, A may refuse the reimbursement from C.\n": "18",
    "\nWith respect to the contract for sales of a land, the obligation that the seller registers the transfer of ownership and the buyer's obligation of payment shall have the relationship of simutaneous performances.\n": "19",
    "\nProperties other than money may be made the subject of a loan for consumption.\n": "10 11 12 13",
    "\nThe pre-contract of a loan for consumption shall lose its effect if a ruling for the commencement of bankruptcy procedures is subsequently made against one of the parties.\n": "19",
    "\nIf the contract for work terminates during performance due to reasons not attributable to the  contractor, he/she may demand remuneration in proportion to the performance already completed.\n": "19",
    "\nThe party ordering work may cancel the contract at any time whilst the contractor has not completed the work by compensating any damages.\n": "19 5",
    "\nEven if there is any defect in the subject matter of work performed, the party ordering the work may not demand that the contractor repair the defect, in the cases where the defect is not significant and excessive costs would be required for the repair.\n": "19",
    "\nWhere delivery of the subject matter is required, the demand for repair must be made within one year from the time of the delivery of the subject matter of the work.\n": "18",
    "\nIf the parties do not define the time of return, a borrower may terminate a money loan for consumption without charging any interest by returning the borrowed money at any time.\n": "19",
    " A loan for use shall terminate when a borrower dies. ": "19",
    "\nIf a lease contract is canceled, the lease shall terminate retroactively as of the time of the conclusion of the contract.\n": "19 5",
    "\nEven in cases where the duration of the partnership is specified, if a partner dies, an heir of the partner may withdraw from the partnership.\n": "19",
    "\nIf the parties have not specified the timing of the return of the Thing deposited, the depositary who has undertaken a deposit gratuitously may return the same and terminate the contract at any time.\n": "19",
    "\nA plaintiff shall prove that the opponent has responsibility capacity at the time of the tortious act to claim compensation of damages by a tort of a minor.\n": "20 22",
    "\nParents of a person who died by a tort may claim compensation for their own mental damages against a wrongdoer.\n": "22",
    "\nIn cases where an obligee A demands performance of a guarantee obligation which is not joint and several guarantee from a guarantor B in a lawsuit, A shall prove that he/she had demanded perfomance from a principal as revived cause of action.\n": "18",
    "\nIn the cases where delivery of the subject matter of a contract for work between A and B is required, if a contractor A intends to claim remuneration against a party ordering B, A shall prove that the subject matter of a contract has been delivered as revived cause of action.\n": "19",
    "\nIn cases where A claims purchase money of movables in a lawsuit, A shall prove that A tendered the delivery of the subject matter as revived cause of action.\n": "18",
    "\nIn the case where a person under curatorship concluded contract for sale with a third party with consent of his/her curator, even when there is a mistake in any element of the juristic act in question and he/she was not grossly negligent, he/she may not assert such nullity by himself/herself.\n": "1 3",
    "\nIn cases any third party commits any fraud inducing any person to make a manifestation of intention to the other party, and the other party did not know such fact, if such manifestation of intention meets the requirement for invalid by mistake, the person who made such manifestation of intention may assert nullity.\n": "5",
    "\nIn the case where a person under curatorship obtains the consent of his/her curator to conclude the contract of guarantee before concluding such contract, he/she may not cancel concluding such contract by self-determination.\n": "18",
    "\nA person who intends to conclude the contract with a person under curatorship, in the capacity of interested person, may request the family court to rescind the order of the commencement of curatorship because of his/her having the sufficient the sufficient apacity to appreciate right or wrong.\n": "2",
    "\nWith respect to an act which may be rescinded on the grounds of the limited capacity, the person who is the counterparty to a person with limited capacity may, after such person with limited capacity has become a person with capacity, issue to such person a notice which demands, by establishing a certain period which is one month or more, that he/she should give a definite answer on whether or not such person will ratify such act which may be rescinded within such period.\nIn such case, if such person fails to send any definite answer within such period, he/she is deemed to have ratified such act.\n": "2",
    "\nIn cases where any claim which was extinguished by a prescription had been suitable for set-off prior to such extinguishment, the relevant obligee may effect the set-off.\n": "18",
    "\nEven if the statutory agent of a person who made the manifestation of intention ratifies the rescindable act on the grounds of fraud, such person may rescind such act when he/she does not know the ratification.\n": "5",
    "\nA contract concluded by a person without authority of agency may not be ratified by the principal, after the time when the counterparty rescindes the contract.\n": "19",
    "\nIn the case where a child who was not authorized by his/her father sells the real property of the father as an agent of the father, if the other party believe that the child was authorized and has reasonable grounds for believing that the agent has the authority, apparent authority shall be effected.\n": "5",
    "\nEven if a right to demand compensation for damages due to torts is established in a settlement in a court proceeding, and due date is fixed one year after the settlement, such right shall be extinguished by the operation of prescription if it is not exercised by the victim within ten years from the time when such settlement had been mentioned in the record of settlement.\n": "22",
    "\nIn the case where a person concluded the sales contract with a minor and bought his/her movable, after that such contract was rescinded on the grounds of the limited capacity to act, even if the person is in good faith and faultless with respect to the fact that the seller is a minor, the person may not acquire the ownership of such movavle on the grounds of the immediate acquisition.\n": "19",
    "\nIf a person contributes work to the movables of others, ownership of the Thing so worked up shall vest in the person who is determined pursuant to the provisions in Civil Code.\nEven if the owner and the processor make other agreement which is different from the provisions in Civil Code, such agreement shall not be take effect.\n": "10",
    "\nIf one of the co-owners of land acquires a servitude by prescription, the other co-owners shall also acquire the same.\n": "13",
    "\nIf two or more movables with different owners are so joined to each other that they can no longer be separated without damaging the same, the owner of secondary movable shall co-own the composite Thing in proportion to the respective price current at the time of the accession.\n": "10",
    " Superficies may not be the subject matter of a mortgage. ": "17",
    "\nA servitude holder must pay for benefit to the owner of the servient land.\n": "13",
    "\nA person who acquires Statutory Superficies need not to pay the rent to the owner of the land.\n": "12 13",
    "\nIf a superficiary fails to pay the rent for two or more consecutive years, the landowner may demand the extinction of the superficies.\n": "10 12 13",
    "\nA holder of a right of retention may exercise his/her rights against the whole of the Thing retained until his/her claim is satisfied in its entirety.\n": "20 14",
    "\nHolders of general statutory liens cannot be paid out of immovable properties unless they are first paid out of property other than immovable properties and a claim that is not satisfied remains, unless cases where the proceeds of immovable properties are distributed prior to the proceeds of assets other than immovable properties.\n": "15",
    "\nIf monetary claim is the subject matter of a pledged claim, the pledgee may collect the entire amount of the such monetary claim notwithstanding the amount of the pledgee's own claim.\n": "16",
    "\nIn the case where the proceeds of other assets are to be distributed prior to the proceeds of the auction as the execution of mortgage, each other obligee may demand that the amount to be distributed to the mortgagee be deposited.\n": "17",
    "\nIf the amount of the obligations actually in existence after the principal is fixed exceeds the maximum amount of the Revolving Mortgage, a person who created his/her Revolving Mortgage to secure obligations of others may request the extinction of that Revolving Mortgage by tendering or depositing an amount equivalent to that maximum amount.\n": "17",
    "\nA holder of statutory lien for the sales of the immovable property who has registration of such statutory lien may exercise statutory lien prior to mortgages, regardless of the chronological order of the registraiton.\n": "15",
    "\nStatutory liens for sale of movables may not be exercised with respect to the movable that are the subject matter of the same after the obligors have delivered those movables to third-party acquirers.\n": "15",
    "\nStatutory liens for employer-employee relationships shall exist with respect to salaries and other claims that arose under the employer-employee relationship between the obligor and his/her employee.\n": "15",
    "\nA holder of general statutory liens shall have the rights to have his/her own claim satisfied prior to other obligees who has the registration of statutory liens for sales of immovable properties even if the liens are not registered with respect to the relevant immovable property.\n": "15",
    "\nIn the case where the first mortgage and the second mortgage were created on the same real property of the obligor, if the obligor pay the obligation which was secured by the first mortgage, the obligor shall obtain the first mortgage by subrogation by performance.\n": "17",
    "\nA revolving mortgagee may exercise his/her Revolving Mortgage up to the maximum amount with respect to all fixed payments of principal as well as periodical payments including interest and compensation for damages resulting from failure to perform obligations.\n": "17",
    "\nA mortgage shall extend to the buildings on the mortgaged land as long as the mortgage provides otherwise.\n": "17",
    "\nIn the case where a third person mortgagor owns both of Land X and Land Y which a joint mortgage is taken out on, if the obligation ceased to exist by distributing the value of Land X ahead, the third person mortgagor may exercise the mortgage took out on Land Y to within the right to indemnification to the obligator.\n": "17",
    "\nIn the case where there is a guarantor on an obligation and a mortgage is taken out on land X which a third party mortgagor owns for the same obligation, if the guarantor performed and extinguished the guarantee obligation, he/she exercise the mortgage for the full amount of the right to reimbursement to an obligor.\n": "17",
    "\nIn the case where there is a guarantor on an obligation and a mortgage is taken out on land X which an obligor owns for the same obligation, if the guarantor performed the guarantee obligation after an obligee wavied the mortgage, the guarantee may exercise the mortgage as it is not wavied.\n": "17",
    "\nRegardless of whether there is other agreement, the amount of the damages of non-performance shall be determined with reference to monetary value.\n": "18",
    "\nThe obligor shall take on responsibilities which arise from default of monetary debt unless he/she may raise the defense of force majeure.\n": "18",
    "\nIn the case where the parties agree on the amount of the liquidated damages with respect to the failure to perform the obligation, the court only may increase the amount thereof but may not decrease the amount thereof.\n": "18",
    "\nEven if the parties agree on the amount of the liquidated damages with respect to the failure to perform the obligation, the agreement shall not preclude the exercise of the cancellation right.\n": "19",
    "\nIn the case where a mortgage extinguished because the object of performance was deposited, a person who deposited may not recover the deposited property even before an obligee accepts it.\n": "17",
    " A condition may be added to manifestation of set-offs. ": "18",
    "\nAn obligee may not release an obligation without an obligor's consent.\n": "18",
    "\nIn cases where the seller, at the moment of the contract, does not know that the land the seller has sold do not belong to him/her, even if the seller cannot acquire the land and transfer the same to the buyer, the seller may cancel the contract.\n": "19",
    "\nA buyer may demand a reduction of the purchase money in proportion to the value of the part in shortage in cases where part of a real estate  was already lost at the time of the contract, if the buyer did not know the fact of the loss.\n": "19",
    "\nIn cases where an easement that was referred to as being in existence for the benefit of a land that is the subject matter of a sale, does not exist, the cancellation of the contract must be made within one year from the time when the buyer comes to know the facts.\n": "19",
    "\nIn the case where the object of compulsory auction is retained by the right of retention, the successful bidder may not cancel the contract, even if he/she did not know the fact and cannot achieve the purpose of the purchase because of the right of retention.\n": "19",
    "\nA mandate shall not be canceled by a mandatary unless an anavoidable reason to do so.\n": "19",
    "\nA mandatary must, if so requested by the mandator, report the current status of the administration of the mandated business at any time.\n": "19",
    "\nEven if a mandator died, an heir of the mandator may not assert termination of mandate by death of the mandator against a mandatary, when the mandatary was not notified of or did not know of the same.\n": "19",
    "\nIn the case where there is a special agreement that the mandatary may claim remuneration from the mandator, if the mandate terminates during performance due to reasons not attributable to the mandatary, the mandatary may demand remuneration in proportion to the performance already completed.\n": "19",
    "\nIf the mandatary has incurred any obligation found to be necessary for the administration of the mandated business, the mandatary may demand that the mandator perform the obligation on the mandatary's behalf.\n": "19",
    "\nEven if the due date of the return is specified in an onerous deposit contract, the depositary may return the deposited goods prior to the due date by refunding a storage fee.\n": "18",
    "\nIf a third party asserting rights with respect to the Thing deposited has brought a lawsuit against the depositary, the depositary must notify the depositor of that fact without delay.\n": "18",
    "\nThe depositor must compensate the depositary for damages that occur due to the defects in the Thing deposited; provided, however, that this shall not apply if the depositor did not, without negligence, know of such defect, or the depositary knew of the same.\n": "19",
    "\nA partner may not seek the division of the partnership property before the same is liquidated.\n": "19",
    "\nIn a contract of employment, remuneration specified with reference to a period may be claimed on the expiration of that period.\n": "19",
    "\nThe contractor may not claim his/her remuneration without the specified consent of remuneration amount.\n": "19",
    "\nIf costs will be incurred in administering the mandated business, the mandator must, at the request of the mandatary, pay an advance for those costs.\n": "19",
    "\nA mandatary of a quasi-mandate contract may not claim remuneration from a mandator before performance, even with special agreements that a mandatary may claim remuneration before he/she administers the mandated business.\n": "19",
    "\nWhen a merchant receives a deposit within the scope of his/her business, he/she shall have the due care of a prudent manager for the deposited goods even when he/she will not receive any remuneration.\n": "19",
    "\nIn the case where B who is employed by A inflicted damages on a third party C with respect to the execution of that business, if A performed the obligation to compensate the damages to C, A's right to reimbursement to B shall not accrue.\n": "4 20 6",
    "\nIn the case where a contractor B who concluded a contract for work with A inflicted damages on a third party C with respect to the execution of his/her work, if there is A's negligence in order or instructions, A is liable for the damages as the party ordering work.\n": "4 20 6",
    "\nThe family court may order the commencement of curatorship without the consent of the person in question.\n": "2",
    "\nWith respect to any act which requires the consent of the curator, if the curator does not give consent in cases where the interest of the person under curatorship is unlikely to be prejudiced, the family court may, at the request of the person under curatorship, give permission in lieu of the consent of the curator.\n": "2",
    "\nThe ruling of commencement of assistance at the request of any person other than the person in question shall require the consent of the person in question.\n": "1 2 3",
    "\nIn cases any third party commits any fraud inducing any person to make a manifestation of intention to the other party, such manifestation of intention may be rescinded if the other party knew such fact.\nOn the other hand, in cases any third party commits any duress inducing any person to make a manifestation of intention to the other party, such manifestation of intention may be rescinded even if the other party did not know such fact.\n": "5",
    "\nAny person may assert a manifestation of intention is not only void by a mistake but also rescinded by fraud if he/she made the manifestation of intention by a mistake in any element of the juristic act in question which the other party induced by fraud.\n": "5",
    "\nA privately appointed agent may appoint its sub-agent if the authorization of the principal is obtained or there is an unavoidable reason to do so.\n": "5",
    "\nEven if a principal ratified the act of unauthorized agency against the unauthorized agent, the principal may not assert the ratificatoin vis-a-vis even the unauthorized agent.\n": "5",
    "\nIn cases of calculation of the period of prescription, the first day of the period shall not be included for the purpose of the calculation unless the sases where the period commences at twelve midnight.\n": "20 14",
    "\nThe extinctive prescription of claims assigned unspecified due date commences to run when the obligee becomes aware of the arrival of such time limit.\n": "4 21 6",
    "\nA library of a university A has a book \"P\", and a professor B borrowes the same and uses his/her office in the same campus.\nIn cases where a third party C steals and possesses \"P\" during B's absence to go abroad on business trip, B may claim for the restoration of \"P\" by bringing an action for recovery of possession against C.\n": "20 14",
    "\nA library of a university A has a book \"P\", and a professor B borrowes the same and uses his/her office in the same campus.\nD stole \"P\" the moment B took his/her eyes, in addition, D sold and delivered \"P\" to E under false ownership.\nEven if \"P\" is stamped the ownership mark by the library, and E thinks that D embezzled \"P\", B may not claim for the restoration of \"P\" by bringing an action for recovery of possession against E.\n": "4 6",
    "\nA library of a university A has a book \"P\", and a professor B borrowes the same and uses his/her office in the same campus.\nIn the case where B left \"P\" in a train on the way home, and F found and possesses the same, B may claim for the restoration of \"P\" by bringing an action for recovery of possession against F.\n": "20 14",
    "\nThe order of priority of mortgages may be changed only with the agreement of all mortgagees; provided, however, the changes may not be asserted against third parties unless registered.\n": "17",
    "\nIf they created, by an establishing act, their mortgagees which secured the entire amount of periodic payments including interest, mortgagees may exercise their mortgages in prior to other obligees in accordance with act of establishment.\n": "17",
    "\nIn a sale, the ownership of the subject matter transfers at the time of formation of the contract in principle, but the relevant parties may stipulate that the ownership is transferred at other time.\n": "19",
    "\nPledgees of immovable property may not use and receive the profits from the immovable property that is the subject matter of a pledge unless he/she obtains the consent of the pledgor.\n": "16",
    "\nAn owner of land may request the use of the neighboring land to the extent necessary for constructing or repairing walls or buildings on or in the vicinity of the boundary; provided, however, that, if the neighbor sustained damages, the owner must pay compensation for the same.\n": "10",
    "\nIf the partition of land creates a parcel of land that has no access to public roads, the owner of such parcel of land may pass to the public roads only through the lands owned by others who participated in the partition.\nIn such cases, it shall not be necessary to pay compensation.\n": "10",
    "\nA landowner may install a roof that discharges rainwater directly onto neighboring land if there are unavoidable reasons; provided, however, if a neighbor suffers damage, the landowner must pay compensation for the same.\n": "10",
    "\nEven in cases where a building must be constructed 50 centimeters or more distant away from the boundary line, the owner of the neighboring land may not have construction suspended or changed when a person attempts to construct a building in contact with the boundary.\n": "10",
    "\nIf a tree or bamboo branch from neighboring land crosses a boundary line, the landowner may sever that branch and claim reimbursement of those costs from the owner of the neighboring land.\n": "10",
    "\nThe Statutory Lien cannot be created by agreement between obligee and obligor; however, the Rights of Retention may be created by agreement between obligee and obligor.\n": "15",
    "\nIf a holder of a right of retention leased the Thing retained unless he/she obtains the consent of the obligor, the obligor may demand that the right of retention be extinguished.\n": "20 14",
    "\nIf the contractor refuses to deliver of the subject matter of work performed, based on the right of retention that the secured claim is the claim of remuneration against the party ordering the work, the running of extinctive prescription of the claim of remuneration shall not be preclude.\n": "19",
    "\nA holder of a right of retention may exercise against Things including monies that the obligor is to receive as a result of the loss of the subject matter.\n": "4 14",
    "\nIf a third party who purchases a Mortgaged Immovable Properties pay the price of the same to the relevant mortgagee at the request of the mortgagee, the mortgage shall be extinguished for the benefit of that third party.\n": "17",
    "\nIf twenty years has elapsed from the time when it becomes possible to execute the mortgage, a mortgagor may assert the extinction of the mortgage by prescription.\n": "17",
    "\nIn case where B holds the mortgage ranked first and C holds the mortgage ranked second with respect to a building belonging to Aeven if B purchases the building from A, the mortgage ranked first shall not be extinguished.\n": "17",
    "\nIn cases where the subject of sale, wine, is specified only with reference to a type, and the delivery of wine is effected at the domicile of the buyer; in case the buyer refuses to accept the performance even though the seller brings wine to the domicile of the buyer with the main purport of the obligationeven if the seller has intentionally lost wine after that, he/she shall not be liable for damages for failure to perform the obligation of delivery of wine.\n": "19",
    "\nIn cases where the subject of sale, wine, is specified only with reference to a type, and the delivery of wine is effected at the domicile of the buyer; in case the buyer refuses to accept the performance even though the seller brings wine to the domicile of the buyer with the main purport of the obligationif the wine has been lost due to destruction of warehouse by arson by a third party after that, the seller shall be relieved of the obligation of delivery of wine.\n": "19",
    "\nIn cases where the subject of sale, wine, is specified only with reference to a type, and the delivery of wine is effected at the domicile of the buyer; in case the buyer refuses to accept the performance even though the seller brings wine to the domicile of the buyer with the main purport of the obligationif the wine has been lost due to negligence of the buyer after that, the buyer shall not be relieved of the obligation of payment of purchase money.\n": "19",
    "\nIn cases where the subject of sale, wine, is specified only with reference to a type, and the delivery of wine is effected at the domicile of the buyer; in case the buyer refuses to accept the performance in advancewhen the seller demands the acceptance thereof by a giving a notice that tender of the performance has been preparedeven if the seller brings wine to the domicile of the buyer with the main purport of the obligationhe/she shall not be liable for damages for failure to perform the obligation of delivery of wine.\n": "19",
    "\nTo demand the Rescission of Fraudulent Act must require that the obligor commits a juristic act with the intention to prejudice the obligee.\n": "18",
    "\nIn cases where B, C and D bears a joint and several obligation of 3 million yen to A and where each of them have the equally proportionate obligations; even if A requests for performance to B, the prescription shall not be nullified with respect to C and D, who do not know that fact.\n": "7",
    "\nIn cases where B, C and D bears a joint and several obligation of 3 million yen to A and where each of them have the equally proportionate obligations; even if B effected the set-off intended to invoke his/her monetary claim against A, the set-off shall be void vis-a-vis C and D.\n": "18",
    "\nIn cases where B, C and D bears a joint and several obligation of 3 million yen to A and where each of them have the equally proportionate obligations; even if the prescription is completed with respect to B, C and D shall bear a joint and several obligation of 3 million yen to A.\n": "20 21",
    "\nIn cases where the contract of guarantee between C and B is concluded with respect to monetary debt of A against B; if the penalty about the debt of A against B is not provided, C may not stipulate penalty with regard to the contract of guarantee between C and B.\n": "18",
    "\nIn cases where the contract of guarantee between C and B is concluded with respect to monetary debt of A against B; in the case A is a minor and assumed the obligation against B without consent of the legal representative, C was aware, at the time of entering into a contract gurantee, of such fact, C shall be presumed to have assumed an independent obligation of the same subject in the event of rescission of the obligation of A.\n": "18",
    "\nIn cases where the contract of guarantee between C and B is concluded with respect to monetary debt of A against B; in case the amount of the monetary debt of A against B is 5 million yen and C has become a guarantor as entrusted by A, after that, A thought he/she was going to set off his/her obligation against his/her claim of 3 million yen against Bwhen C performs his/her obligation without giving to A  a notice, A may refuse reimbursement of 5 million yen from C to the extent of 3 million yen by asserting that A could set off.\n": "18",
    "\nIn cases where the contract of guarantee between C and B is concluded with respect to monetary debt of A against B; when C, who has become a guarantor against the will of A, has performed the obligation, C shall have the right to obtain reimbursement only to the extent that A is actually enriched.\n": "18",
    "\nIn case where the obligee refuses to accept such performance although a third party who has interest in an obligation tenders the performancehe/she may deposit the subject-matter of the performance with an official depository even if it is contrary to the intention of the obligor.\n": "18",
    "\nIf the obligor is unable to ascertain the obligeethe obligor may deposit the subject-matter of the performance with an official deposit, regardless of any negligence on the part of the obligor.\n": "18",
    "\nIn case where the obligor deposits the subject-matter of the performance with an official depository, the obligation shall not be extinguished unless the obligee accepts the relevant deposited property.\n": "18",
    "\nIn cases where the obligor depositedhe/she mya not recover the deposited property without the consent of the obligee.\n": "18",
    "\nIn cases where the obligor who has effected a deposit may assert defense for simultaneous performancethe obligee must tender his/her performance in return to the obligor, in order to accept the relevant deposited property.\n": "18",
    "\nGifts is unilateral juristic act formed by the manifestation to give own property to the other party gratuitously.\n": "8 19",
    "\nGifts not in writing may also be revoked with respect to any portion of the gift for which performance has been completed.\n": "19",
    "\nUntil the completion of the delivery of a specific thing, the donor shall assume a duty to take custody of such property with due care of a prudent manager.\n": "19",
    "\nIf there is any defect in the specific gift, the donor shall assume a warranty identical to that borne by the seller.\n": "19",
    "\nEven if the delivery of the subject matter of the sale is received prior to the purchase money, the payment must be made at the place of delivery.\n": "19",
    "\nIf any mortgage, statutory lien or pledge is registered on immovable property that has been purchased, the buyer may refuse to pay the purchase money until the completion of the procedures of the claim for extinguishment of the morgage, the statutory lien or the pledge.\n": "15",
    "\nWhen the buyer delivers earnest money to the sellerif the seller cancels the contract by reimbursing twice its amountit shall be sufficient if he/she demands the acceptance thereof by giving an oral notice that he/she reimburses twice the amount of the earnest money.\n": "19",
    "\nIf the parties have not specified the timing of the return and the purposes of the using and taking profits, the lender may not demand the return of the subject matter of the loan for use unless the lender demands the return, specifying a reasonable period.\n": "19",
    "\nIn the case where the lender knew that there is any latent defect in the subject matter of a loan for usehe/she is released from the warranty against defects if he/she disclosed its existence to the borrower.\n": "19",
    "\nA borrower must retain the subject matter of the loan for use with the care of a good manager.\n": "19",
    "\nIf the borrower dies, his/her heir shall succeed the right to make use of and take the profits of the borrowed Thing as a borrower.\n": "19",
    "\nIf the parties do not stipulate interest, a loans for consumption under the civil code shall become a loan for consumption without interest.\n": "8 19",
    "\nIf there is any latent defect in any borrowed Thing in a loan for consumption with interest, the lender must replace it with another Thing without defect.\n": "19",
    "\nThe pre-contract of a loan for consumption shall not lose its effect if a ruling for the commencement of bankruptcy procedures is subsequently made against the borrower.\n": "19",
    "\nThe borrower may return borrowed Things ealier than the time specified in the contract; however, that may not prejudice the interestof the lender.\n": "8 19",
    "\nIn cases where A found a collared dog whose owner is unknown, and took care of it for the unknown owner; if A took the dog to his/her house and takes care of it, he/she may not demand remuneration from the owner of the dog.\n": "13",
    "\nIn cases where A found a collared dog whose owner is unknown, and took care of it for the unknown owner; if A took the dog to his/her house and takes care of it, it shall be sufficient if he/she takes care of it exercising care identical to that he/she exercises for his/her own property.\n": "8 20 14",
    "\nIn cases where A found a collared dog whose owner is unknown, and took care of it for the unknown owner; A took the dog to his/her house and took care of it, then the dog pushed down a vase on a shoe cupboard and broke it.\nIn this case, if A was free from any negligence, A may claim compensation for the loss from the owner of the dog.\n": "11 13",
    "\nIn cases where A found a collared dog whose owner is unknown, and took care of it for the unknown owner; because the dog was injured when A found it, A had a veterinarian heal it and paid the fee.\nIf the owner subsequently claims for the restoration of the dog, A may refuse to deliver the dog until A obtains reimbursement of the fee A paid.\n": "8 4 6",
    "\nIn case where any defect in the installation or preservation of any structure on land causes damages to A, when the possessor B has used necessary care to prevent the damages arising, the owner C shall be liable to the vicitm A to compensate for his/her damages.\n": "9",
    "\nIn cases where a person who commences the management of a business for another person without being obligated to do so has incurred useful obligations on behalf of the principalif the obligation has fallen duehe/she may demand that the principal perform the obligation on his/her behalf.\n": "22",
    "\nEven in cases where a possesor paid ordinary necessary expenses with respect to Thing in his/her possessionhe/she may not have the person recovering the Thing reimburse them if the possessor has acquired fruits.\n": "9",
    "\nEven if a pledgee of a movable paid ordinary necessary expenses with respect to the Thing pledged which he/she is in continuous possession ofhe/she may not have the owner reimburse the same.\n": "16",
    "\nIf a holder of a right of retention incurs ordinary necessary expenses with respect to the Thing retained, he/she may have the owner reimburse the same.\n": "14",
    "\nIn cases where a third party acquirer of Mortgaged Immovable Properties has incurred ordinary necessary expenses with respect to the Mortgaged Immovable Properties, even if he/she has acquired fruitshe/she shall be entitled to obtain reimbursement of the same out of the proceeds of the Mortgaged Immovable Properties prior to other obligees.\n": "17",
    "\nA general incorporated association shall have rights and assume duties to the extent of the purpose provided in the applicable articles of incorporation subject to the applicable provisions of the laws and regulations.\n": "1 3",
    "\nWhere a juridical person has assigned a nominative claim for payment of money, even if a registration of assignment is made in a claim assignment registration file with regard to the assignment of the claim, the assignment of the claim may not be asserted against a third party other than the obligor, unless the assignor gives a notice thereof to the obligor or the obligor has acknowledged the same using an instrument bearing a fixed date.\n": "18",
    "\nIn Consumer Contract (a contract concluded between a Consumer and a Business Operator), manifestation of intention of Consumer which is induced by fraud of Business Operator may be rescinded.\n": "21 6",
    "\nThe building lease, when registered, shall also be effective against a person who subsequently acquires real rights with respect to the building, even if the building is not delivered.\n": "19",
    "\nIn the case where B, who was granted authority of agency to buy a land as an agent of A, concluded a contract for sale of a land \"X\" with C representing that the same is made on behalf of A by the fraud of C to B, A may not rescind the contract for sale.\n": "11 12",
    "\nIn the case where B, who was granted authority of agency to buy a land as an agent of A, was granted authority of agency to sell the land by C, became the agent of C, and concluded a contract for sale of a land \"X\" between A and C, if B notified to both A and C in advance that B was the agent of both parties, the contract for sale binds A and C.\n": "12 6",
    "\nEven though A promised B that A would give his/her car \"X\" when A would feel like it, the contract for gifts shall be void.\n": "19",
    "\nIn cases where A promised B that A would give his/her car \"X\" when B would pass a graduation examination of the medical department, if A sells his/her car \"X\" to a third party C, B may claim for the compensation for damages arising from A's act.\n": "22",
    "\nIn cases where an obligor who is a person under curatorship acknowledge the obligation without the consent of his/her curator, the prescription of the claim shall not be nullified.\n": "9 7",
    "\nIn cases where the obligee assigned a claim to any third party before the lapse of the period of prescription, if the obligor has acknowledged the assignment of a claim to the assignee, the prescription of the claim shall be nullified.\n": "7",
    "\nIf a person entitled to a servitude does not exercise a portion of his/her rights, only that portion shall be extinguished by prescription.\n": "11 13",
    "\nThe owner of the dominant land may not assign the servitude apart from the dominant land.\n": "13",
    "\nIn cases where dominant land is co-owned by more than one person, one of the co-owners of dominant land may renounce his/her own share a servitude that exists on behalf of the land.\n": "11 13",
    "\nIn cases where dominant land is co-owned by more than one person, if there is a interruption of prescription in favor of one co-owner, such interruption shall also be effective for the benefit of other co-owners.\n": "11 12 13",
    "\nA servitude may not be established with respect to the land, not neighboring a deminant land, as a servient land.\n": "13",
    "\nIn cases where a pledge is created with respect to the subject matter of the statutory lien for sale of movables, the statutory lien for sale of movables shall prevail over the pledge.\n": "15",
    "\nIf the borrower in loan of consumption of monies tenders any performance which is not sufficient to extinguish the total amount of the principal, the interest and the expense, he/she may designate the principal to which such performance should be allocated before any others, and the designation of the allocation shall be effected unless the lender immediately raises his/her objection.\n": "19",
    "\nUnless any other intention is manifested with respect to the expense of performance, such expenses shall be borne equally by both the obligor and the obligee; however, in cases the relevant obligee caused the expense of performance to increase by relocating his/her domicile or taking any other actions, such incremental amount shall be borne by the obligee.\n": "18",
    "\nUnless any other intention is manifested with respect to the place where the performance should take place, the delivery of a specific thing must be effected at the place where such thing was located when the relevant claim accrued, and the discharge of any other obligation must be effected at the current domicile of the obligee.\n": "18",
    "\nIf B who had been enjoined from making payment with respect to A's claim \"X\" against B acquires the claim \"Y\" against A, B may set off the claim \"X\" against the claim \"Y\".\n": "18",
    "\nIf any claim arises from a tortious act, the relevant obligee may assert the set-off against the obligor.\n": "18",
    "\nIn cases where, as a result of the cancellation of the contract for sale, each party assumes an obligation to restore the other party to that other party's original position, the obligations of both parties are not related to each other as simultaneous performance.\n": "19",
    "\nIn the case of a contract for sale of a specified thing, if the performance of the delivery has become impossible due to reason attributable to the seller, the effect of the contract of sale shall be lost by operation of law, then the buyer shall be relieved of liability for payment of the purchase money.\n": "19",
    "\nIn the contract for work for the purpose of constructing a building, even if the building under construction has been lost due to reasons not attributable to either party, the contractor may not claim the entire remuneration from the party ordering the work unless he/she contructs any new builidng and complete the work.\n": "19",
    "\nIn the contract for deposit for value, if the performance of the obligation to return deposited Thing has become impossible due to reasons not attributable to the depositary, he/she may not claim remuneration from the depositor, with respect to the period after the impossibility of performance of the agreed duration.\n": "19",
    "\nIn the cases where a lessor is the owner of the subject matter in a contract for lease, the ownership of the subject matter shall not be transfered to the lessee, on the other hand, in the cases where a lender is the owner of the subject matter in a contract for loan for consumption, the ownership of the subject matter shall be transfered to the borrower.\n": "10",
    "\nIf the parties do not specify the term of a lease, the lessee may request to terminate it at any time.\nOn the other hand, if the parties do not define the time for return in a loan for consumption, the borrower may request to terminate it any time only in a loan for consumption without interest.\n": "19",
    "\nBoth the timing of payment of rent in a contract for lease and the timing of payment of interest in a contract for loan for consumption may freely be determined by the agreement of the parties.\n": "19",
    "\nIn cases where the parties do not specify the term of a lease, if the lessor requests to terminate it, the lessee shall not be responsible for the delay within the statutory period without returning the Things; however, in cases where the parties do not define the time for return in a loan for consumption, if the lender demands their return, the borrower shall be resposible for the delay unless he/she returns the Things immediately.\n": "19",
    "\nA contract for lease is a consensual contract so that a contract for lease shall be formed by the agreement between the perties.\nOn the other hand, a contract for loan for consumption is a contract in kind, so that even if the perties promises that one of the parties will deliver money or other things and the other party will return by means of things that are the same in kind, quality and quantity, the agreement shall be void.\n": "19",
    "\nThe borrower shall bear the ordinarily necessary costs of borrowed Things.\nThe lessee shall not bear the ordinarily necessary costs of leased Things.\n": "19",
    "\nA borrower must make use of and take the profits of the Thing which is the subject matter of the contract in compliance with the method of use specified by the contract or by the nature of the Thing which is the subject matter of the contract.\nA lessee need not make use of and take the profits of the Thing which is the subject matter of the contract in compliance with the method of use specified by the contract or by the nature of the Thing which is the subject matter of the contract.\n": "19",
    "\nLoans for use shall lose its effect on the death of the lender by operation of law.\nLeases shall not lose its effect on the death of the lessor by operation of law.\n": "19",
    "\nA borrower must restore a borrowed Thing to its original condition on termination of the loan for use, but the borrower must obtain the consent of the lender to remove anything attached to the borrowed Thing.\nA lessee must restore a leased Thing to its original condition on termination of the lease, but the lessee need not obtain the consent of the lessor to remove anything attached to the leased Thing.\n": "19",
    "\nA concluded the contract with B that A leases his/her two-storied building \"X\" at a charge of 500,000 yen a month, and delivered the building \"X\" to B.\nAfter that, B concluded the contract with C that B subleases the building \"X\" at a charge of 500,000 yen a month with obtaining the approval of A, and delivered the building \"X\" to C.\nAfter a while, C became unable to use the second story of the building \"X\" due to the leak caused by defect of the roof.\nC may demand B to repair the defect of the roof of the building \"X\".\n": "10 11 12 13",
    "\nThe party ordering work may cancel the contract by compensating any damages, even if the contractor has completed the work with the purpose of its obligation.\n": "19",
    "\nIn cases where the party ordering work is subject to a ruling for the commencement of bankruptcy procedures, the contractor may cancel the contract.\n": "19",
    "\nIn the case where the delivery of the subject matter of work performed is required, if the defect in the subject matter is evident at the time of the delivery of it, the contractor shall not be liable for the warranty against defects.\n": "19",
    "\nWhere no delivery of the subject matter is required, the duration of contractor's warranty commences to run from the time of the completion of the work.\n": "19",
    "\nIf the defect in the subject matter of the work arises due to the nature of the materials supplied by, or instructions given by, the party ordering the work, the contractor is not liable for the warranty against the defect unless the contractor knew that the materials or instructions were inappropriate but did not disclose the same.\n": "19",
    "\nIn cases where there is any defect in the subject matter of work performed, if the repair of the defect is impossible, the party ordering the work may cancel the contract.\n": "19",
    "\nIf there is any defect in the subject matter of work performed, the party ordering the work may demand compensation for damages in lieu of, or in addition to, the repair of the defect.\n": "18",
    "\nA person who has taken the life of another must compensate for damages only to heirs of the victim.\n": "22",
    "\nA person who employs others for a certain business shall be liable for damages inflicted on a third party by his/her employees with respect to the execution of that business, and this shall apply even if the employees have the sufficient financial resources to compensate.\n": "22",
    "\nIn cases where the person who has concluded the contract for sale with the person under curatorship issues to the curator of such person a notice which demands, by establishing a certain period which is one month or more, that he/she should give a definite answer on whether or not such person will ratify such act which may be rescinded within such period, if the curator fails to send any definite answer within such period, he/she is deemed to have ratified the contract for sale.\n": "2",
    "\nIn cases where, with respect to a contract for sale concluded by a unauthorized agent, the counterparty requires the principal, by fixing a reasonable period of time, to make a definite answer on whether or not he/she will ratify within such period of time, if the principal fails to make any definite answer within such period, he/she is deemed to have ratified the contract for sale.\n": "5",
    "\nIn cases where the obligee refuses to accept the performance in advance, the obligor shall be released from the liability for default if he/she demands the acceptance thereof by giving a notice that the tender of the performance has been prepared.\n": "18",
    "\nIn cases where ,with respect to the right to cancel based on the failure to perform, the other party issues a notice of demand to the holder of the right to cancel, specifying a reasonable period, to the effect that the holder of the right to cancel is to give a definite answer as to whether or not the right will be exercised within that period, if no notice of cancellation is received within that period, the right to cancel shall be extinguished.\n": "19",
    "\nA holder of a right of retention may collect fruits derived from the Thing retained, and appropriate the same to the satisfaction of his/her claim prior to other obligees, but the fruits must be appropriated to the payment of interest on the claim, and any remainder must not be appropriated to the satisfaction of the principal.\n": "14",
    "\nIn cases where the seller's obligation to deliver the subject matter of the sale must be performed prior to that of the buyer and a due date is provided for the payment of the purchase money in the contract for sale, it shall not be necessary for the buyer to pay the interest even after the delivery of the subject matter of the sale until that due date arrives.\n": "19",
    "\nIf a person, who has become a guarantor without the entrustment of the principal obligor, has performed the obligation, the principal obligor must pay the statutory interest for the period from the day of that performance.\n": "18",
    "\nIn cases where a seller canceled the contract for sale based on the failure to perform the obligation after he/she received the purchase money in part, if the money which the seller received as the purchase money in part are to be refunded, interest must accrue from the time of the receipt of that money.\n": "19",
    "\nIn cases the obligor delays the payment of interest corresponding to one year or more, and if the obligor does not pay such interest notwithstanding the demand by the obligee, the obligee may incorporate such interest into the principal.\n": "18",
    "\nA minor who is permitted to carry on one or more kinds of business shall have the same capacity to act as a person of the age of majority as far as such business is concerned.\n": "2",
    "\nA minor may rescind the juristic act which is performed without the consent of his/her satutory agent individually.\n": "2",
    " A minor may not become an agent. ": "2",
    "\nEven if there is a mistake in any element of the juristic act in question and manifestation of intention is induced by the mistake, the person who made the manifestation of intention may not assert such nullity of the manifestation of intention by mistake if twenty years has elapsed from the time of the manifestation of intention.\n": "5",
    "\nIf there is a mistake in any element of the juristic act which is induced by any fraud and manifestation of intention is induced by the mistake,the person who made the manifestation of intention may assert such nullity of the manifestation of intention by mistake.\n": "5",
    "\nIn the case where an adult ward, (A) purchased a daily household item from (B), even if (B) did not know that (A) was an adult ward, his/her guardian of adult, (C) may rescind the contract for sale of the daily household item.\n": "2",
    "\nIn the case where (A) is an adult ward at the time when (A) receives a manifestation of intention of cancellation of a contract, the cancellation of the contract shall not take effect until (A)'s guardian of adult, (C) has acquired the knowledge of (B)'s manifestation of intention of cancellation of the contract.\n": "18 19",
    "\nIn the case where (A) loses his/her capacity to act after the dispatch of the notice of an offer of a contract to (B), who is a person at a distance, even if (B) knows such fact, the offer of the contract shall become effective.\n": "19",
    "\nIn the case where (A) loses his/her capacity to act after the dispatch of the notice of cancellation of a contract to (B), who is a person at a distance, even if (B) knows such fact, the cancellation of the contract shall become effective.\n": "19",
    "\nIn the case where (A) loses his/her capacity to act after the dispatch of the notice of acceptance of a contract to (B), who is a person at a distance, even if (B) knows such fact, the contract shall be formed.\n": "19",
    "\nIf the counterparty of unauthorized agency was negligent in not knowing that the person who concluded a contract holding himself/herself out as an agent of another person had no authority of agency,\nhe/she may not pursue the liability of the unauthorized agent in civil code.\n": "5",
    "\nThe authority of agency shall be terminated upon ruling for commencement of guardianship against the agent.\n": "5",
    "\nA guardian of adult may not appoint its sub-agent unless there is an unavoidable reason to do so.\n": "2",
    "\nIn cases where a privetely appointed agent appointed its sub-agent when there is an unavoidable reason to do so,\neven if the sub-agent has incurred costs found to be necessary for the administration of the mandated business,\nhe/she may not claim reimbursement of those costs from the principal.\n": "5",
    "\nIn cases where the agent (B) for (A) concluded a contract for sale by (C)'s fraud,\n(B) may rescind the contract for sale;\nhowever, (A) may not rescind it.\n": "19",
    "\nThe order of priority of special statutory liens,pledges and mortgages with respect to the same immovable properties shall follow the chronological order of their registration.\n": "15",
    "\nExtension of security interest to proceeds of collateral may be done with respect to a right of retention, a statutory lien, a pledge and a mortgage.\n": "15",
    "\nA right of retention shall not be extinguished even if the holder of the right of retention loses possession of the Thing retained, but ,in this case, this right may not be asserted against third parties.\n": "14 7",
    "\nThe statutory lien over movables shall prevail over the pledge of movables.\n": "15",
    "\nFor the formation of rights of retention under Civil Code, existence of a claim that has arisen with respect to the subject matter and possession of the subject matter by the obligee are required, but it is not required that the obligee possess the subject matter at the time of the formation of the claim.\n": "18",
    "\nIn cases where the lessee does not pay rent,\neven if the lessor of a building has received a security deposit and that security deposit will satisfy unpaid rent,\nhe/she shall have a statutory lien.\n": "15",
    "\nIn cases where a lessee of a building has not paid the purchase money with respect to the sale of a dresser for a furniture store and has not paid the rent for the lessor,\nthe furniture store's statutory lien with respect to the dresser shall prevail over the lessor's statutory lien with respect to the same.\n": "15",
    "\nIf a company does not pay salary, the employee shall have a statutory lien with respect to the salary, regardless of the unpaid period, over the entire property of the company.\n": "15",
    "\nIn cases where a company has not paid the purchase money with respect to the sale of refrigerators for an electronics store and it has not paid salaries for its employees,\nthe electronics store's statutory lien with respect to the refrigerators shall prevail over employees's statutory lien with respect to the same.\n": "15",
    "\nIn cases where an obligor owns an immovable property and a movable property which are not the subject of an agreed security interest, a right of retention and a special statutory lien,\nthe holders of general statutory liens are first paid out of the immovable property,\nand they are paid out of the movable property only if the claim that is not satisfied remains.\n": "15",
    "\nBecause mortgages are rights which grasp value of the subject, even in the case where an amount of a secured claim exceeds the value of the Mortgaged Immovable Properties, a mortgage shall be extinguished if a third party pledgor pays an amount equivalent to value of the subject.\n": "17",
    "\nEven if there is a default with respect to a claim secured by a mortgage, the mortgage shall not extend to the fruits of the Mortgaged Immovable Properties derived after the default.\n": "17",
    "\nIf a mortgagee demands that a third party who purchases the ownership of Mortgaged Immovable Properties pay the price of the same to the relevant mortgagee, the third party must respond to the request.\n": "17",
    "\nBefore the principal is fixed, a revolving mortgagee may assign a Revolving Mortgage or effect a partial assignment of the Revolving Mortgage, without the approval of the revolving mortgagor.\n": "17",
    "\nWhen the scope of the claims to be secured by a Revolving Mortgage is altered before the principal is fixed, the approval of subordinated obligees has to be obtained.\n": "17",
    "\nIf the alteration of obligors with respect to a Revolving Mortgage is not registered before the principal is fixed, it shall be deemed that such alteration was not effected.\n": "17",
    "\nWith respect to the principal secured by a Revolving Mortgage,\nif the date when the principal is to be fixed is not prescribed,\nthe Revolving Mortgage shall be void.\n": "17",
    "\nThe Revolving Mortgage which the principal is fixed secures\nnot only fixed payments of principal but also interest\nup to the maximum amount.\n": "17",
    "\nA monetary claim may not be made indivisible due to the manifestation of intention of the parties involved.\n": "18",
    "\nEven if one of the obligees of an indivisible claim releases the obligor from the claim, other obligees may request the obligor to perform the obligation in whole.\n": "18",
    "\nIf the subject of the claim is to be identified by way of choice among more than one performance, the right to make the choice shall vest in the obligee.\n": "18",
    "\nA third party who effects an effective performance not against the will of the obligor shall be subrogated by operation of law to the claim of the obligee by effecting performance.\n": "18",
    "\nGifts shall become effective by the manifestation by one of the parties of his/her intention to give his/her property to the other party gratuitously, and the acceptance of the other party thereof;\ntherefore, gifts shall not become effective if one of the parties to recieve property offers the gift and the other party accept the offer.\n": "19",
    "\nIn cases where there is a special agreement, in a contract of sale, to the effect that the seller will not provide the warranties against defects,\nif the seller knew but did not disclose that there is any latent defect in the subject matter of a sale,\nhe/she may not be released from the warranties against defects.\n": "19",
    "\nIn cases where the parties do not define the time for return in a contract for value of deposit for consumption of money,\nthe depositor may not demand the return of money\nunless he/she issues a notice of demand to the depositary, specifying a reasonable period.\n": "19",
    "\nIn cases where a mandate is cancelled for default, the cancellation shall be effective solely toward the future.\n": "19",
    "\nA quasi-mandate shall be effective even if it is not made in writing but a mandate shall not be effective unless it is made in writing.\n": "19",
    "\nIf a creditor of a partnership did not know, when his/her claim arose, the proportions of the partners' shares of losses, the creditor may exercise his/her rights against each partner in equal proportions.\n": "19",
    "\nAn obligor of a partnership may set off his/her obligation against his/her claim against the partners.\n": "19 5",
    "\nA partnership shall be dissolved on the successful completion of the business that is its object.\n": "19",
    "\nA person who has tendered anything as performance of an obligation may not demand the return of the thing tendered if the person were negligent in not knowing that the obligation did not exist.\n": "4 21 6",
    "\nBoth superficies and rights to lease land cannot be the subject matter of a mortgage.\n": "17",
    "\nAn owner of the land shall not assume an obligation to a superficiary to make the land available, but a lessor shall assume an obligation to a lessee to make the land available.\n": "10 11 12 13",
    "\nA superficiary may assign the superficies without obtaining the approval of the owner of the land but a lessee may not assign the lessee's rights without obtaining the approval of the lessor or the court's permission in lieu of it.\n": "11 12 13",
    "\nA is a nineteen-year-old male and subject to the parental authority of his parents.\nIn the case where A concluded a contract for sale without the consent of the persons who had parental authority in relation to him after he had been permitted to carry on business by the persons who had parental authority in relation to him, even if the contract for sale is not concerned with such business, A may not rescind the contract for sale.\n": "1 2",
    "\nA is a nineteen-year-old male and subject to the parental authority of his parents.\nIn the case where the person who had parental authority in relation to A permitted A to dispose of the money which A acquired by a part-time job of delivering newspapers, and A purchased a bicycle by the money which he acquired by the part-time job, even if A did not obtain the consent of the person who had parental authority in relation to him when he concluded the contract for sale, A may not rescind the contract for sale.\n": "1 2 3",
    "\nA is a nineteen-year-old male and subject to the parental authority of his parents.\nEven if A constantly lacks the capacity to discern right and wrong due to mental disability, the family court may not order the commencement of guardianship with respect to A until A has attained the age of majority.\n": "2",
    "\nA is a nineteen-year-old male and subject to the parental authority of his parents.\nIn the case where A concluded a contract not in writing to the effect that A would make B a gift of 1,000,000 yen from the property which A had obtained by inheritance, even if A revoked the gift on the ground that it was a gift not in writing, if A did not obtain the consent of the person who had parental authority in relation to him with respect to the revocation of the gift, A may rescind the revocation of the gift.\n": "1 2 3",
    "\nThe person under curatorship A sold A's land \"X\" to B without the consent of the curator or any permission of the family court in lieu thereof.\nIn the case where B issues to the curator of A a notice which demands, by establishing a certain period which is one month, that he/she should give a definite answer on whether or not such person will ratify that contract for sale, if there is a supervisor of the curator, it is deemed that such contract has been rescinded unless the curator issues a definite answer of the ratification with the consent of the supervisor of the curator within such period.\n": "2",
    "\nThe person under curatorship A sold A's land \"X\" to B without the consent of the curator or any permission of the family court in lieu thereof.\nIn the case where B issues to A a notice which demands, by establishing a certain period which is one month, that he/she should obtain the ratification of his/her curator with respect to that contract for sale, if A fails to issue, within the applicable period, a notice to the effect that such ratification has been obtained, it is deemed that such contract for sale has been rescinded.\n": "3",
    "\nThe person under curatorship A sold A's land \"X\" to B without the consent of the curator or any permission of the family court in lieu thereof.\nIn the case where B, after A has become a person with capacity, issues to A a notice which demands, by establishing a certain period which is one month, that he/she should give a definite answer on whether or not such person will ratify that contract for sale, if A fails to send any definite answer within such period, it is deemed that he/she has ratified such contract for sale.\n": "2",
    "\nThe person under curatorship A sold A's land \"X\" to B without the consent of the curator or any permission of the family court in lieu thereof.\nIf, after A has become a person with capacity to act, A assigns the claim for the sale price of the land \"X\" to others, it is deemed that he/she has ratified such contract for sale.\n": "1 2 3",
    "\nIf the adjudication of disappearance is made with respect to A, who was aboard a vessel which later sank, A is deemed to have died upon elapse of one year after the sinking accident.\n": "1 2 3",
    "\nIf the adjudication of disappearance is made with respect to A because it is not clear whether A is dead or alive for 7 years, A is deemed to have died upon elapse of the period of 7 years.\n": "2",
    "\nIn the case where, after the adjudication of disappearance had been made with respect to A and A had been deemed to have died because it had not been clear whether A had been dead or alive for 7 years, A was found to be alive, but the adjudication of disappearance was not rescinded and A died, the adjudication of disappearance may no longer be rescinded.\n": "2",
    "\nIn the case where, after A, who owns the land \"X\", had faked a transfer of the land \"X\" to B based on collusion with B and the transfer of ownership from A to B had been registered, B's obligee C attached the land \"X\", if C was without knowledge with respect to the fake transfer at the time of the attachment, A may not assert, against C, that the transfer to B is void.\n": "12 13",
    "\nA person who manifested to third parties that he/she granted certain authority of agency to other person shall be relieved of liability for acts performed within the scope of such authority if the person makes allegations and shows proof that such third parties knew, or were negligent in not knowing, that such other person were not granted the authority of agency.\n": "1 2",
    "\nApparent authority of act exceeding authority shall not arise if the principal was not negligent as to the fact that the counterparty believed that the person who acted as an agent had the authority to perform the act.\n": "5",
    "\nWith respect to any inherited property, even if the administrator of the inherited property is appointed, the prescription shall not be completed until the applicable heir is identified.\n": "7",
    "\nIf the principal obligor waives the benefit of the prescription with respect to his/her obligation, the waiver shall also be effective vis-a-vis the guarantor.\n": "18",
    "\nIn the case where A and B co-own the land \"X\", if A renounces his/her share, A's share shall vest in B.\n": "11 12 13",
    "\nIf the partition of the land co-owned by A and B creates the land \"X\", which has no access to public roads and the land \"Y\", which has access to public roads, A, the owner of the land \"X\", may pass to the public roads through B's land \"Y\", but it shall be necessary to pay compensation with respect to the passage.\n": "10",
    "\nIf two buildings are owned by different owners and there is an open lot between them, each owner may install a fence on the boundary, sharing the expenses with the other owner.\n": "10",
    "\nIf the principal movable owned by A and the accessory movable owned by B are so joined to each other that they can no longer be separated without damaging the same, ownership of the composite Thing shall vest in A and B may demand compensation against A.\n": "10",
    "\nIn the case where A and B co-own a building, if A has paid for B the expenses of management in proportion to B's share and has demanded B to perform the obligation of the reimbursement but B does not perform the obligation within one year, A may acquire B's share by paying reasonable compensation.\n": "10 11 12 13",
    "\nIn the case where, in order to cause drainage water from the land \"X\" owned by A to pass, A starts to use the drainage facility already established by B, owner of the land \"Y\", which is lower than the land \"X\", it is necessary for A to bear the expenses of the preservation of the facility in proportion to the benefit he/she enjoys, but it is not necessary for him/her to bear the expenses of the establishment of the facility.\n": "10",
    "\nStatutory liens on expenses for the common benefit shall prevail over all special statutory liens.\n": "15",
    "\nWith respect to natural fruits of agricultural land, statutory liens for agricultural labor shall prevail over statutory liens for leases of immovable properties.\n": "15",
    "\nStatutory liens for construction work for immovable properties whose budgeted expenses were registered prior to the commencement of the same shall prevail over the mortgage whose creation was registered prior to those registrations.\n": "15",
    "\nIn cases where there is conflict between statutory liens for preservation of immovable properties and statutory liens for construction work for immovable properties with respect to the same immovable properties, the order of priority shall be the same.\n": "15",
    "\nIf there are two or more holders of statutory liens with the same priority with respect to the same object, the holders of statutory liens shall be paid in proportion to the amounts of their claims.\n": "15",
    "\nIn cases where the due date of the claim that is the subject matter of the pledge over a claim has arrived, even if the due date of the secured claim has not arrived, the pledgee may directly collect the claim that is the subject matter of the pledge over a claim.\n": "16",
    "\nWhen a pledges is to be created over a claim, and the delivery of an instrument evidencing it is required for its assignment, the creation of the pledge shall take effect by the delivery of such instrument.\n": "16",
    "\nIn cases where, after a contract for sale of movables was concluded and a portion of the purchase money was paid, the contract for sale was cancelled due to default, upon refunding the portion of the purchase money received, the seller does not have to pay interest from the time of the receipt of that money.\n": "19",
    "\nIn the case where a contract for sale was concluded between A and B and A defaults, if, even though A issues a notice of demand to B, specifying a reasonable period, to the effect that B is to give a definite answer as to whether or not the right to cancel the contract will be exercised, B does not give the notice of cancellation within the period, A shall not be liable for the default after that.\n": "19",
    "\nEven if an obligee's claim has not become due, with respect to acts of preservation, the obligee may exercise the obligor's right in subrogation of the obligor.\n": "18",
    "\nIf there is any novation between one joint and several obligor and the obligee, other joint and several obligor(s) shall be relieved of the previous obligation and shall not be liable for the obligation which newly arises by novation.\n": "18",
    "\nThe nullification of prescription due to acknowledgement of the obligation by one joint and several obligor shall not affect other joint and several obligors.\n": "18",
    "\nAn obligee who assigned a claim against the special agreement prohibiting the assignment of the claim may assert the nullity of such assignment on the grounds of the existence of the special agreement unless the obligor has acknowledged the assignment.\n": "18",
    "\nIn the case where, with respect to A's claim against B, B made the performance vis-a-vis C, who had no authority to receive the performance, and A was enriched as a result thereof, even if B knew that C had no authority to receive the performance, the performance shall have the effect to the extent A is enriched.\n": "18",
    "\nIf A, who assumes an obligation to deliver a movable, delivered, to the obligee B, a movable owned by others as the performance of the obligation and B consumed the movable not knowing that the movable was owned by others, such performance shall be effective.\n": "18",
    "\nIf the offeree has accepted the offer by adding any condition or has accepted it by making any other modification, it shall be deemed that the offeree has refused the offer and has made a new offer.\n": "19",
    "\nIn cases where no notice of acceptance is required due to the offeror's manifestation of intention or usage of trade, the contract shall be formed upon the occurrence of any fact which ought to be regarded as a manifestation of intention of acceptance.\n": "19",
    "\nIn cases where the notice of acceptance of an offer that specify period for acceptance was dispatched within the period, the contract shall be formed and become effective even if the notice of acceptance did not arrive at the offeror.\n": "19",
    " The offeror may deem a delayed acceptance to be a new offer. ": "19",
    "\nIn cases where, after the notice of acceptance of the offer that had not specified period for acceptance had been dispatched, the notice to revoke the offer arrived at the offeree, if the offeree was in a position to know that the notice had been dispatched at a time which, under normal circumstances would have allowed the notice to arrive before the dispatch of the acceptance notice, it shall be deemed that no contract was formed regardless of whether or not the offeree dispatches to the offeror a notice to the effect that the notice to revoke the offer arrived late.\n": "18 19",
    "\nPeriodic gifts shall lose its effect on the death of the donee, but they shall not lose its effect even if the donor dies.\n": "19",
    "\nWith respect to gifts, even if they are with burden, the provisions regarding bilateral contracts shall not apply mutatis mutandis.\n": "19",
    "\nIn cases where the buyer alleges a defense for simultaneous performance, the seller may allege that there was an agreement that the payment of purchase money would be made prior to the delivery of the subject matter and the procedure for registration of transfer of the ownership, as re-defense.\n": "19",
    "\nIf any mortgage is registered on immovable property that is the subject matter of a sales contract, the buyer may refuse to pay the purchase money until the completion of the procedures of the claim for extinguishment of the mortgage.\n": "19",
    "\nA contract to the effect that B would sell C a land \"X\" owned by A (hereinafter referred to as the \"Contract for Sale\") was concluded.\nIn the case where, at the time when the Contract for Sale was concluded, B did not know that the ownership of the land \"X\" did not belong to B and C knew that the ownership of the land \"X\" did not belong to B, if B cannot acquire the ownership of the land \"X\" and transfer the same to C, B may cancel the Contract for Sale by notifying C to the effect that B cannot transfer the ownership of the land \"X\".\n": "10 12 13",
    "\nA contract to the effect that B would sell C a land \"X\" owned by A (hereinafter referred to as the \"Contract for Sale\") was concluded.\nIn the case where, at the time of conclusion of the Contract for Sale, C did not know that the ownership of the land \"X\" did not belong to B, if B cannot acquire the ownership of the land \"X\" and transfer the same to C, C may cancel the Contract for Sale only within one year from the time when he/she came to know that the ownership of the land \"X\" did not belong to B.\n": "10 11 12 13",
    "\nIf the delivery of the subject matter of work performed is required, the contractor may not claim the remuneration until and unless he/she has delivered the same.\n": "19",
    "\nThe duration of contractor's warranty may not be extended by contract.\n": "19",
    "\nIn the case where a depositary has undertaken a deposit gratuitously, it shall be sufficient if he/she retains the Thing deposited exercising care identical to that he/she exercises for his/her own property.\n": "4 20 21 6",
    "\nThe depositor, regardless of making payment or not, must compensate the depositary for damages that occur due to the nature of or defects in the Thing deposited except when the depositor did not, without negligence, know of such nature or defect, or the depositary knew of the same.\n": "19",
    "\nA depositary may not use, or allow third parties to retain, the Thing deposited without obtaining the consent of the depositor.\n": "19",
    "\nEven in cases where the timing of the return of the deposited goods is specified, the depositary may return the deposited goods prior to the timing of the return if the reasonable period has elapsed after he/she notified the depositor of the return.\n": "18",
    "\nEven if the timing of the return of the Thing deposited is specified, the depositor in cases of a deposit for consumption may demand the return of the Thing deposited at any time.\n": "18",
    "\nEven with respect to any person who constantly lacks the capacity to discern right and wrong due to mental disability, the family court may order the commencement of curatorship if the person's spouse files a petition seeking the order of the commencement of curatorship.\n": "2",
    "\nThe creditor of a partnership may not exercise his/her rights against each partner.\n": "19",
    "\nIn cases where a privately appointed agent lawfully appointed its sub-agent, if the sub-agent has received monies and other Things during the course of administering the mandated business, the sub-agent shall assume an obligation to deliver to the principal the received Things.\n": "5",
    " An unborn child may not be given a gift on the donor's death. ": "19",
    " A juridical person may not be a partner of a civil law union. ": "2",
    "\nA juridical person may not be entitled to demand damages other than property damages.\n": "3 22",
    "\nIn cases an agent is entrusted to perform any specific juristic act, if the agent performs such act in accordance with the instructions of the principal, the principal may not assert that the agent did not know a particular circumstance without negligence which the principal did not know due to his/her negligence.\n": "5",
    "\nAn agent who has no specified authority shall have the authority only to do the acts of preservation.\n": "5",
    "\nIn cases an agent makes a false manifestation of intention on sales contract in collusion with the counterparty, the counterparty may assert the invalidity of the contract regardless of whether the principal knew the false manifestation of intention.\n": "5",
    "\nThe authority of an agency shall be terminated upon ruling for commencement of curatorship against the agent.\n": "5",
    "\nA contract may not be rescinded by the principal after it is performed by an agent with a counterparty even if it turns out that the agent was a person with limited capacity.\n": "5",
    "\nAfter a principal refuses to ratify an act performed by a person without any authority of an agency, even the principal cannot make it effective by ratification.\n": "5",
    "\nEven after a principal ratifies a contract concluded by a person without any authority of an agency, the counterparty who did not know that the agent was without any authority at that time may rescind the contract.\n": "5",
    "\nIf a proxy act of a person who has parental authority is the act of conflicting interests, the principal can approve it after he/she attained the age of majority.\n": "2",
    "\nThe period of prescription of a right to demand compensation for damages in tort established in an unappealable judgment shall be ten years.\n": "20 22",
    "\nA concluded a sales contract with B to the effect that A sold land P owned by A (hereinafter referred to as \"First Sales Contract\"), and received the payment from B, but A did not undertake the ownership transfer registration procedure from A to B. Then A concluded a sales contract with C to sell land P to C (hereinafter referred to as \"Second Sales Contract\"), and ownership transfer registration procedure from A to C was undertaken. After that, A went missing and B brought an action against C for the transfer registration procedure from C to B based on the ownership. In a statement of claim, B must prove that A owned land P, the establishment of First Sales Contract and the existence of C's registration.\n": "10 11 12 13",
    "\nA concluded a sales contract with B to the effect that A sold land P owned by A (hereinafter referred to as \"First Sales Contract\"), and received the payment from B, but A did not undertake the ownership transfer registration procedure from A to B. Then A concluded a sales contract with C to sell land P to C (hereinafter referred to as \"Second Sales Contract\"), and ownership transfer registration procedure from A to C was undertaken. After that, A went missing and B brought an action against C for the transfer registration procedure from C to B based on the ownership. If C claims a defense of requirement for perfection, C must prove that the second sales contract was concluded and that C was without any knowledge of First Sales Contract and was not negligent about Fisrt Sales Contract at the time of conclusion of Second Sales Contract.\n": "12 13",
    "\nActions for maintenance of possession must be brought during the disturbance.\n": "7",
    "\nA's minor child B who is living with A in building P owned by A shall not possess the possessory right of building P.\n": "9 20 22",
    " Free superficies may not be established. ": "11 4 13",
    " Superficies may be established without specified duration. ": "11 13",
    " Free emphyteusis may not be established. ": "14 7",
    "\nIn cases an engine (worth four million yen at that time) owned by B is attached to a ship owned by A (worth six million yen at that time), if they cannot be separated without damage and the distinction between the principal and the accessory cannot be made, A and B shall share the ship with the engine in a ratio of three to two.\n": "12 13",
    "\nIn cases liquid P (100 cubic meters) owned by A was blended with liquid Q (10 cubic meters) owned by B into liquid R (110 cubic meters) so that they cannot be distinguished and A acquired the ownership of liquid R, B may demand compensation from A in accordance with the provisions of unjust enrichment.\n": "10",
    "\nIn pledges of immovables, pledgees and a pledgors may conclude a special provision that the pledgees may not use and receive the profits from the immovable property that is the subject matter of the pledge.\n": "16",
    "\nIf a third party who purchases the superficies of Mortgaged Immovable from the owner pay the price of the same to the relevant mortgagee at the request of the mortgagee, the mortgage shall be extinguished for the benefit of that third party.\n": "17",
    "\nNo successor of the primary obligor may make a claim for the extinction of a mortgage.\n": "17",
    "\nIn cases where there is a delivery of building, and all persons holding mortgages give their consent and such consents are registered before the delivery, the building lease, even if not so registered, can be asserted against those mortgagees who gave their consent.\n": "17",
    "\nIn cases where a person who purchases Mortgaged Immovable Properties pay for the necessary expenses, and if the Mortgaged Immovable Properties is auctioned by execution of Mortgage, he/she shall be entitled to obtain reimbursement of the same out of the proceeds prior to the first Mortgagee.\n": "17",
    "\nIn order to alter obligors before the principal is fixed, it is required that the approval of subordinated obligees be obtained.\n": "18",
    "\nA revolving mortgagee may request the fixing of the principal secured at any time if the date on which the principal secured is to be fixed is not prescribed.\n": "17",
    "\nIn cases where a revolving mortgagee executes his/her Revolving Mortgage, he/she may not be distributed the proceeds from the portion that is over the maximum amount with respect to all fixed payments.\n": "17",
    "\nIn order to reduce the maximum amount of a Revolving Mortgage, it is not required to obtain the approval of the interested parties.\n": "17",
    "\nAfter the principal is fixed, the revolving mortagor may request a reduction in the maximum amount of that Revolving Mortgage, to the amount of the obligations actually in existence plus the amount of the periodical payments, including interest and the amount of damages due to default on obligations that will arise in the following two years.\n": "17",
    "\nA matter that cannot be given an estimated monetary value may not be the subject of a claim.\n": "18",
    "\nIn cases where the amount of the claim is specified in the currency of a foreign state, the obligor may not make the payment in the legal currency of Japan.\n": "18",
    "\nIn cases where the claim is alternative obligation, the right to make the choice shall vest in the obligor unless otherwise manifestation of intention provided.\n": "18",
    "\nIn cases where a minor performed an act to assume an obligation without any consent of his/her statutory agent, if the guarantor of the obligation knew that the minor acted without such consent, and the act was cancelled later because he/she was a minor, it is presumed that the guarantor assumed an independent obligation of the same subject.\n": "2",
    "\nEven if the principal obligor has a claim vis-a-vis the obligee, the guarantor must perform his/her guarantee obligations when the obligee demands to do so.\n": "18",
    "\nIn cases where the amount of penalty with regard to the principal obligations is not provided, the guarantor may not stipulate the amount of penalty with regard to his/her own guarantee obligation only.\n": "18",
    "\nA guarantor without the entrustment of the principal obligor may not perform the obligation against the will of him/her.\n": "18",
    "\nA performance made vis-a-vis a person who has no authority to receive the performance shall have no effect to the obligee even if he/she is enriched as a result thereof.\n": "18",
    "\nA third party may not perform obligations if the parties made an agreement to prohibit that.\n": "19",
    "\nIn cases where any unspecified due date is assigned to the performance of a claim, the obligor shall be responsible for the delay on and after the earlier time when he/she becomes aware of the arrival of such time limit or when he/she is demanded to perform after the arrival of such time limit.\n": "18",
    "\nIn case a third party who has interest in the performance of an obligation tendered the performance and the obligee refuses, the third party may not deposit against the will of the obligor.\n": "18",
    "\nWhen an obligor deposits the subject matter of monetary debt, the obligations shall be extinguished when the obligee receives the money.\n": "18",
    "\nThe depository is effective if the obligor deposits as much money as he/she thinks as sufficient, even though it does not fulfill the amount of the obligations.\n": "18",
    "\nIn cases where an obligee manifests his/her intention to release an obligation to the obligor, such obligation shall be extinguished when the obligor manifests his/her intention to receive the benefit of the release.\n": "18",
    "\nIn cases where an obligee releases the obligor from the obligation, the obligor may not demand the return of the thing tendered when the obligor tendered anything as the performance of the obligation because the obligor forgot that he/she was released from the obligation.\n": "18",
    "\nIn cases where B, C, and D assume obligations amount of 3,000,000 yen to A jointly and severally, and even if A releases C from the joint and several obligations, B and D assume obligations amount of 3,000,000 yen jointly and severally.\n": "21 6",
    "\nIn cases where B, C, and D assume obligations amount of 3,000,000 yen jointly and severally, and even if A releases C from the full of obligation, B and D assume obligations amount of 3,000,000 yen jointly and severally.\n": "21 6",
    "\nIn cases where a principal obligor is released from the obligations, the obligations of the joint and several guarantor shall be extinguished.\n": "18",
    "\nNo pre-contract of a monetary loan for consumption shall be effective unless it is made in writing.\n": "19",
    "\nIn cases where a lender gives money to a third party the borrower designates, a monetary loan for consumption shall be effective.\n": "19",
    "\nIn cases where no agreement over the place to perform the obligation is provided in monetary loans for consumption, the obligor must bring the money as a performance of the obligation to the present address of the obligee.\n": "18",
    "\nIn building loans for use, the lender shall be liable for a defect in the subject building of the loan if the lender is negligent in knowing the defect.\n": "8 19",
    "\nA who is the owner of a building and B made a loan agreement where B borrows the building for free only while A is working abroad, and then, however, A made a loan contract with third party C, and transferred the building. In such case, B may not demand compensation for damages due to default based on the loan for use contract from A.\n": "10",
    "\nIn cases where a borrower incurred useful expenses with respect to a leased thing, and there is a current increase in value, it shall be sufficient for the lender to reimburse money the possessor paid or the amount of the increased value at the selection of the lender.\n": "19",
    "\nIn cases where the borrower transferred the subject matter of loan to a third party without any approval of the lender and allowed the third party to use of it, the lender may not cancel the contract before he/she required the performance.\n": "19",
    "\nA leased building D to B at 100,000 yen per month and delivered building D to B. Afterward, B subleased building D to C at 120,000 yen per month and delivered building D to C. If A has approved the sublease between B and C, A may demand that C pay 120,000 yen per month as a rent.\n": "19",
    "\nA gratuitous mandatary shall assume a duty to administer the mandated business with the care of the same care he/she would exercise for him/herself with the main purport of the mandate.\n": "19 5",
    "\nIf the mandatary has incurred costs found to be necessary for the administration of the mandated business, the mandatary may claim reimbursement of those costs from the mandatory and any interest on the same from the day the costs were incurred.\n": "19",
    "\nA mandate shall terminate when the mandatary is subject to an order for the commencement of guardianship.\n": "19",
    "\nA mandate may not be canceled by a mandatory unless there is an unavoidable reason to do so.\n": "19",
    "\nWhen A was on a long-term business trip and was absent, a part of a hedge of A's house collapsed due to a strong wind. Afterward, B who has a house on a land next to A's house performed an act for A without any obligation. If B has requested a gardener to repair the hedge, B may not demand the payment of the unpaid remuneration to the gardener from A.\n": "4 6",
    "\nWhen A was on a long-term business trip and was absent, a part of a hedge of A's house collapsed due to a strong wind. Afterward, B who has a house on a land next to A's house performed an act for A without any obligation. If the hedge has all collapsed after B repaired the hedge by him/herself and the repair has been against A's intention, B may not demand the payment of the expenses for the repair from A.\n": "11 13",
    "\nWhen A was on a long-term business trip and was absent, a part of a hedge of A's house collapsed due to a strong wind. Afterward, B who has a house on a land next to A's house performed an act for A without any obligation. If B started repair of the hedge by him/herself but the hedge has all withered because B left it in the middle of the repair, A may not claim the damage of the withered hedge.\n": "11 13",
    "\nWhen A was on a long-term business trip and was absent, a part of a hedge of A's house collapsed due to a strong wind. Afterward, B who has a house on a land next to A's house performed an act for A without any obligation. If B has repaired the hedge by him/herself for crime prevention of not only A's house but also B's house, B may not demand the payment of the expenses for the repair from A.\n": "4 6",
    "\nIf a contractor has inflicted a damage on a third party with respect to his/her work, a party ordering work shall not be liable for the damage unless the party ordering work was negligent in his/her order or instructions.\n": "20 21 7",
    "\nIf any defect in the installation or preservation of any structure on land causes damages to others and the owner has used necessary care to prevent the damages arising, the possessor shall compensate for the damages.\n": "9",
    "\nA possessor of an animal shall not be liable to compensate for the damages that the animal has inflicted on others if he/she managed the animal with reasonable care according to the kind and nature of the animal.\n": "9 22",
    "\nIf an obligor inherits a claim over which a pledge is created, such claim shall be extinguished.\n": "16",
    "\nIf a guarantor inherits an obligee, the guarantee obligation shall be extinguished.\n": "18",
    "\nA contract of sales concluded by a minor may not be rescinded if it relates to daily life, even in cases the consent of the parental authority is not obtained.\n": "2",
    "\nA contract of sales concluded by an adult ward may be rescinded except relating to daily life, even in cases the consent of the adult guardian has been obtained, the contract\n": "2",
    "\nA contract of guarantee concluded by a person under curatorship may not be rescinded in cases the consent of the curator is obtained.\n": "18",
    "\nAn act which requires the consent of the assistant may be rescinded if the person under assistance performed it without such consent or the permission of family court in lieu thereof.\n": "2",
    "\nThe period of the extinctive prescription of the right to rescind about the act performed by an adult ward commences from the time of becoming a person with capacity to act.\n": "1 3",
    "\nThe family court appointed B as the administrator of the property of absentee A, as A went missing without appointing the one. In cases where A owns land X, B needs to obtains the permission of a family court in order to sell Land X as an agent of A.\n": "2",
    "\nThe family court appointed B as the administrator of the property of absentee A, as A went missing without appointing the one. In cases where cash owned by A is discovered, B doesn't need to obtain the permission of a family when depositing in A's saving account of Bank D as an agent of A.\n": "2",
    "\nThe family court appointed B as the administrator of the property of absentee A, as A went missing without appointing the one. In cases where A has the debt obligation which is due against E, B doesn't need to obtain the permission of a family court when paying it to E for the benefit of A.\n": "2",
    "\nThe family court appointed B as the administrator of the property of absentee A, as A went missing without appointing the one. In cases where A is one of the joint heirs of decendent F, B doesn't need to obtain the permission of a family court when dividing inherited F's property by agreement between the other joint heirs as an agent of A.\n": "2",
    "\nThe family court appointed B as the administrator of the property of absentee A, as A went missing without appointing the one. In cases where A has child G, B doesn't need to obtain the permission of a family court when donating marriage fund to G as an agent of A.\n": "2",
    "\nIn case where A's agent B concluded the contract with C  within the scope of such authority without indication that it is made on behalf of A, it will not be effective between A and C unless C knows that the B is acting on behalf of A.\n": "5",
    "\nIn case where A obtains the permission from B and C in advance, A will conclude the contract between B and C as the agent of both\n": "18 21",
    "\nIn cases where a statutory agent may appoint a sub-agent by any unavoidable reason, it shall assume only the responsibility vis-a-vis the principal for the appointment and supervision of such sub-agent.\n": "5",
    "\nWhen An unauthorized agent acted believing that it had had authority of agency without negligence, it shall not be liable to the counterparty for the performance of the contract or damages even if it is unable to obtain the ratification of the principal.\n": "5",
    "\nWhile it is uncertain whether or not a condition has been fulfilled, the rights and obligations of the party concerned may be disposed of, inherited or preserved, or any security may be provided therefor, in accordance with the usual provisions of the law.\n": "5",
    "\nJuristic act subject to a condition subsequent which is impossible is impossible shall be void.\n": "5",
    "\nIn cases any party who will suffer any detriment as a result of the fulfillment of a condition intentionally prevents the fulfillment of such condition, the counterparty may deem that such condition has been fulfilled.\n": "5",
    "\nA juristic act which is subject to a condition precedent shall be void if the condition is dependent upon the will of the obligor.\n": "5",
    "\nA person who possesses his/her own thing may not invoke acquisitive prescription of it.\n": "9 7",
    "\nIn cases where a person asserts more than two possessions succeeded together with his/her own by the change of possessors, whether or not he/she is in good faith and without negligence is decided shall be judged by the first possessor at the time of the commencement of the possession.\n": "9",
    "\nIn cases A sold Land X belonging to A and B sold it to C, C may be asserted against A about ownership of Land X for sales without special security.\n": "10 11 13",
    "\nIn cases B was bequeathed land X by A, B may be asserted against D about ownership of Land X for bequest without special security when C's obligee D amongst joint heirs attached C's share and registered because of joint succession to Land X.\n": "10 11",
    "\nA allowed B to retain movable X. B died and an only heir D started to possess X actually believing that it belongs to B's inherited property without negligence.In cases X is a jewel, D may acquire ownership of X immediately.\n": "9 7",
    "\nA allowed B to retain movable X. B donated X to E and E was delivered actually believing that it belongs to B  without negligence.In cases X is a jewel, E may acquire ownership of X immediately.\n": "11 12 13",
    "\nA allowed B to retain movable X. X is auctioned compulsorily by B' obligee, F bought it and F was delivered actually believing that it belongs to B  without negligence.In cases X is a jewel, E may acquire ownership of X immediately.\n": "10 11 12 13",
    "\nA allowed B to retain movable X. B pledged X to G and was delivered actually believing that it belongs to B without negligence. In cases X is a jewel, E may acquire pledge of X immediately.\n": "16",
    "\nIn cases seeds, which had been sowed based on no title to using and making profits from land, grew into seedlings,ownership of the seedings shall vest in the owners of it.\n": "11 12 13",
    "\nIf a processor uses only other's woods as materials and contributes work to them, the processor shall acquire ownership of the thing when the value derived from the work significantly exceeds the value of the materials.\n": "10",
    "\nIf the partition of land which A and B co-owns creates a parcel of A's Land X that has no access to public roads and B's Land Y that has access to public roads, A may pass to the public roads from Land X through Land Z when passing through Land Z cause the least damage.\n": "10",
    "\nIf land suffers damage due to destruction or blockage of a culvert installed on neighboring land to discharge or draw water, the owner of that land may have the owners of such neighboring lands repair or remove the it.\n": "10",
    "\nIf a tree or bamboo branch from neighboring land crosses a boundary line, the landowner may sever that branch by nis/her own.\n": "10",
    "\nBoundary markers installed on boundary lines shall be presumed to be co-owned by the neighbors.\n": "10",
    "\nA landowner may install boundary markers, sharing the expenses with the owner of the neighboring land.\n": "10",
    "\nA, B and C co-own Building X at the rate of one-third each. A needs to obtain the consent of B and C if A create a mortgage in the share.\n": "17",
    "\nA, B and C co-own Building X at the rate of one-third each. If A holds a claim regarding administration of Building X, A may exercise a claim also against F when B transfer the share to F.\n": "10 11 12 13",
    "\nA holder of rights of retention may lease subject real estate without obtaining the consent of the obligor.\n": "4 6",
    "\nIn order to preserve the effectiveness of statutory liens for preservation of immovable properties, registration must be carried out immediately after the completion of the act of preservation.\n": "15",
    "\nPledgees of immovable properties can demand interest on their claims in cases where the acts establishing pledges provide otherwise.\n": "16",
    "\nIf a holder of the right of retention loses a object material, the detention right disappears.\n": "20 14",
    "\nA possessor of a thing belonging to another person may retain that thing even if a claim that has arisen with respect to that thing has not yet fallen due.\n": "9",
    "\nAn obligor may demand that a right of retention be extinguished by tendering reasonable security.\n": "4 20 14",
    "\nIn cases where A sold C Building X he/she owns and registerd with respect to it after delivering Building X to B, B may may retain Building X to secure a claim for damages due to default if C demanded vacation of Building X from B.\n": "11 12 13",
    "\nA pledgee of claim may not colllect the claim directly, when the subject matter of the pledge of claim is not a monetary claim.\n": "16",
    "\nA pledgee of movables may receive the profits from the movable property, and reimburse secured debt by the profits prior to other creditors.\n": "16",
    "\nA pledgee may not further create a pledge with respect to the subject matter of the pledge as collateral for his debt without the consent of the pledgor.\n": "16",
    "\nDemand damages arising from latent defect in the subject matter of a pledge is not secured by a pledge, when the contract clause is not concluded.\n": "16",
    "\nA obligor (A) may create a pledge with respect to a claim vested in the obligee (B) against the obligor (A) to secure (A)'s claim ageinst (B).\n": "18",
    "\nA mortgage may also be exercised against the claim for damage that the obligor is to receive as a result of the loss of the subject matter of the mortgage.\n": "17",
    "\nIn cases where two buildings which are owned by one person that the distinction of principal and accessory cannot be made between become one building due to the construction, if mortgages are created with respect to the two buildings respectively, the mortgages shall own each mortage on the building in proportion to the respective price continuedly.\n": "17",
    "\nIn cases where a mortgage is created with respect to a building on leased land, the mortgage may not be exercised against the right of lease.\n": "17",
    "\nA contract to creat a mortgage to secure a claim to delivery movables  has no effect.\n": "17",
    "\nIn cases where a mortgage is created to secure a claim that may arise in the future and registrated, if the claime arises actually, the mortgage secure it effectively.\n": "17",
    "\nIn cases where a mortgagor lease land which is a subject matter of the mortgage to a person, the mortgage shall extend to the rent without a default with respect to a claim secured by the mortgage.\n": "17",
    "\nIn cases where a mortgage is created with respect to land by the owner of the land, if trees are planted and logged on the land, the mortgage shall entend to the trees.\n": "17",
    "\nIn cases where a mortgagor has juwels in the bluilding which is the subject matter of the mortgage, the mortgage shall entend to the juwels.\n": "17",
    "\nIn cases where a building which is the subject matter of a mortgage collapses and becomes movables, the mortgage shall entend to the movables.\n": "17",
    "\nIn cases where a person who lease a building which is the subject matter of a mortgage from the mortgagor installs his own air- conditioner which is removabe, the mortgage shall not extend to the air-conditioner.\n": "17",
    "\nIn cases where a mortgagor did not perform his obligation until the time of performance, if the mortgagee transfers his/her mortgaged real properties to a third party, the mortgagor may not assert a right of retention to secure settlement claims against the mortgagee when the third party claims the delivery of the mortgaged real properties.\n": "17",
    "\nNo contract of guarantee shall be effective unless it is made in writing or concluded by electromagnetic record which records the contents thereof.\n": "18",
    "\nA guarantor need to be a person with the capacity to act, even if the obligee has designated the guarantor.\n": "18",
    "\nA contract for revolving guarantee on loans shall be invalid, in the cases where it does not provide a principal determination date.\n": "8 19",
    "\nWhere a guarantor may demand the obligee to demand performance of the principal obligor first, if the obligee fails to demand and is subsequently unable to obtain full performance from the principal obligor, the guarantor shall be relieved of liability to the extent that the obligee would have received performance if the obligee had immediately demanded.\n": "18",
    "\nIn the cases where the obligor has given the acknowledgement referred to the assignment of a claim of remuneration receivables related to unfinished work which the obligor cntracts out to the contractor, if the assignee knows that the claim is remuneration receivables related to unfinished work, the obligor may refuse to perform his/her obligation by asserting the cancellation right of the contract against the assignee.\n": "19",
    "\nThe order of priority of the assignment of a claim and the attachment of the same claim shall follow  the order of the time when the requirements for the assertion of the assignment against third parties expect the pobligor is met and the time when the attachment order is issued.\n": "18",
    "\nthe obligee(B) may not manifests his/her intention to release an obligation to the obligor(A) against the will of the obligor(A).\n": "18",
    "\nA third party may guarantee monetary debts which the obligor(A) contracts with the obligee(B) against the will of the obligor(A).\n": "18",
    "\nThird person mortgagor who secures the monetary debts which the obligor(A) contract with the obligee(B) may not perform the obligation against the will of the obligor(A).\n": "18",
    "\nThe obligee(B) and a third party(C) may not replace the obligor(A) who contracts monetary debts with the obligee(B) to the third party(C) for by novation against the will of the obligor(A).\n": "18",
    "\nThe obligee(B) may not perform the obligation which he/she contracts with a third party by assigning the claim which the obligor(A) contracts with the obligee(B) to the third party as a substitute against the will of the obligor(A).\n": "18",
    "\nIn cases where the credit of sale value is assigned to the assignee with the requirements for assertion of the assignment, the tender of the performance by the obligor shall be sufficient if it is exercised at the place the assignor lives at the time.\n": "18",
    "\nIn cases where the seller of the specified things retains them at the place where he/she lives since he/she entered into the contract for sale, the tender of the performance shall be sufficient if the seller demands that the buyer accepts the subject matters by giving a notice that the delivery has been prepared.\n": "19",
    "\nThat a third party assumes a monetary debt jointly and severally with a debtor after the debtor has entered into the loans for consumption is a novation.\n": "19",
    "\nA novation by substitution of obligee may not be asserted against a third party unless it is made using an instrument bearing a fixed date.\n": "18",
    "\nIn cases where a mortgage is created to secure an guarantee obligation, the guarantee obligation is not extinguished  when a guarantor assumes the position of the principal obligor at the time the death of the principal obligor.\n": "17",
    "\nTo the extent of the purpose of the obligation in effect prior to the novation, the parties to the novation may convert the mortgage created as the security of such obligation by a third party to the obligation in effect after the novation without consent of the third party.\n": "17",
    "\nIn cases where the lessee(B) continually possesses the building X which is the subject matter of the lease after transfering it from the lessor(A), if a person(C) acquires it from the lessor(A) and subsequently registers the transfer of ownership from the lessor(A) to (C), the lessee(B) may not assert the acquirement of the ownership of the building X against (C). In such case, the lessee(B) may asserts the right of the lease of the building X against (C).\n": "19",
    "\nIn case a mandate made for a consideration, a mandator's obligation of payment for remuneration and the mandatary's obligation to administer the mandated business shall have the relationship of simutaneous performances.\n": "19",
    "\nIn a buyer has cancelled the seles contract of the building which is not registered yet because of a latent defect of it, the seller'obligation of reimbursement and the buyer's obligation to return the building have the relationship of simutaneous performances.\n": "19",
    "\nIn cases where a minor has rescinded a movable sale contract without the consent of his/her statutory agent, the seller'obligation of reimbursement and the buyer's obligation to return the subject matter of the sele have the relationship of simutaneous performances.\n": "19",
    "\nA quasi-loan has no effect if the the borrower do not deliver the subject matter of the quasi-loan to the lender.\n": "19",
    "\nNo contract of loan for use shall be effective unless it is made in writing.\n": "19",
    "\nNo contract of deposit shall be effective unless the depositor promises the depositary to pay remuneration.\n": "8 19",
    " The subject of the contribution may not be money only. ": "19",
    "\n(A) and (B) agreed that (A) sell the used bicycle which (A) owned (hereinafter referred to as P) to (B) on April 1 with the provision for the delivery on april 10 and the payment on April 20. (P) was lost due to reasons attributable to (B) on April 8. In such case, (b) may not refuse the payment when (A) claims the payment from (B) on April 20.\n": "21 4 20 6",
    "\n(A) and (B) agreed that (A) sell the used bicycle which (A) owned (hereinafter referred to as P) to (B) on April 1 with the provision for the delivery on april 10 and the payment on April 20. (P) has a latent defect which is created before the sale, but (A) delivered (P) to (B) on April 10. In such case, (B) may cancel the sale, if (B) cannot achieve his/her purpose of the sale on account of the defect.\n": "4 20 6",
    "\n(A) and (B) agreed that (A) sell the used bicycle which (A) owned (hereinafter referred to as P) to (B) on April 1 with the provision for the delivery on april 10 and the payment on April 20. (A) delivered (P) to (B) on April 10. But (B) did not pay even after April 20, sell (P) to (C) who did not know the sale which (A) and (B) entered into and deliverd (P) to (C). In such case, (A) may cancell the sale and claim the delivery of (P) against (C), if (B) did not pay after (A) demanded the payment.\n": "21 4 20 6",
    "\n(A) and (B) agreed that (A) sell the used bicycle which (A) owned (hereinafter referred to as P) to (B) on April 1 with the provision for the delivery on april 10 and the payment on April 20. (B) claimed the delivery of (P) against (A) without the tender of the payment on April 21 because (A) had not delivered (P) to (B) on April 20. In such case, (A) may refuse the claim of the delivery based on rights of defense of simultaneous performance.\n": "4 20 6",
    "\n(A) and (B) agreed that (A) sell the used bicycle which (A) owned (hereinafter referred to as P) to (B) on April 1 with the provision for the delivery on april 10 and the payment on April 20. (A) delivered (P) to (B) on April 25, but (B) did not pay for (A). In such case, (A) may demand the cost of (P) and interest on the purchase which (B) assumes an obligation to pay from April 21.\n": "20 21 14 6",
    " A lease becomes effective only when in writing. ": "19",
    " The duration of a lease may not exceed twenty years. ": "19",
    "\nEven if the parties specify the term of a lease, the lessor may request to terminate it at any time if he/she reserves the right to terminate during that period.\n": "19",
    "\nIn cases where a lessee continues to make use of the land after the expiration of the term of the lease, if a lessor who knows of the same raises no objection, it shall be presumed that a further lease is entered into under conditions identical to those of the previous lease.\n": "19",
    "\nIn cases where the parties do not specify the term of a lease, if either party requests to terminate it, it shall be cancelled at the time of the arrival of the notice of termination to the other party.\n": "18 19",
    "\nIf there is no significant defect in the subject matter of work and excessive costs would be required for the repair, the party ordering the work may not demand that the contractor repair the defect.\n": "10",
    "\nEven if there is a defect in the subject matter of work and the party ordering the work may demand that the contractor repair it, the party ordering the work may demand compensation for damages in lieu of the repair of the defect.\n": "16",
    "\nIn cases where the defect in the subject matter of the work arises due to the instructions given by the party ordering the work, even if the contractor knew that the instructions were inappropriate but did not disclose the same, he/she does not have an warranty against defects.\n": "19",
    "\nWhen one of the parties contracts to build, the demand for repair by the other must be made within one year from the time of the completion of work.\n": "19",
    "\nEven if the contractor agrees to a special agreement to the effect that the contractor will not be liable for the warranty against defects, the contractor may not be released from the contractor's liability with respect to facts the contractor knew and did not disclose.\n": "19",
    "\nIf any defect in the installation or preservation of any structure on land caused damages to others and A as the possessor of such structure shall be liable to the victims to compensate for those damages, when A compensated for those damages, A may have a right to remedy over against B who shall be liable for the damages.\n": "9 14",
    "\nEven if any defect in the planting or support of A's trees caused damages to B, if A managed them with reasonable care, A shall not be liable to compensate for the damages.\n": "4 6",
    "\nIf any defect in the installation or preservation of X building that A owns caused damages to B, even if the defect had arisen when the previous owner had owned X building, A as the possessor of X building shall be liable to compensate for those damages to B.\n": "7",
    "\nIf A leased and transfered X building that A owns to B , B subleased and transfered it to C, B as the possessor shall not be liable to the third party to compensate for damages which any defect in the installation or preservation of X building caused.\n": "9 22",
    "\nIn cases where any defect in the installation or preservation of any structure on land caused damages to A,if B who possesses such structure shall be liable to compensate for those damages, the owner must compensate for the damages too when B has no financial resources.\n": "10",
    "\nWith respect to any right which either husband or wife has vis-a-vis the other spouse, the prescription shall not be completed during marriage.\n": "7",
    "\nThe authority of agency shall not be terminated upon the death of the principal.\n": "5",
    "\nWhen the depositor died, if the timing of the return is specified, the depositary may return the deposited goods prior to the due date.\n": "19",
    " Loans for use shall not lose its effect on the death of the lender. ": "19",
    " Partners shall withdraw if the partner dies. ": "19",
    "\nIn cases where the subject of a claim is the delivery of any specified things, the obligor must take custody of such property with due care of a prudent manager until the completion of such delivery, even if the obligee refuses, or is unable, to accept the tender of the performance of any obligation.\n": "18",
    "\nThe obligation for the preservation which the obligor contracts with the obligee until the delivery of the specific thing can be reduced with a special contract.\n": "18",
    "\nA donor shall assume a duty to retain the subject matter exercising care identical to that he/she exercises for his/her own property until the completion of such delivery.\n": "4 20 6",
    "\nThe family court may decide to commence an assistance also in respect of a person whose capacity to appreciate their own situation is extremely inadequate due to a mental disorder.\n": "2",
    "\nThe issuance of a decision for commencement of assistance at the request of a person other than the person in question requires the consent of the person in question unless the family court finds it to be suitable.\n\n": "2",
    "\nIf the grounds of commencement of assistance cease to exist, the family court may rescind the decision for commencement of assistance without any party's request.\n": "2",
    "\nIf the assistant does not consent to an act for which the person under assistance must obtain the assistant's consent even though it is unlikely to prejudice the interests of the person under assistance, the family court may grant permission that operates in lieu of the assistant's consent, at the request of the person under assistance.\n": "2",
    "\nA foreign juridical person permitted possesses the same private rights even if a foreign national is not entitled to enjoy the rights as those possessed by a juridical person of the same kind that has been formed in Japan.\n": "1 3",
    "\nWith respect to the rescission of a manifestation of intention on the ground of a mistake, whether the mistake is material or not is decided on the basis of the person making the manifestation of intention.\n": "5",
    "\nIf an act that may be rescinded by a person (A) who made the defective manifestation of intention on the ground of A's mistake, the act is also voidable by the counterparty (B).\n": "5",
    "\nIf a gift without burden was rescinded on the ground of a mistake by the donor (A), but the donee (B) had already received the payment or delivery based on the gift contract, and B did not know at the time of receiving the payment or delivery that the gift contract was voidable, B has an obligation to return to the extent currently enriched.": "19",
    "\nIn the case a manifestation of intention of A to B is based on a mistake and the mistake is due to gross negligence on the part of A, A may not rescind the manifestation of intention, unless B knew, or did not know due to gross negligence, of the mistake on the part of A.\n": "5",
    "\nA, who acts as the agent of B, concluded a contract with C for sale of land owned by B. However, A had no authority to represent to conclude the contract. A is liable for the performance of the contract or compensation for loss or damage, as chosen by A.\n": "5",
    "\nA, who acts as the agent of B, concluded a contract with C for sale of land owned by B. However, A had no authority to represent to conclude the contract. If B ratifies the contract of sales, A is not liable to C as an unauthorized agency.\n": "5",
    "\nA, who acts as the agent of B, concluded a contract with C for sale of land owned by B. However, A had no authority to represent to conclude the contract. In the case that C was negligent in not knowing that A had no authority to represent, even if A knew themselves to have no authority to represent, A is not liable to C as an unauthorized agency.\n": "5",
    "\nA claim for damage due to non-performance is extinguished by prescription,if the obligee does not exercise the right within five years from the time when the obligee came to know that it was exercisable.\n": "18",
    "\nThe right to rescind an act induced by fraud is extinguished by prescription, if the obligee does not exercise the right within five years from the time of the act.\n": "18",
    "\nThe claim for compensation for loss or damage in torts is extinguished by prescription, if the obligee does not exercise the right within 20 years from the time of the tortious act.\n": "9 22",
    "\nIf a right for which a period of prescription shorter than 10 years is provided is determined by a final and binding judgment, the period of prescription of the right is shorter one.\n": "7",
    "\nA claim for periodic payments is extinguished by prescription, if the obligee does not exercise each claim for the delivery of things such as money arising from the claim for periodic payments within 10 years from the time when the obligee comes to know that each claim is exercisable.\n": "18",
    "\nA took the jewelry that B had forgotten, believing without negligence that it belonged to A. In this case, A may not obtain the ownership of the jewelry by good faith acquisition.\n": "11 13",
    "\nA stole the jewelry that B had leased from C, and gave it to D. If D received the actual delivery of the jewelry believing without negligence that it belonged to A, B may demand the return of the jewelry from D within two years from the time of the theft.\n": "20 4 14",
    "\nA has leased a copying machine owned by A to B, and B has not returned it by using it even after the termination of the lease agreement. In this case, A may demand the return of the copying machine against B by filing an action for recovery of possession.\n": "19",
    "\nB stole A's computer with a sticker \"Owner A\" on the bottom. B transferred the computer to C who does not know the theft, without changing the computer's appearance. In this case, A may not demand the return of the computer by filing an action for recovery of possession.\n": "9 7",
    "\nA has leased a machine tool owned by A to B, and C stole the machine tool from B within the duration of the lease agreement. In this case, B may file an action for recovery of possession against C independently of A.\n": "4 6",
    "\nB obtained A's bicycle by fraud. In this case, A may demand the return of the bicycle against B by filing an action for recovery of possession.\n": "4 20 14",
    "\nA had owned land in an area of holiday homes. B, who owned neighboring land, began to construct a fence on A's land crossing the boundary without A's consent, and two years later the fence was completed. As of this time, A may not demand the removal of the fence against B by filing an action for maintenance of possession.\n": "10 12 13",
    "\nThe duration of agreed superficies must be fixed within a duration of 20 years or more but not more than 50 years.\n": "11 12",
    "\nSuperficies are the rights to use a land in order to own structures, or trees or bamboo.\n": "11 12 13",
    "\nAn underground space or airspace may be established as the subject matter of superficies for ownership of structures, through the specification of upper and lower extents.\n": "10",
    "\nIn order to preserve the effectiveness of statutory liens for construction work for immovables, the budgeted expenses of the construction work must be registered prior to the commencement of the same.\n": "15",
    "\nAn obligor (A) created a mortgage for an obligee (B) on the real property owned by A and the creation was registered. A may assert the extinctive prescription of the mortgage if 20 years have passed from the time when it becomes exercisable, even if the claim the mortgage secures is not extinguished.\n": "17",
    "\nSuppose that obligator (A) sets a mortgage on his real estate for obligee (B).\nAn obligee (B) may assign the order of priority of a mortgage to another obligee(C) of obligator (A) before the principal is crystallized.\n": "17",
    "\nSuppose that obligator (A) sets a mortgage on his real estate for obligee (B).\nIf there is a subordinated mortgagee(F), in order for A and B to effect the changes of the principal crystallization date of the revolving mortgage, the consent of F must be obtained.\n": "17",
    "\nThe contract for sale does not become effective in the case where X is burned down the day before the day of the conclusion of the contract.\n": "19",
    "\nIf, after the conclusion of the contract for sale, a buyer (B) pays 1000000 yen for X, but before a seller (A) delivers X to B, X is burned-out due to grounds attributable to B, and A obtains 700,000 yen of the insurance money for damage caused by the destruction of X, B may claim payment of 700,000 yen to A.\n": "19",
    "\nIf, after the conclusion of the contract for sale and before A delivers X to B, X is burned down caused by negligence of a third party, the debt to pay the price of B is extinguished by operation of law.\n": "19",
    "\nIf A tenders the performance of the obligation of delivery of X and B refuses to accept without a legitimate reason,and X is lost due to gross negligence of A while in custody of X by A, B may not refuse to pay the price.\n": "19",
    "\nIn the case that an obligee (C) files an action concerning demand for rescission of fraudulent act, an obligor (A) must be stood as a defendant.\n": "18",
    "\nIf beneficiary (B) sells and delivers X to a subsequent acquirer (D), who knows that the gifts of X will prejudice the obligee of A, C may claim to D to rescind the sale between B and D.\n": "19",
    "\nIf B sells and delivers X to D, who knows that the gift of X will prejudice the obligee of A, C may claim to B to rescind the gift between A and B.\n": "19",
    "\nA final and binding judgment upholding demand for rescission of fraudulent act of C is effective against all obligees of A.\n": "18",
    "\nIf B sells and delivers X to D, who knows that the gifts of X will prejudice the obligee of A and judgment upholding demand for rescission of fraudulent act of C has become final and binding, D may demand the return of the price from B.\n": "19",
    "\nIn the case that an obligee (D) files an action concerning demand for performance of an obligation (X) and judgment upholding the demand has become final and binding, if neither D nor an obligor (B) manifests a particular intention, a new period of extinctive prescription of X commences to run at the time when the judgment has become final and binding.\n": "18",
    "\nIn the case that D manifests the intention to release another obligor (C) from the obligation to D, even if neither D nor B manifests a particular intention, D may not claim the payment of 600,000 to another obligor (A).\n": "18",
    "\nIf D owes C a debt (Y) of 300000 yen that is set off against the debt (X), and D demands payment of 600000 yen from A while C does not use a set-off for the debt (Y), A may refuse to pay 200000 yen of that debt.\n": "19",
    "\nIn the case that D owes C a debt (Y) of 200000 yen that is set off against the debt (X), if A, knowing that C is a joint and several obligor of the debt (X), pays 600000 yen to D and claims reimbursement from C without giving notice to C and C duly asserts a set-off as defense against A, A may request D to pay 200000 yen of Y which should have been extinguished due to set-off.\n": "18",
    "\nIf a deposit claim held by A against Bank (B) is subject to a special agreement that it cannot be assigned, even if A enters into an agreement with G to assign the deposit claim, the assignment will not be effective if G was in bad faith or grossly negligent with respect to the special agreement.": "18",
    "\nIf a third-party collateral provider paid a secured claim, the third-party collateral provider may exercise the secured claim acquired through subrogation without requirement for perfection.\n": "18",
    "\nIf a guarantor has partially paid a secured claim but there is a remaining obligation, the guarantor may independently exercise the secured claim and the security right acquired through subrogation in proportion to the value of the subrogee's performance.\n": "18",
    "\nIn case that the obligee is found to have reasonable grounds in light of the common sense in the transaction for causing the security to be diminished, the guarantor may not assert that the guarantor is relieved from responsibility to the extent that that the guarantor can no longer seek the reimbursement due to the diminution in the security available upon subrogation.\n": "18",
    "\nUnless the parties manifest a particular intention with respect to a claim which bears interest, the rate of the interest is the statutory interest rate as of the time when the interest first accrues.\n": "18",
    "\nUnless a particular intention is manifested with respect to the place where the performance should take place, even if X was located at the domicile of D at the time of the conclusion of contract for sale, the delivery of X must be effected at the current domicile of B.\n": "18 19",
    "\nIf B makes an agreement with E to transfer contractual status of the buyer to E, regardless of whether A consents, the status of the buyer is transferred to E.\n": "19",
    "\nIf the contract of sale stipulates that F, who was not born at the time of the conclusion of the contract, is to acquire the ownership of X, the contract of sale is invalid.\n": "19",
    "\nIf A delays in delivering X after the contract of sale stipulates that a third party (G) is to acquire the ownership of X and G manifests intention of availing of the benefit, B may not cancel the contract of sale without G's consent.\n": "19",
    "\nIn the case that the seller cannot acquire and transfer the rights to the buyer, if the buyer, at the moment of the contract, knows that the rights the buyer has bought do not belong to the seller, it shall not preclude a buyer from making a claim for damages.\n": "19",
    "\nIn the case that the seller cannot acquire and transfer the rights to the buyer, the buyer may claim to seller compensation for loss or damage even if the case is not caused by grounds attributable to the seller.\n": "19",
    "\nIf the seller cannot transfer any part of the rights which are the subject matter of the sale because the part of the rights belong to others and it is impossible to cure the non-conformity of performance, the seller may immediately claim a reduction of the purchase money without demand.\n": "19",
    "\nIn the case that the seller cannot acquire and transfer the rights to the buyer, if the buyer, at the moment of the contract, knows that the rights the buyer has bought do not belong to the seller, the seller may not cancel the contract.\n": "19",
    "\nIn the case that the seller cannot acquire and transfer the rights to the buyer, the buyer may not make a claim for damages to the seller in good faith without giving a notice within a year from the time when the seller knows the fact that the rights belong to others.\n": "19",
    "\nIf a leased immovables are assigned and the status of the lessor is transferred to the assignee,the assignee thereof succeeds to the obligation of assignor to reimburse expenses to the lessee.\n": "19",
    "\nA lessor assumes an obligation to effect repairs necessary for using and making profit of the leased thing even if repairs are necessary due to any grounds attributable to the lessee.\n": "19",
    "\nIf it comes to no longer be possible to use or profit from part of a leased thing due to grounds such as loss and this is caused by grounds not attributable to the lessee, the rent is reduced in proportion to the value of the part that can no longer be used or profited from.\n": "19",
    "\nIf the lessee lawfully subleases a leased thing, the lessor may not duly assert against the sublessee the cancellation by agreement of the lease with the lessee even if the lessor has a right to cancel due to non-performance on the part of the lessee at the time of the cancellation.\n": "19",
    "\nIf The lessee is not obligated to restore any wear of the leased thing caused by the ordinary manner of using and making profit from it when the lease is terminated.\n": "19",
    "\nA party that has cancelled a mandate, notwithstanding the time of the cancellation, is not liable to the other party for compensation for loss or damage.\n": "19",
    "\nThe provisions regarding mandate of juridical acts do not apply mutatis mutandis to entrustments of business that do not constitute juridical acts.\n": "8 19",
    "\nThe mandatary may not request the costs that are incurred in administering the mandated business until after having paid those costs.\n": "19",
    "\nIf a mandate is terminated because the mandator has become subject to an order commencing bankruptcy proceedings, the mandator may not assert against the mandatary unless the mandatary was notified of or knew of the fact that the mandator is subject to the order commencing bankruptcy proceeding.\n": "19",
    "\nA partner may independently exercise the rights with regard to a monetary claim that is included in the partnership property in proportion to each co-owner's interest.\n": "19",
    "\nThe partnership business is decided by the majority of the partners even if any person is delegated to be a person who executes business.\n": "19 5",
    "\nEven if the duration of the partnership is specified, each partner may withdraw if there is a compelling reason to do so.\n": "19",
    "\nA new partner that is admitted to a partnership after it is formed is not liable to perform the obligations of the partnership that arose before that partner's admission.\n": "19",
    "\nA partner may seek the division of the partnership property before liquidation if the consent of the majority of partners exists.\n": "19",
    "\nA person who misunderstands due to negligence that the due date arrives and has paid money or delivered anything as performance of an obligation that has not yet fallen due may demand the return of the money paid or thing delivered before the arrival of the due date.\n": "18",
    "\nA person who misunderstands that the person is an obligor and has performed an obligation may not demand the return of subject matter of the performance if the obligee, acting in good faith, has lost the claim by prescription.\n": "18",
    "\nIf a person that holds a monetary claim has borne an obligation for compensation for loss or damage for injury to the obligor of that monetary claim, the person may not duly assert against the obligor, a set-off using the monetary claim against the obligation for compensation.\n": "18",
    "\nAn act that is voidable on the grounds of a mistake may also be rescinded by the successor of the contractual status of the person who made the manifestation of intention by mistake.\n": "5",
    "\nThe postponement of expiry of prescription period is not effective against the successors of the parties with respect to whom grounds to postpone the expiry of prescription period have arisen.\n": "7",
    "\nA universal successor to a possessor may also assert the successor's own possession only.\n": "9 7",
    "\nA claim that a co-owner (A) holds against another co-owner (B) with respect to the property in co-ownership may not be exercised against B's specific successors.\n": "10",
    "\nIf the obligor of an alternative obligation manifests the intention to exercise the right to choose, the manifestation may not be withdrawn without the consent of the obligee even before the due date of the obligation.\n": "18",
    "\nThe manifestation of intention to cancel may not be revoked.\n": "8 19",
    "\nIn the event that a declaration of disappearance is rescinded, a person who has acquired property due to the declaration of disappearance must return to the missing person the full amount of the benefits received from the acquisition of the property, even if the person acted in good faith regarding the survival of the missing person.\n": "2",
    "\nWhen a declaration of disappearance is made on the grounds that it has been unclear whether a person who was exposed to a danger likely to result in a person's death is dead or alive for one year after the danger has passed, the person subject to the declaration of disappearance is deemed to have died when that danger had passed.\n": "2",
    "\nIf A, who was subject to a declaration of disappearance and was deemed to have died, had purchased land X from B before the declaration of disappearance was rescinded, this sales contract is effective only if B acted in good faith regarding the declaration of disappearance.\n": "13",
    "\nWhere a person made a manifestation of intention while knowing that it does not reflect that persons true intention, even if the other party did not specifically know the true intention of the person who made the manifestation, the manifestation of intention is void if the other party knew or could have known that the manifestation of intention was not the true intention of the person who made it.\n": "5",
    "\nIf a third party commits a fraud inducing a first party to make a manifestation of intention to a second party, the first party may void the manifestation of intention even if the second party did not know that fact but could have known it.\n": "5",
    "\nIf the manifestation of intention of a person is held void on the ground that it does not reflect that persons true intention, such nullity may be duly asserted against a third party in good faith acting with negligence.\n": "5",
    "\nThe rescission of a manifestation of intention induced by duress may not be duly asserted against a third party in good faith acting without negligence.\n": "18",
    "\nA sent a notice of intention to cancel the contract to B, who is a minor, B received the notice, and B's legal representative learned the manifestation of intention to cancel. In this case, A may assert against B the manifestation of intention.\n": "19",
    "\nA sent a notice of intention to cancel the contract to B by e-mail, but the notice did not reach B due to a problem with the communication system. In this case, As manifestation of intention to cancel is effective.\n": "19",
    "\nA repeatedly sent B a notice of intention to cancel the contract, but B refused to receive it without a legitimate reason. In this case, A's manifestation of intention to cancel is deemed to have reached B.\n": "19",
    "\nA wanted to send B a notice of intention to cancel the contract but did not know where B was, and the manifestation of intention to cancel was made by means of public notice. In this case, even if A was negligent in not knowing the whereabouts of B, the manifestation of intention to cancel made by A is effective.\n": "19",
    "\nA died after sending B a notice to cancel the contract, and the notice subsequently reached B. In this case, the effect of A's manifestation of intention to cancel is not impaired.\n": "19",
    "\nIf an agreement is made at 3:00 p.m. on May 16 of a given year that the obligation will be fulfilled within one week, the period commences at twelve midnight of the same day, which does not fall on Sunday, holiday as provided in the Act on National Holidays, or any other holiday.\n": "21 6",
    "\nIf an agreement is made at 11:00 a.m. on July 12 of a given year that the obligation will be fulfilled within one month, the period expires at 12:00 p.m. on August 13 of the same year, both of which do not fall on Sundays, holidays as provided in the Act on National Holidays, or any other holidays.\n": "19",
    "\nIf an agreement is made at 10:00 a.m. on June 3 of a given year that the obligation will be fulfilled within five hours,the period commences at 10:00 a.m. of the same day, which does not fall on Sunday, holiday as provided in the Act on National Holidays, or any other holiday.\n": "11 6",
    "\nIf an agreement is made at 5:00 p.m. on January 30 of a non-leap year that the obligation would be fulfilled within one month, the period expires at 12:00 p.m. on February 28 of the same year, both of which do not fall on Sundays, holidays as provided in the Act on National Holidays, or any other holidays.\n": "21 6",
    "\nIf the last day of the period provided by agreement falls on a Sunday, and it is customary to do business on that Sunday, the period expires on that day. \n": "6",
    "\nIf the obligee makes the second demand during the postponement of expiry of the prescription period granted on the ground of the first demand, the prescription period does not expire until six months have passed from the time of the second demand.\n": "7",
    "\nWhen a provisional seizure of immovables has been made, a new period of the extinctive prescription of the preserved claim commences to run at the time when the provisional seizure is registered.\n": "14 7",
    "\nIf a demand by litigation was made and the lawsuit pertaining to the demand is subsequently terminated by withdrawal of the action, the period of prescription does not expire until six months have passed from the time of the termination.\n": "7",
    "\nIn the case where A has created a first-ranked mortgage for B and a second-ranked mortgage for C on land X owned by A, and the mortgages were registered, even if C subsequently acquires land X by inheritance from A, the second-ranked mortgage will not be extinguished due to merger of rights.\n": "17",
    "\nAfter A sold land X owned by A to B, B resold land X to C, and each of them was registered as such. Later, the sales contract between A and B was voided on the grounds that A was an adult ward. If C did not know without negligence that A was an adult ward, A may not claim that the ownership of land X belongs to A.\n": "10 11 12 13",
    "\nAfter A sold land X owned by A to B, B resold land X to C, and each of them was registered as such. After that, A voided the sales contract with B on the ground of fraud. If C did not know without negligence that A's manifestation of intention to sell was induced by fraud, the acquisition of the ownership of land X is not impaired.\n": "10 11 12 13",
    "\nThe person who has inherited the ownership of the dominant land alone also inherits the servitude on the land, unless otherwise provided in the act creating the servitude.\n": "13",
    "\nIn the case where A has started construction work to develop residential land on land X owned by A, and a danger exists in the neighboring land due to the construction, B, who lives on land Y can file an action for preservation of possession against A even if one year has passed since the start of construction, before the construction is completed.\n": "10 12 13",
    "\nWhen A sells movable X in his possession to B, and manifests the intention to thenceforward possess X on behalf of B, B acquires the possessory rights of X.\n": "9",
    "\nWhen B, who had been in possession of movable X by leasing them from their owner A, made an agreement with A to purchase X from A and transfer A's right of possession, B's possession is regarded as possession with the intention to own them.\n": "7",
    "\nIf A leases movable X owned by B to C without permission, and then X is damaged due to grounds attributable to C, C who is asked by B to return X, must compensate for the entire loss or damage, even if C believed without negligence that A was the owner of X.\n": "10",
    "\nA co-owner of gold bullion may demand the partition of the movable property at any time, if the co-owners has not contracted not to partition.\n": "11 12 13",
    "\nEach co-owner provides warranty in proportion to each co-owners interest, with regards to the thing other co-owners have acquired by the partition of the property in co-ownership.\n": "10",
    "\nIf, in a judicial decision seeking partition of property in co-ownership, the property in co-ownership cannot be partitioned in kind, or it is likely that the value thereof will be significantly reduced by the partition, the court shall order the sale of the same at auction.\n": "10",
    "\nThe extinctive prescription of the claim secured by the right of retention does not run while the holder of the right of retention exercises the right of retention and retains the subject matter.\n": "14 7",
    "\nIn cases where a lessee of a building has exercised a right of retention to secure reimbursement of the beneficial expenses after the termination of the lease, the right of retention will be extinguished if the court grants a period of time for the reimbursement at the request of the lessor.\n": "19",
    "\nThe holder of the right of retention may, with the consent of the obligor, lease the thing retained to a third party and appropriate the rent thereof to the satisfaction of that holders own claim.\n": "20 14",
    "\nA person may not create more than one pledge on the same movables.\n": "16",
    "\nWhen the secured claim is not satisfied, a pledgee of movables may request the court to immediately appropriate the thing pledged to satisfy the claim in accordance with the evaluation of an appraiser only if there are reasonable grounds.\n": "16",
    "\nA pledgee of movables may not have a pledgor possess the thing pledged on behalf of the pledgee.\n": "16",
    "\nWhen a pledgee of movables has the right to demand interest on the secured claim, a pledgee of movables may exercise the pledge solely with respect to the interest of the last two years before maturity.\n": "16",
    "\nEven if a pledgee of movables paid necessary expenses for the thing pledged, the pledgee may not demand the reimbursement for the necessary expenses to the possessor.\n": "16",
    "\nIf a building is constructed on the land after a mortgage was placed on the land, the mortgagee may auction the building, which is unmortgaged, all at once with the land.\n": "17",
    "\nIf the obligee is negligent regarding non-performance, the court may deny the responsibility of the compensation for loss or damage, taking into consideration the negligence by the obligee. \n": "18",
    "\nThe compensation for loss or damage due to non-performance may not be satisfied by any method other than the payment of the money.\n": "18",
    "\nThe obligor may not be exempted from the responsibility on the ground of force majeure with respect to the compensation for loss or damage for failure to perform the obligation of payment of the loan pursuant to the monetary loan agreement.\n": "19",
    "\nThe obligee may claim the compensation for damage which has arisen from any special circumstances only if the party did foresee the circumstances.\n": "18",
    "\nWhen there is an agreement on the amount of liquidated damages with respect to the failure to perform the obligation in lieu of the performance of the obligation, the exercise of the cancellation right on the ground of the non-performance may not be precluded even after the obligor offered to pay the amount of liquidated damage.\n": "18",
    "\nThe agreement on the penalty is presumed to be an agreement on payment of certain amount of money in addition to the compensation for the actual damage due to the non-performance.\n": "18",
    "\nThere is an agreement on the amount of liquidated damages with respect to the failure to perform the obligation in the standard terms of contract, and the counterparty of the preparer of the standard terms requested the disclosure of the details of the standard terms of contract before the a standard transaction. However, the agreement on standard transaction was made without the preparer of the standard terms disclosing the detail with no legitimate reasons.\nIn this case, the agreement on the amount of liquidated damages will not be deemed to be made.\n": "19",
    "\nThe obligee may not exercise the right of the obligor, if the right is immune from attachment.\n": "18",
    "\nThe obligor may exercise subrogor's right even after the obligee notified that obligee had exercised the subrogors right. \n": "18",
    "\nIf the obligee files an action concerning the exercise of the subrogor's right, the obligee must give a notice of suit to the obligor without delay.\n": "18",
    "\nSuppose that the individual A guaranteed the obligation of B against C. If A seeks to give a guarantee for obligations arising from business of B as requested by B, B must provide A with information concerning the status of assets, and income and expenditure of B.\n": "22",
    "\nSuppose that the individual A guaranteed the obligation of B against C. When B had the benefit of time and forfeited the benefit, C must notify A to that effect.\n": "3 22",
    "\nSuppose that the individual A guaranteed the obligation of B against C. If the obligation of B guaranteed by A is a loan obligation to be assumed for business of B, the guarantee contract between A and C will become effective by manifesting the intention to perform the guarantee obligation by means of a notarial instrument.\n": "18",
    "\nSuppose that the individual A guaranteed the obligation of B against C. If A makes a contract for a revolving guarantee and there is no provision of the maximum amount, the revolving guarantee will not become effective.\n": "18",
    "\nSuppose that the individual A guarantees the obligation of B against C. When A gave a guarantee for the obligation as requested by B, C must regularly provide A with information concerning whether or not there has been a default in terms of the principal of the principal obligation or any interest, as well as the remaining amount of these items and the amount of those already due.\n": "22",
    "\nEven if the initial obligor has a right to rescind the act that is the source of the obligation assumed by the obligator on the ground of fraud, the additional obligor or new obligor may not refuse to perform the obligation to the obligee.\n": "18",
    "\nWhen an additional obligor resulting from the assumption of obligation not releasing an old obligor performed the assumed obligation, the additional obligor may demand reimbursement from the initial obligor for the proportion to the initial obligors shares of the obligation.\n": "18",
    "\nEven if it is against the will of initial obligor, assumption of obligation not releasing obligor is effected by a contract between the obligee and the person that becomes the additional obligor.\n": "18",
    "\nIn an assumption of obligation releasing old obligor, an obligee may not transfer a security right that has been created as security for the obligation from which the initial obligor is released, to the obligation assumed by the replacing obligor.\n": "18",
    "\nWhen a contract of the assumption of obligation releasing an old obligor is concluded between the initial obligor and the person that becomes the replacing obligor, the initial obligor and the person that becomes the replacing obligor may assert against the obligee the effect of the assumption by the notification to the obligee or the consent by obligee.\n": "18",
    "\nClaim X is A's claim against B, and claim Y is B's claim against A. If F, A's creditor, attaches claim X after the due date for claim X has arrived, B may duly assert against F a set-off based on claim Y against claim X even before the due date for claim Y, which was acquired before the attachment.\n": "19",
    "\nClaim X is A's claim against B, and claim Y is B's claim against A. Claim Y was assigned to B from another person after claim X had been attached by D, A's creditor. In this case, even if claim Y has arisen from a cause that existed before the attachment, B may not duly assert against D a set-off based on claim Y against claim X.\n": "18",
    "\nClaim X is A's claim against B, and claim Y is B's claim against A. A assigns claim X to G, and B acquires claim Y after the requirements for perfection of the assignment have been satisfied. In this case, even if claim Y is a claim that has arisen between A and B based on a cause that existed before the time of the completion of the perfection, B may not duly assert against G a set-off based on claim Y against claim X.\n": "18",
    "\nClaim X is A's claim against B, and claim Y is B's claim against A. Claim X was assigned to A from E, and claim X was E's claim against B for loss or damage based on B's tort committed in bad faith. In this case, B may duly assert against A a set-off based on claim Y against claim X.\n": "9 22 14",
    "\nIf the holder of the right to cancel negligently makes it impossible to return the object of the contract, the right to cancel is extinguished even if the holder of the right to cancel does not know of the holders right to cancel. \n": "19",
    "\nIf no period of time is specified for the exercise of the right to cancel, the right to cancel is extinguished if no notice of cancellation is received within that period, even though the other party has issued a notice of demand to the holder of the right to cancel, specifying a reasonable period of time, to the effect that the holder of the right to cancel is to give a definite answer as to whether the holder will cancel or not within that period of time.\n": "19",
    "\nIf, due to the nature of the contract or a manifestation of intention by the parties, the purpose of the contract cannot be achieved unless the obligation is performed at a specific time on a specific date or within a certain period of time, and the obligor fails to perform the obligation at that time or before that period of time expires, the validity of the obligation will be extinguished without cancelling the contract by operation of law.\n": "19",
    "\nIn restoring to the original state when the right to cancel has been exercised, if a thing other than money is to be returned, fruits that have accrued on or after the time of the receipt of the thing must also be returned.\n": "19",
    "\nIf the performance of part of the obligation is impossible and the purpose of the contract cannot be achieved by the performance of the remaining part of the obligation, then the obligee may immediately cancel the contract without making a demand.\n": "19",
    "\nIn the sales contract between A and B, the quantity of the subject matter delivered by the seller A to the buyer B is insufficient and does not conform to the terms of the contract. If the insufficiency in the quantity is due to grounds not attributable to either party, B may not cancel the contract for sale between A and B.\n": "19",
    "\nIn the contract for sale between A and B, the quantity of the subject matter delivered by the seller A to the buyer B is insufficient and does not conform to the terms of the contract. Even if delivery of the replenishment is possible, B may not request delivery of the replenishment.\n": "19",
    "\nIn the contract for sale between A and B, the quantity of the subject matter delivered by the seller A to the buyer B is insufficient and does not conform to the terms of the contract. If the insufficiency in the quantity is due to grounds attributable to B, B may not cancel the contract for sale between A and B.\n": "19",
    "\nIn the contract for sale between A and B, the quantity of the object delivered by the seller A to the buyer B is insufficient and does not conform to the terms of the contract. If B fails to notify A of the non-conformity in the quantity within one year from the time when B becomes aware of it, B may not claim compensation for loss or damage, unless A knew or did not know due to gross negligence the non-conformity in the quantity at the time of the delivery.\n": "19",
    "\nIn the contract for sale between A and B, the quantity of the subject matter delivered by the seller A to the buyer B is insufficient and does not conform to the terms of the contract. If the insufficiency in the quantity is due to grounds attributable to B, B may not demand delivery of the replenishment even if delivery of the replenishment is possible.\n": "19",
    "\nGifts on donors death do not need to be made in writing, but can be concluded only by agreement of the parties.\n": "19",
    "\nIn the case of gifts with burden, the donor may not cancel the gift on the ground that the donee has failed to perform the obligation that is donees burden.\n": "19",
    "\nUnless otherwise agreed, it is sufficient for the donor to deliver the thing that is the subject matter of the gift, while maintaining its condition  as of the time when it is specified as the subject matter of the gift.\n": "19",
    "\nThe donee may not cancel the gift with respect to the portion for which performance has not been completed, even if the gift is not made in writing.\n": "19",
    "\nA entered into a contract of loan for use with B to allow B to make use of building X owned by A. B may allow  third parties to make use of building X without obtaining As approval.\n": "19",
    "\nA entered into a contract of loan for use with B to allow B to make use of building X owned by A. If the purpose of the contract of loan for use between A and B was for B to hold exhibition Y, it would be terminated when B finished using the building as a venue for exhibition Y, even if the parties do not specify a period of the loan for use.\n": "19",
    "\nA entered into a contract of loan for use with B to allow B to make use of building X owned by A. If the contract of loan for use between A and B is not made in writing, A may cancel the contract at any time until building X is delivered to B.\n": "19",
    "\nA entered into a contract of loan for use with B to allow B to make use of building X owned by A. B attached removable shelves on the wall of building X upon making use of it. When the contract of loan for use is terminated, B must remove the shelves unless excessive expenses are required for the detachment.\n": "16 18 19",
    "\nA entered into a contract of loan for use with B to allow B to make use of building X owned by A. If B has defrayed the ordinarily necessary expenses with respect to building X, B may demand the reimbursement of the necessary expenses from A.\n": "19",
    "\nA person with no authority of disposition may not grant a lease for a term that exceeds the period of the short-term leases.\n": "19",
    "\nEven if a lessee of land that is meant for cultivation obtains profits less than the rent due to force majeure, the lessee may not demand that the amount of the rent be reduced.\n": "19",
    "\nWhen immovables that are leased are assigned, even if the assignor and the assignee agree to transfer the status of lessor to the assignee, the status of lessor may not be transferred to the assignee without the consent of the lessee.\n": "19",
    "\nIf it comes to no longer be possible to use or profit from the whole of a leased thing due to grounds such as loss, the lease is terminated thereby.\n": "19",
    "\nIf the lessee of immovables satisfies the requirements for perfection, the lessee may demand that a third party return the immovables when the third party is in possession of the immovables without legitimate title.\n": "19",
    "\nA bailment becomes effective if one of the parties asks the other party to keep a certain thing in custody, and the other party gives consent to keeping it in custody.\n": "19",
    "\nIf the parties specify the time for the return of the bailed things, the bailor may not demand the return of the same until the time for the return has arrived.\n": "19",
    "\nThe bailee may, without the consent of the bailor, have a third party keep the bailed thing in custody when there is a compelling reason to do so.\n": "19 5",
    "\nIf the things bailed by two or more persons are the same in kind and quality, the bailee may keep these things in custody by mixing them without obtaining the consent of the respective bailors.\n": "19",
    "\nIf a third party claiming rights with respect to the bailed thing has filed a lawsuit against the bailee, the bailee must notify the bailor of that fact without delay, unless the bailor already knows it.\n": "19",
    "\nIf monies are the subject of contribution, a partner who fails to make the contribution must pay interest on the same and otherwise compensate for loss or damage.\n": "19 5",
    "\nIf parties have not specified the proportions of distributions of the partnership's profits and losses in a partnership contract, profits and losses are distributed to each partner in equal proportions. \n": "19",
    "\nA creditor of a partnership may, at the choice of the creditor, exercise the rights of the creditor against each partner in equal proportions, even if a creditor of a partnership knew the proportion of each partner's share of loss at the time of occurrence of the claim.\n": "19",
    "\nA withdrawing partner is liable to perform obligations of the partnership that have arisen before that partner's withdrawal, to the extent of that partner's previous liability.\n": "19",
    "\nA partner's creditor may exercise the rights of that creditor against the partnership property to the extent of the partners interest.\n": "19",
    "\nIf a minor has inflicted damage on another person, the person with parental authority over the minor may be liable to compensate for the damage, but the minor will never be liable to compensate for the damage.\n": "22",
    "\nIf the contractor inflicts damage on a third party with respect to the contractors work, a party ordering work who is not negligent with regards to the order or instructions is not liable to compensate for the damage.\n": "19",
    "\nA person who has inflicted damage on another person while in a condition wherein the person lacked the capacity to appreciate their own liability for their acts is liable to compensate for this, if the person has temporarily caused that condition, intentionally or negligently.\n": "22",
    "\nThe claim for compensation for loss or damage for death or injury to person caused by tort is not extinguished by prescription.\n": "22",
    "\nEven if an employer compensates a third party for damage based on the liability of employers for the employee's harmful act, the employer's right to reimbursement against the employee does not arise.\n": "4 6",
    "\nB, who had possessed land X in bad faith , may not claim reimbursement from A for the ordinary and necessary expenses defrayed with respect to land X when land X is returned to A.\n": "11 12 13",
    "\nIf the obligor has tendered the performance but the obligee's inability to accept the performance of an obligation results in increasing the expenses for the performance, the amount of increase is borne by the obligor.\n": "18",
    "\nThe expenses associated with conclusions of lease contracts are borne equally by both parties.\n": "19",
    "\nA contract of monetary loan for consumption, even if made in writing, does not become effective until the borrower receives the agreed-upon money from the lender.\n": "19",
    "\nA guarantee contract becomes effective even if no written document is prepared but the agreement is made by means of sending and receiving e-mail to each other.\n": "19",
    "\nA bailee of a bailment contract for value not made in writing may cancel the contract up until the bailee receives the bailed thing.\n": "19"
}