[
    "Article 1  (1) Private rights must be congruent with the public welfare.\n(2) The exercise of rights and performance of duties must be done in good faith.\n(3) Abuse of rights is not permitted.",
    "Article 2  This Code must be construed so as to honor the dignity of individuals and the essential equality of both sexes.",
    "Article 3  (1) The enjoyment of private rights commences at birth.\n(2) Unless otherwise prohibited by applicable laws, regulations, or treaties, foreign nationals enjoy private rights.",
    "Article 3-2  If the person making a juridical act did not have mental capacity when manifesting the relevant intention, the juridical act is void.",
    "Article 4  The age of majority is 20 years of age.",
    "Article 5  (1) A minor must obtain the consent of the minor's legal representative to perform a juridical act; provided, however, that this does not apply to a juridical act for merely acquiring a right or being released from an obligation.\n(2) A juridical act in contravention of the provisions of the preceding paragraph is voidable.\n(3) Notwithstanding the provisions of paragraph (1), a minor may freely dispose of property that the legal representative has permitted the minor to dispose of for a specified purpose, to an extent that falls within the scope of that purpose. The same applies if the minor disposes of property that the legal representative has permitted the minor to dispose of without specifying a purpose.",
    "Article 6  (1) A minor who is permitted to conduct one or multiple types of business has the same capacity to act as an adult as far as that business is concerned.\n(2) In a case as referred to in the preceding paragraph, if there are grounds that make the minor unable to sustain that business, the legal representative may revoke or limit the permission therefor in accordance with the provisions of Part IV (Relatives).",
    "Article 7  The family court may decide to commence a guardianship in respect of a person who constantly lacks the capacity to appreciate the person's own situation due to a mental disorder, at the request of the person in question, that person's spouse, that person's relative within the fourth degree of kinship, the person's guardian of a minor, the person's supervisor of a minor's guardian, the person's curator, the person's curator's supervisor, the person's assistant, the person's assistant's supervisor, or a public prosecutor.",
    "Article 8  A person subject to a decision for commencement of guardianship becomes an adult ward, and an adult guardian is appointed for that person.",
    "Article 9  A juridical act performed by an adult ward is voidable; provided, however, that this does not apply to the purchase of daily necessities or to any other act involved in day-to-day life.",
    "Article 10  If the grounds prescribed in Article 7 cease to exist, the family court must rescind the decision for the commencement of guardianship at the request of the person in question, that person's spouse, that person's relative within the fourth degree of kinship, the guardian (meaning a minor's guardian or an adult guardian; the same applies hereinafter), the guardian's supervisor (meaning the supervisor of a minor's guardian or the adult guardian's supervisor; the same applies hereinafter), or a public prosecutor.",
    "Article 11  The family court may decide to commence a curatorship in respect of a person whose capacity to appreciate their own situation is extremely inadequate due to a mental disorder, at the request of the person in question, the person's spouse, the person's relative within the fourth degree of kinship, the guardian, the guardian's supervisor, the assistant, the assistant's supervisor, or a public prosecutor; provided, however, that this does not apply to a person in respect of whom a cause set forth in Article 7 exists.",
    "Article 12  A person subject to a decision for commencement of curatorship becomes a person under curatorship, and a curator is appointed for that person.",
    "Article 13  (1) A person under curatorship must obtain the consent of the curator in order to perform any of the following acts; provided, however, that this does not apply to an act provided for in the proviso of Article 9:\n(2) At the request of a person as referred to in the main clause of Article 11 or the curator or curator's supervisor, the family court may decide that the person under curatorship must also obtain the consent of the curator before performing an act other than those set forth in each of the items of the preceding paragraph; provided, however, that this does not apply to an act provided for in the proviso to Article 9.\n(3) If the curator does not consent to an act for which the person under curatorship must obtain the curator's consent even though it is unlikely to prejudice the interests of the person under curatorship, the family court may grant permission that operates in lieu of the curator's consent at the request of the person under curatorship.\n(4) An act for which the person under curatorship must obtain the curator's consent is voidable if the person performs it without obtaining the curator's consent or a permission that operates in lieu of it.",
    "Article 14  (1) If the grounds prescribed in the main clause of Article 11 cease to exist, the family court must rescind the decision for the commencement of curatorship at the request of the person in question, that person's spouse, that person's relative within the fourth degree of kinship, the guardian of a minor, the supervisor of a minor's guardian, the curator, the curator's supervisor, or a public prosecutor.\n(2) At the request of a person provided for in the preceding paragraph, the family court may rescind all or part of the decision referred to in paragraph (2) of the preceding Article.",
    "Article 15  (1) The family court may decide to commence an assistance in respect of a person whose capacity to appreciate their own situation is inadequate due to a mental disorder, at the request of the person in question, that person's spouse, that person's relative within the fourth degree of kinship, the guardian, the guardian's supervisor, the curator, the curator's supervisor, or a public prosecutor; provided, however, that this does not apply to a person with respect to whom there are grounds as prescribed in Article 7 or the main clause of Article 11.\n(2) The issuance of a decision for commencement of assistance at the request of a person other than the person in question requires the consent of the person in question.\n(3) A decision for commencement of assistance must be made concurrent with a decision as referred to in Article 17, paragraph (1) or a decision as referred to in Article 876-9, paragraph (1).",
    "Article 16  A person subject to a decision for commencement of assistance becomes a person under assistance, and an assistant is appointed for that person.",
    "Article 17  (1) At the request of the person referred to in the main clause of Article 15, paragraph (1) or the assistant or assistant's supervisor, the family court may decide that the person under assistance must obtain the consent of the person's assistant in order to perform a specific juridical act; provided, however, that the acts that such a decision may establish as those for which the person must obtain the consent of the assistant are restricted to a part of the acts provided for in Article 13, paragraph (1).\n(2) In order to decide as referred to in the preceding paragraph at the request of a person other than the person in question requires the consent of the person in question.\n(3) If the assistant does not consent to an act for which the person under assistance must obtain the assistant's consent even though it is unlikely to prejudice the interests of the person under assistance, the family court may grant permission that operates in lieu of the assistant's consent, at the request of the person under assistance.\n(4) An act for which the person under assistance must obtain the assistant's consent is voidable if the person performs it without obtaining the assistance's consent or a permission that operates in lieu of it.",
    "Article 18  (1) If the grounds prescribed in the main clause of Article 15, paragraph (1) cease to exist, the family court must rescind the decision for commencement of assistance at the request of the person in question, that person's spouse, that person's relative within the fourth degree of kinship, the guardian of a minor, the supervisor of a minor's guardian, the assistant, the assistant's supervisor, or a public prosecutor.\n(2) At the request of a person as prescribed in the preceding paragraph, the family court may rescind all or part of the decision referred to in paragraph (1) of the preceding Article.\n(3) If rescinding the decision referred to in paragraph (1) of the preceding Article and the decision referred to in Article 876-9, paragraph (1) in their entirety, the family court must rescind the decision for commencement of assistance.",
    "Article 19  (1) If the family court decides to commence a guardianship and the person in question is a person under curatorship or a person under assistance, it must rescind the decision for commencement of the curatorship or commencement of assistance respecting that person.\n(2) The provisions of the preceding paragraph apply mutatis mutandis if the court decides to commence a curatorship and the person in question is an adult ward or a person under assistance or if the court decides to commence an assistance and the person in question is an adult ward or a person under curatorship.",
    "Article 20  (1) After a person with qualified legal capacity who is involved in dealings with another party becomes a person with the legal capacity to act (meaning a person whose legal capacity to act is not subject to restrictions; the same applies hereinafter), the other party to those dealings may fix a period of one month or longer and demand that the person give a definite answer within that period of time as to whether the person will ratify an act that the person may rescind. In such a case, if the person fails to send a definite answer within that period of time, the person is deemed to have ratified that act.\n(2) The second sentence of the preceding paragraph also applies if, before the person with qualified legal capacity becomes a person with the legal capacity to act, the other party to dealings involving the person with qualified legal capacity lodges the demand prescribed in the preceding paragraph with the legal representative, curator, or assistant of that person with respect to an act within the scope of their authority, and they fail to send a definite answer within the fixed period of time referred to in that paragraph.\n(3) If a person does not send notice within the period of time set forth in the preceding two paragraphs indicating that the person has completed any special formalities that an act requires, the person is deemed to have rescinded that act.\n(4) The other party to dealings involving a person with qualified legal capacity may lodge a demand with a person under curatorship or with a person under assistance who is subject to a decision as referred to in Article 17, paragraph (1) to demand that the person get the curator or assistant to ratify an act within the fixed period referred to in paragraph (1). In such a case, if the person under curatorship or person under assistance does not send notice within that period indicating that the person has gotten the curator or assistant to ratify the act in question, the person is deemed to have rescinded that act.",
    "Article 21  If a person with qualified legal capacity uses fraudulent means to induce another person to believe that the person is a person with legal capacity to act, the person may not rescind the act in question.",
    "Article 22  A person's principal place of daily activity is that person's domicile.",
    "Article 23  (1) If a person's domicile is unknown, the person's residence is deemed to be the person's domicile.\n(2) If a person does not have a domicile in Japan, the person's residence is deemed to be the person's domicile, regardless of whether the person is a Japanese national or a foreign national; provided, however, that this does not apply if the law of domicile is to be applied in accordance with the provisions of the laws that establish the governing law.",
    "Article 24  If a temporary address is selected for an act, that temporary address is deemed to be the domicile as far as that act is concerned.",
    "Article 25  (1) If a person who has taken leave of the domicile or residence up until then (hereinafter referred to as an \"absentee\") has not appointed an administrator for the person's property (hereinafter in this Section referred to simply as an \"administrator\"), the family court, at the request of an interested person or a public prosecutor, may order the necessary dispositions with regard to the administration of that property. The same applies if the administrator's authority is extinguished during the absence of the absentee.\n(2) If an absentee appoints an administrator after an order under the provisions of the preceding paragraph has been issued, the family court must rescind that order at the request of the person's administrator, an interested person, or a public prosecutor.",
    "Article 26  If an absentee has appointed an administrator but it is unclear whether the absentee is dead or alive, the family court may replace that administrator with another at the request of an interested person or a public prosecutor.",
    "Article 27  (1) An administrator appointed by the family court pursuant to the provisions of the preceding two Articles must prepare a list of the property that the administrator is to administer. In such a case, the expenses incurred are paid from the property of the absentee.\n(2) If it is unclear whether an absentee is dead or alive and an interested person or a public prosecutor so requests, the family court may also order the administrator appointed by the absentee to prepare the list referred to in the preceding paragraph.\n(3) Beyond what is provided for in the preceding two paragraphs, the family court may order the administrator to make the dispositions that the court finds to be necessary to preserve the property of the absentee.",
    "Article 28  If an administrator needs to perform an act exceeding the authority provided for in Article 103, the administrator may perform that act after obtaining the permission of the family court. The same applies if it is unclear whether the absentee is dead or alive and the administrator needs to perform an act exceeding the authority established by the absentee.",
    "Article 29  (1) The family court may require an administrator to provide reasonable security with respect to the administration and return of the property.\n(2) The family court may grant reasonable remuneration to the administrator from the property of the absentee based on the relationship between the administrator and absentee and other circumstances.",
    "Article 30  (1) If it has been unclear for seven years whether an absentee is dead or alive, the family court may enter a declaration of disappearance at the request of an interested person.\n(2) The provisions of the preceding paragraph also apply if it has been unclear whether a person who has entered a war zone, was aboard a vessel that has sunk, or was otherwise exposed to a danger likely to result in a person's death is dead or alive, for one year after the war has ended, the vessel sank, or such other danger has passed.",
    "Article 31  A person subject to a declaration of disappearance pursuant to the provisions of paragraph (1) of the preceding Article is deemed to have died when the period of time referred to in that paragraph ended, and a person subject to a declaration of disappearance pursuant to the provisions of paragraph (2) of that Article is deemed to have died when that danger had passed.",
    "Article 32  (1) Having received proof that a missing person is alive or that a missing person died at a time different from the time set forth in the preceding Article, the family court, at the request of the missing person or an interested person, must rescind the declaration of that person's disappearance. In this case, the rescission does not affect the validity of any act performed in good faith after the declaration of disappearance but before the rescission thereof.\n(2) A person who has acquired property due to a declaration of disappearance loses the rights in question due to its rescission; provided, however, that the person has the obligation to return that property only to the extent currently enriched.",
    "Article 32-2  If more than one person dies and it is unclear whether one of them was still alive after the death of another, it is presumed that they all died at the same time.",
    "Article 33  A juridical person is not formed other than pursuant to the provisions of this Code or other laws.",
    "Article 34  An not-for-profit association or foundation that is involved in academic activities, art, charity, worship, religion, or any other matter of public interest may be established as a juridical person with the permission of the competent government agency.",
    "Article 35  A person that is neither an incorporated association nor an incorporated foundation must not use in its name the characters \"incorporated association\" or \"incorporated foundation\", or other characters likely to be mistaken for them.",
    "Article 36  (1) With the exception of states, administrative divisions of states, and commercial companies, the formation of foreign juridical persons is not permitted; provided, however, that this does not apply to a foreign juridical persons that is permitted pursuant to the provisions of a law or treaty.\n(2) A foreign juridical person permitted pursuant to the provisions of the preceding paragraph possesses the same private rights as those possessed by a juridical person of the same kind that has been formed in Japan; provided, however, that this does not apply to a right that a foreign national is not entitled to enjoy or to any right for which there are special provisions in a law or treaty.",
    "Article 37  (1) A person seeking to establish an incorporated association must prepare articles of incorporation and include in it the following particulars:\n(2) If a change has been made to a particular set forth in one of the items of the preceding paragraph, a registration of the change must be made within three weeks. In such a case, a change may not be duly asserted against a third party before its registration.\n(3) If an order of provisional disposition suspending the execution of duties by a representative or appointing a person to execute duties in place of a representative is issued or if a ruling modifying or revoking such an order of provisional disposition is issued, it must be registered. In such a case, the provisions of the second sentence of the preceding paragraph apply mutatis mutandis.\n(4) If something that must be registered pursuant to the provisions of the preceding two paragraphs occurs in a foreign state, the period for registration is counted from the day on which notice of this reached the relevant person.\n(5) When a foreign juridical person establishes an office in Japan for the first time, a third party may decline to recognize that corporation's formation until it has been registered in the locality of that office.\n(6) Having relocated its office, a foreign juridical person must register the relocation within three weeks in the former locality and register the particulars set forth in the items of paragraph (1) within four weeks in the new locality.\n(7) If a foreign corporation relocates its office within the jurisdictional district of the same registry office, it is sufficient for it to register its relocation.\n(8) If the representative of a foreign juridical person fails to complete the registration provided for in this Article, the representative is subject to a civil fine of not more than 500,000 yen.\nArticles 38 to 84  Deleted",
    "Article 85  The term \"things\" as used in this Code means tangible objects.",
    "Article 86  (1) Land and any fixtures thereto are immovables.\n(2) Things other than immovables are movables.",
    "Article 87  (1) If the owner of a first thing attaches a second thing that the owner owns to the first thing to serve the ordinary use of the first thing, the thing that the owner attaches is an appurtenance.\n(2) An appurtenance is disposed of together with the principal thing if the principal thing is disposed of.",
    "Article 88  (1) Products obtained from the intended use of a thing are its natural fruits.\n(2) Money and other things that may be obtained in exchange for the use of any thing are civil fruits.",
    "Article 89  (1) The ownership of natural fruits is acquired by the person entitled to obtain them when they are separated from the original thing.\n(2) A person acquires civil fruits in proportion to the duration of the right to obtain them, as calculated on a prorated, daily basis.",
    "Article 90  A juridical act that is against public policy is void.",
    "Article 91  If a party to a juridical act manifests an intention that is inconsistent with the provisions of laws and regulations that are not related to public policy, that intention prevails.",
    "Article 92  If a custom is inconsistent with the provisions of laws and regulations that are not related to public policy and it is found that the party to the juridical act has the intention to abide by that custom, that custom prevails.",
    "Article 93  (1) The validity of a manifestation of intention is not impaired even if the person making it does so while knowing that it does not reflect that person's true intention; provided, however, that if the other party knew or could have known that the manifestation was not the true intention of the person who made it, that manifestation of intention is void.\n(2) The nullity of a manifestation of intention under the provisions of the proviso to the preceding paragraph may not be duly asserted against a third party in good faith.",
    "Article 94  (1) A false manifestation of intention that a person makes in collusion with another person is void.\n(2) The nullity of a manifestation of intention under the provisions of the preceding paragraph may not be duly asserted against a third party in good faith.",
    "Article 95  (1) A manifestation of intention is voidable if it is based on either of the following mistakes, and the mistake is material in light of the purpose of the juridical act and the common sense in the transaction:\n(2) A manifestation of intention under the provisions of item (ii) of the preceding paragraph may be rescinded only if it has been indicated that the circumstances in question are being taken as the basis for the juridical act.\n(3) If a mistake is due to gross negligence on the part of the person making the manifestation of intention, that person may not rescind a manifestation of intention as under paragraph (1), except in the following cases:\n(4) The rescission of a manifestation of intention under the provisions of paragraph (1) may not be duly asserted against a third party in good faith acting without negligence.",
    "Article 96  (1) A manifestation of intention based on fraud or duress is voidable.\n(2) If a third party commits a fraud inducing a first party to make a manifestation of intention to a second party, that manifestation of intention is voidable only if the second party knew or could have known that fact.\n(3) The rescission of a manifestation of intention induced by fraud under the provisions of the preceding two paragraphs may not be duly asserted against a third party in good faith acting without negligence.",
    "Article 97  (1) A manifestation of intention becomes effective at the time notice thereof reaches the other party.\n(2) If the other party prevents notice of a manifestation of intention from reaching them without a legitimate reason, the notice is deemed to have reached that party at the time it would have normally reached them.\n(3) The effect of a manifestation of intention is not impaired even if the person making it dies, loses mental capacity, or becomes subject to restrictions on their legal capacity to act after having sent the notice.",
    "Article 98  (1) A manifestation of intention may be made by means of public notice if the person making it is unable to ascertain who the other party is or is unable to ascertain the whereabouts thereof.\n(2) Public notice as referred to in the preceding paragraph is effected by a notice being posted in the posting area of the relevant court and an indication that that posting has been made being published in the Official Gazette at least once, in accordance with the provisions of the Code of Civil Procedure (Act No. 109 of 1996) on service by publication; provided, however, that if the court finds it to be suitable, it may order that a notice be posted in the posting area of the city office, ward office, town hall, or any facility equivalent to these in lieu of the relevant information being published in the Official Gazette.\n(3) A manifestation of intention by public notice is deemed to have reached the other party once two weeks have passed since the day when the relevant information was last published in the Official Gazette or once two weeks have passed since the day on which the relevant information started to be posted in lieu of being so published; provided, however, that the effect of a manifestation of intention having reached the other party does not arise if the person making it was negligent in not ascertaining the other party or the whereabouts thereof.\n(4) If the person making a manifestation of intention is unable to ascertain who the other party is, the procedures involved in public notice are under the jurisdiction of the summary court that has jurisdiction over the locality where the person making the manifestation of intention is domiciled; if the person making a manifestation of intention is unable to ascertain the whereabouts of the other party, the procedures involved in public notice are under the jurisdiction of the summary court that has jurisdiction over the locality of the last known domicile of the other party.\n(5) The court must have the person making a manifestation of intention prepay the expenses associated with a public notice.",
    "Article 98-2  Any person may not assert a manifestation of intention against the other party thereto if that other party had no mental capacity or was a minor or an adult ward at the time of receiving it; provided, however, that this does not apply after either of the following persons learns of the manifestation of intention:",
    "Article 99  (1) A manifestation of intention that an agent makes indicating that they will be making a manifestation of intention on behalf of the principal within the scope of the agent's authority binds the principal directly.\n(2) The provisions of the preceding paragraph apply mutatis mutandis to a manifestation of intention that a third party makes to an agent.",
    "Article 100  A manifestation of intention that an agent makes without having indicated that they will be acting on behalf of the principal is deemed to be one that the agent has made on their own account; provided, however, that if the other party knew or could have known that the agent was acting on behalf of the principal, the provisions of paragraph (1) of the preceding Article apply mutatis mutandis."
]